[
    {
        "name": "Mrs Harris Goes to Paris & Mrs Harris Goes to New York",
        "description": "\nCOMING IN 2022 - the feel-good classic will be a major film, starring Leslie Manville, Isabelle Huppert, Jason Isaacs and Lucas Bravo'Mrs Harris is one of the great creations of fiction - so real that you feel you know her, yet truly magical as well. I can never have enough of her' Justine Picardie'It is almost impossible not to succumb to Gallico's spell' Times Literary SupplementMrs Harris is a salt-of-the-earth London charlady who cheerfully cleans the houses of the rich. One day, when tidying Lady Dant's wardrobe, she comes across the most beautiful thing she has ever seen in her life - a Dior dress. In all the years of her drab and humble existence, she's never seen anything as magical as the dress before her and she's never wanted anything as much before. Determined to make her dream come true, Mrs Harris scrimps, saves and slaves away until one day, after three long, uncomplaining years, she finally has enough money to go to Paris.When she arrives at the House of Dior, Mrs Harris has little idea of how her life is about to be turned upside down and how many other lives she will transform forever. Always kind, always cheery and always winsome, the indomitable Mrs Harris takes Paris by storm and learns one of life's greatest lessons along the way.",
        "rating": 1,
        "price": 14.4,
        "image": "//prodimage.images-bn.com/pimages/9781408813782_p0_v3_s600x595.jpg",
        "author": "Paul Gallico",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Lies I Tell",
        "description": "\nTHE INSTANT NEW YORK TIMES BESTSELLER!\"A mindbender.\" &#8212;Jessica Knoll\"Riveting...a winner.\" &#8212;Laura Dave\"A knockout.\" &#8212;Mary KubicaFrom the New York Times bestselling author of The Last Flight comes a twisted con-woman thriller about two women out for revenge&#8212;or is it justice?Two women. Many aliases.Meg Williams. Maggie Littleton. Melody Wilde. Different names for the same person, depending on the town, depending on the job. She's a con artist who erases herself to become whoever you need her to be&#8212;a college student. A life coach. A real estate agent. Nothing about her is real. She slides alongside you and tells you exactly what you need to hear, and by the time she's done, you've likely lost everything.Kat Roberts has been waiting ten years for the woman who upended her life to return. And now that she has, Kat is determined to be the one to expose her. But as the two women grow closer, Kat's long-held assumptions begin to crumble, leaving Kat to wonder who Meg's true target is.The Lies I Tell is a twisted domestic thriller that dives deep into the psyches and motivations of two women and their unwavering quest to seek justice for the past and rewrite the future.Praise for The Last Flight by Julie Clark:\"Thoroughly absorbing...the characters get under your skin.\" &#8212;The New York Times\"Highly thrilling.\" &#8212;Entertainment Weekly\"You won't be able to put it down.\" &#8212;People.com",
        "rating": 4,
        "price": 14.99,
        "image": "//prodimage.images-bn.com/pimages/9781728247601_p0_v2_s600x595.jpg",
        "author": "Julie Clark",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Run, Rose, Run",
        "description": "\n<B>THE #1 <I>NEW YORK TIMES BESTSELLER! From America&rsquo;s most beloved superstar and its greatest storyteller&mdash;a thriller about a young singer-songwriter on the rise and on the run, and determined to do whatever it takes to survive. Every song tells a story.&#160; She&rsquo;s a star on the rise, singing about the hard life behind her.&#160; She&rsquo;s also on the run.&#160;<I>Find a future, lose a past.&#160; Nashville is where she&rsquo;s come to claim her destiny.&#160; It&rsquo;s also where the darkness she&rsquo;s fled might find her.&#160; And destroy her.&#160;<I>Run, Rose, Run&#160;is a novel glittering with danger and desire&mdash;a story that only America&rsquo;s #1 beloved entertainer and its #1 bestselling author could have created.",
        "rating": 5,
        "price": 30,
        "image": "//prodimage.images-bn.com/pimages/9780759554344_p0_v4_s600x595.jpg",
        "author": "Dolly Parton and James Patterson",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Ugly Love",
        "description": "\nFrom Colleen Hoover, the #1 New York Times bestselling author of It Ends with Us, a heart-wrenching love story that proves attraction at first sight can be messy. <BR><BR>When Tate Collins meets airline pilot Miles Archer, she doesn't think it's love at first sight. They wouldn&rsquo;t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn&rsquo;t want love, she doesn&rsquo;t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her.<BR> <BR>Never ask about the past. <BR> Don&rsquo;t expect a future.<BR> <BR>They think they can handle it, but realize almost immediately they can&rsquo;t handle it at all.<BR> <BR>Hearts get infiltrated. <BR> Promises get broken. <BR> Rules get shattered.<BR> Love gets ugly.",
        "rating": 3,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781476753188_p0_v9_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "The Love Hypothesis",
        "description": "\nThe Instant New York Times Bestseller and TikTok Sensation!As seen on THE VIEW!A BuzzFeed Best Summer Read of 2021 When a fake relationship between scientists meets the irresistible force of attraction, it throws one woman's carefully calculated theories on love into chaos.As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships&#151;but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks&#58; Scientists require proof. So, like any self-respecting biologist, Olive panics and kisses the first man she sees.That man is none other than Adam Carlsen, a young hotshot professor&#151;and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend. But when a big science conference goes haywire, putting Olive's career on the Bunsen burner, Adam surprises her again with his unyielding support and even more unyielding...six-pack abs.Suddenly their little experiment feels dangerously close to combustion. And Olive discovers that the only thing more complicated than a hypothesis on love is putting her own heart under the microscope.",
        "rating": 4,
        "price": 16,
        "image": "//prodimage.images-bn.com/pimages/9780593336823_p0_v6_s600x595.jpg",
        "author": "Ali Hazelwood",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Ten Restaurants That Changed America",
        "description": "\nFinalist for the IACP Cookbook Award A Washington Post Notable Book of the Year A Smithsonian Best Food Book of the Year Longlisted for the Art of Eating Prize Featuring a new chapter on ten restaurants changing America today, a &#8220;fascinating . . . sweep through centuries of food culture&#8221; (Washington Post). Combining an historian&#8217;s rigor with a food enthusiast&#8217;s palate, Paul Freedman&#8217;s seminal and highly entertaining Ten Restaurants That Changed America reveals how the history of our restaurants reflects nothing less than the history of America itself. Whether charting the rise of our love affair with Chinese food through San Francisco&#8217;s fabled Mandarin; evoking the poignant nostalgia of Howard Johnson&#8217;s, the beloved roadside chain that foreshadowed the pandemic of McDonald&#8217;s; or chronicling the convivial lunchtime crowd at Schrafft&#8217;s, the first dining establishment to cater to women&#8217;s tastes, Freedman uses each restaurant to reveal a wider story of race and class, immigration and assimilation. &#8220;As much about the contradictions and contrasts in this country as it is about its places to eat&#8221; (The New Yorker), Ten Restaurants That Changed America is a &#8220;must-read&#8221; (Eater) that proves &#8220;essential for anyone who cares about where they go to dinner&#8221; (Wall Street Journal Magazine).",
        "rating": 1,
        "price": 23.95,
        "image": "//prodimage.images-bn.com/pimages/9781631492464_p0_v5_s600x595.jpg",
        "author": "Paul  Freedman",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "A Court of Thorns and Roses (A Court of Thorns and Roses Series #1)",
        "description": "\nThe sexy, action-packed first book in the #1 New York Times bestselling Court of Thorns and Roses series from Sarah J. Maas.When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world.At least, he&#8217;s not a beast all the time.As she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she&#8217;s been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin&#8212;and his world&#8212;forever.From bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read.",
        "rating": 4,
        "price": 18,
        "image": "//prodimage.images-bn.com/pimages/9781635575569_p0_v2_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "House of Sky and Breath (Crescent City Series #2)",
        "description": "\nThe #1 New York Times bestseller!Sarah J. Maas's sexy, groundbreaking CRESCENT CITY series continues with thesecond installment.Bryce Quinlan and Hunt Athalar are trying to get back to normal-they may have saved Crescent City, but with so much upheaval in their lives lately, they mostly want a chance to relax. Slow down. Figure out what the future holds. The Asteri have kept their word so far, leaving Bryce and Hunt alone. But with the rebels chipping away at the Asteri's power, the threat the rulers pose is growing. As Bryce, Hunt, and their friends get pulled into the rebels' plans, the choice becomes clear: stay silent while others are oppressed, or fight for what's right. And they've never been very good at staying silent. In this sexy, action-packed sequel to the #1 bestseller House of Earth and Blood, Sarah J. Maas weaves a captivating story of a world about to explode-and the people who will do anything to save it.",
        "rating": 3,
        "price": 19.6,
        "image": "//prodimage.images-bn.com/pimages/9781635574081_p0_v4_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Ballad of Never After (Signed B&N Exclusive Book)",
        "description": "\nThis Barnes & Noble Exclusive Edition is signed by Stephanie Garber, includes a bonus chapter from Jacks' POV, and has a unique cover and case stamp!The fiercely-anticipated sequel to the #1 New York Times bestseller Once Upon a Broken Heart, starring Evangeline Fox and the Prince of Hearts on a new journey of magic, mystery, and heartbreakNot every love is meant to be. After Jacks, the Prince of Hearts, betrays her, Evangeline Fox swears she'll never trust him again. Now that she&#8217;s discovered her own magic, Evangeline believes she can use it to restore the chance at happily ever after that Jacks stole away. But when a new terrifying curse is revealed, Evangeline finds herself entering into a tenuous partnership with the Prince of Hearts again. Only this time, the rules have changed. Jacks isn&#8217;t the only force Evangeline needs to be wary of. In fact, he might be the only one she can trust, despite her desire to despise him. Instead of a love spell wreaking havoc on Evangeline&#8217;s life, a murderous spell has been cast. To break it, Evangeline and Jacks will have to do battle with old friends, new foes, and a magic that plays with heads and hearts. Evangeline has always trusted her heart, but this time she&#8217;s not sure she can&#8230;",
        "rating": 5,
        "price": 19.99,
        "image": "//prodimage.images-bn.com/pimages/9781250874740_p0_v5_s600x595.jpg",
        "author": "Stephanie Garber",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781250874740_p1_v6_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "More Than a Threat Series Boxset: A Bodyguard Romantic Suspense Series",
        "description": "\nWhen the client becomes more than just the job, will the distraction be his undoing or her death sentence?Former Army Ranger Casey Weston had three rules he required all clients under his protection to follow: don't go anywhere alone, do as he says, and don't fall for him. Until Kate. She challenged his need for control the moment he stepped across the threshold of her Dallas townhome. One fateful night changed it all, when the cartel followed through on their threat and Casey took a life to save hers.Dr. Kate Wheeler didn't want or need the stacked, broody bodyguard her father hired. It was one death threat, not a big deal&#x2014;right? At first they hated each other, unable to find common ground. But the long days and nights and the ever-present threat changed her perception of the mysterious man, making it harder to fight the temptation with each heated glance and tender caress.If Casey makes Kate the exception to his one and only rule&#x2014;never fall for a client&#x2014;can he still protect her from the insistent threat, or will their growing attraction put more than his job on the line?The More Than a Threat boxset includes all three books in the completed series: More Than a Threat, More Than a Risk, and More Than a Hope.This series is suggested for mature readers due to crass language, many detailed intimate scenes, and violence.",
        "rating": 4,
        "price": 6.99,
        "image": "//prodimage.images-bn.com/pimages/2940186348399_p0_v1_s600x595.jpg",
        "author": "Kennedy L. Mitchell",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Way of Kings (Stormlight Archive Series #1)",
        "description": "\n<P>The trade paperback features a bonus full-page illustration unique to this edition!<P>Widely acclaimed for his work completing Robert Jordan&#8217;s Wheel of Time saga, Brandon Sanderson now begins a grand cycle of his own, one every bit as ambitious and immersive.<P>Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.<P>It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain&#58; mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.<P>One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.<P>Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.<P>Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar&#8217;s niece, Jasnah. Though she genuinely loves learning, Shallan&#8217;s motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.<P>The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.<P>Speak again the ancient oaths,<P>Life before death.Strength before weakness.Journey before Destination.<P>and return to men the Shards they once bore.<P>The Knights Radiant must stand again. \n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"Product_Tabs_loading_start\");\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10391,Starts-->\n<!-- Code Change For ATG-10391,Ends-->\n<!-- Code Change For ATG-10237,Ends-->\n\n\nRelated collections and offers\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\n#BookTok: The Most Popular Books on TikTok\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBookTok Challenge — Suspense\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBuy One, Get One 50% Off Books for All Ages\n\n\n\n\n\n\n\nProduct Details\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\nAbout the Author\nRead an Excerpt\nTable of Contents\n\n\n\n\n\n\n\nProduct Details\n\n\n<!-- changes start for ATG-9471 -->\n\nISBN-13:\n<!-- changes End for ATG-9471 -->\n9780765376671\n\n\nPublisher:\n\nTom Doherty Associates\n\n\n Publication date:\n03/04/2014\n\nSeries:\n\nStormlight Archive Series\n, #1\n\nEdition description:\nReprint\n\n Pages:\n1008\n\nSales rank:\n517\n\nProduct dimensions:\n 6.10(w) x 9.20(h) x 1.80(d)\n\n\n\n\n\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n\nAbout the Author\n\n<!-- ATG-10370 : Adding header after empty check for image-->\n\n\n\n\n\n\n<!-- ATG-10370 : Adding header after empty check for content and image-->\n\n\n<P>Brandon Sanderson grew up in Lincoln, Nebraska. He lives in Utah with his wife and children and teaches creative writing at Brigham Young University. He is in the process of completing Robert Jordan&#8217;s bestselling Wheel of Time&#174; series.&#160;\n<!-- ATG-10370 : Adding header after empty check for image, content and authorbiocommentary -->\n\n\n\n\n\n\n\n\nRead an Excerpt\n<P> <H4>The Way of Kings <H4>Book One of The Stormlight Archivehr noshade size=\"1\">By Brandon Sanderson <H4>Tom Doherty Associates font size=-1> Copyright &copy; 2010 Dragonsteel Entertainment, LLC All rights reserved. ISBN&#58; 978-1-4299-9280-0 hr noshade size='1'> CHAPTER 1<P><I>\"You've killed me. Bastards, you've killed me! While the sun is still hot, I die!\"<P>&#8212;Collected on the fifth day of the week Chach of the month Betab of the year 1171, ten seconds before death. Subject was a darkeyed soldier thirty-one years of age. Sample is considered questionable.<P>FIVE YEARS LATER<P>\"I'm going to die, aren't I?\" Cenn asked.<P>The weathered veteran beside Cenn turned and inspected him. The veteran wore a full beard, cut short. At the sides, the black hairs were starting to give way to grey.<P><I>I'm going to die, Cenn thought, clutching his spear&#8212;the shaft slick with sweat. <I>I'm going to die. Oh, Stormfather. I'm going to die....<P>\"How old are you, son?\" the veteran asked. Cenn didn't remember the man's name. It was hard to recall anything while watching that other army form lines across the rocky battlefield. That lining up seemed so civil. Neat, organized. Shortspears in the front ranks, longspears and javelins next, archers at the sides. The darkeyed spearmen wore equipment like Cenn's&#58; leather jerkin and knee-length skirt with a simple steel cap and a matching breastplate.<P>Many of the lighteyes had full suits of armor. They sat astride horses, their honor guards clustering around them with breastplates that gleamed burgundy and deep forest green. Were there Shardbearers among them? Brightlord Amaram wasn't a Shardbearer. Were any of his men? What if Cenn had to fight one? Ordinary men didn't kill Shardbearers. It had happened so infrequently that each occurrence was now legendary.<P><I>It's really happening, he thought with mounting terror. This wasn't a drill in the camp. This wasn't training out in the fields, swinging sticks. This was <I>real. Facing that fact&#8212;his heart pounding like a frightened animal in his chest, his legs unsteady&#8212;Cenn suddenly realized that he was a coward. He shouldn't have left the herds! He should never have&#8212;<P>\"Son?\" the veteran said, voice firm. \"How old are you?\"<P>\"Fifteen, sir.\"<P>\"And what's your name?\"<P>\"Cenn, sir.\"<P>The mountainous, bearded man nodded. \"I'm Dallet.\"<P>\"Dallet,\" Cenn repeated, still staring out at the other army. There were so many of them! Thousands. \"I'm going to die, aren't I?\"<P>\"<I>No.\" Dallet had a gruff voice, but somehow that was comforting. \"You're going to be just fine. Keep your head on straight.<P>Stay with the squad.\"<P>\"But I've barely had three months' training!\" He swore he could hear faint clangs from the enemy's armor or shields. \"I can barely hold this spear! Stormfather, I'm <I>dead. I can't&#8212;\"<P>\"Son,\" Dallet interrupted, soft but firm. He raised a hand and placed it on Cenn's shoulder. The rim of Dallet's large round shield reflected the light from where it hung on his back. \"You are <I>going to be <I>fine.\"<P>\"How can you know?\" It came out as a plea.<P>\"Because, lad. You're in Kaladin Stormblessed's squad.\" The other soldiers nearby nodded in agreement.<P>Behind them, waves and waves of soldiers were lining up&#8212;thousands of them. Cenn was right at the front, with Kaladin's squad of about thirty other men. Why had Cenn been moved to a new squad at the last moment? It had something to do with camp politics.<P>Why was this squad at the very front, where casualties were bound to be the greatest? Small fearspren&#8212;like globs of purplish goo&#8212;began to climb up out of the ground and gather around his feet. In a moment of sheer panic, he nearly dropped his spear and scrambled away. Dallet's hand tightened on his shoulder. Looking up into Dallet's confident black eyes, Cenn hesitated.<P>\"Did you piss before we formed ranks?\" Dallet asked.<P>\"I didn't have time to&#8212;\"<P>\"Go now.\"<P>\"<I>Here?\"<P>\"If you don't, you'll end up with it running down your leg in battle, distracting you, maybe killing you. Do it.\"<P>Embarrassed, Cenn handed Dallet his spear and relieved himself onto the stones. When he finished, he shot glances at those next to him.<P>None of Kaladin's soldiers smirked. They stood steady, spears to their sides, shields on their backs.<P>The enemy army was almost finished. The field between the two forces was bare, flat slickrock, remarkably even and smooth, broken only by occasional rockbuds. It would have made a good pasture. The warm wind blew in Cenn's face, thick with the watery scents of last night's highstorm.<P>\"Dallet!\" a voice said.<P>A man walked up through the ranks, carrying a shortspear that had two leather knife sheaths strapped to the haft. The newcomer was a young man&#8212;perhaps four years older than Cenn's fifteen&#8212;but he was taller by several fingers than even Dallet. He wore the common leathers of a spearman, but under them was a pair of dark trousers. That wasn't supposed to be allowed.<P>His black Alethi hair was shoulder-length and wavy, his eyes a dark brown. He also had knots of white cord on the shoulders of his jerkin, marking him as a squadleader.<P>The thirty men around Cenn snapped to attention, raising their spears in salute. <I>This is Kaladin Stormblessed? Cenn thought incredulously. <I>This youth?<P>\"Dallet, we're soon going to have a new recruit,\" Kaladin said. He had a strong voice. \"I need you to ...\" He trailed off as he noticed Cenn.<P>\"He found his way here just a few minutes ago, sir,\" Dallet said with a smile. \"I've been gettin' him ready.\"<P>\"Well done,\" Kaladin said. \"I paid good money to get that boy away from Gare. That man's so incompetent he might as well be fighting for the other side.\"<P><I>What? Cenn thought. <I>Why would anyone pay <I>to get me?<P>\"What do you think about the field?\" Kaladin asked. Several of the other spearmen nearby raised hands to shade from the sun, scanning the rocks.<P>\"That dip next to the two boulders on the far right?\" Dallet asked.<P>Kaladin shook his head. \"Footing's too rough.\"<P>\"Aye. Perhaps it is. What about the short hill over there? Far enough to avoid the first fall, close enough to not get too far ahead.\"<P>Kaladin nodded, though Cenn couldn't see what they were looking at. \"Looks good.\"<P>\"The rest of you louts hear that?\" Dallet shouted.<P>The men raised their spears high.<P>\"Keep an eye on the new boy, Dallet,\" Kaladin said. \"He won't know the signs.\"<P>\"Of course,\" Dallet said, smiling. Smiling! How could the man smile? The enemy army was blowing horns. Did that mean they were ready? Even though Cenn had just relieved himself, he felt a trickle of urine run down his leg.<P>\"Stay firm,\" Kaladin said, then trotted down the front line to talk to the next squadleader over. Behind Cenn and the others, the dozens of ranks were still growing. The archers on the sides prepared to fire.<P>\"Don't worry, son,\" Dallet said. \"We'll be fine. Squadleader Kaladin is lucky.\"<P>The soldier on the other side of Cenn nodded. He was a lanky, red-haired Veden, with darker tan skin than the Alethi. Why was he fighting in an Alethi army? \"That's right. Kaladin, he's stormblessed, right sure he is. We only lost ...what, one man last battle?\"<P>\"But someone <I>did die,\" Cenn said.<P>Dallet shrugged. \"People always die. Our squad loses the fewest.<P>You'll see.\"<P>Kaladin finished conferring with the other squadleader, then jogged back to his team. Though he carried a shortspear&#8212;meant to be wielded one-handed with a shield in the other hand&#8212;his was a hand longer than those held by the other men.<P>\"At the ready, men!\" Dallet called. Unlike the other squadleaders, Kaladin didn't fall into rank, but stood out in front of his squad.<P>The men around Cenn shuffled, excited. The sounds were repeated through the vast army, the stillness giving way before eagerness.<P>Hundreds of feet shuffling, shields slapping, clasps clanking. Kaladin remained motionless, staring down the other army. \"Steady, men,\" he said without turning.<P>Behind, a lighteyed officer passed on horseback. \"Be ready to fight! I want their blood, men. Fight and kill!\"<P>\"Steady,\" Kaladin said again, after the man passed.<P>\"Be ready to run,\" Dallet said to Cenn.<P>\"Run? But we've been trained to march in formation! To stay in our line!\"<P>\"Sure,\" Dallet said. \"But most of the men don't have much more training than you. Those who can fight well end up getting sent to the Shattered Plains to battle the Parshendi. Kaladin's trying to get us into shape to go there, to fight for the king.\" Dallet nodded down the line.<P>\"Most of these here will break and charge; the lighteyes aren't good enough commanders to keep them in formation. So stay with us and run.\"<P>\"Should I have my shield out?\" Around Kaladin's team, the other ranks were unhooking their shields. But Kaladin's squad left their shields on their backs.<P>Before Dallet could answer, a horn blew from behind.<P>\"Go!\" Dallet said.<P>Cenn didn't have much choice. The entire army started moving in a clamor of marching boots. As Dallet had predicted, the steady march didn't last long. Some men began yelling, the roar taken up by others. Lighteyes called for them to go, run, fight. The line disintegrated.<P>As soon as that happened, Kaladin's squad broke into a dash, running out into the front at full speed. Cenn scrambled to keep up, panicked and terrified. The ground wasn't as smooth as it had seemed, and he nearly tripped on a hidden rockbud, vines withdrawn into its shell.<P>He righted himself and kept going, holding his spear in one hand, his shield clapping against his back. The distant army was in motion as well, their soldiers charging down the field. There was no semblance of a battle formation or a careful line. This wasn't anything like the training had claimed it would be.<P>Cenn didn't even know who the enemy was. A landlord was encroaching on Brightlord Amaram's territory&#8212;the land owned, ultimately, by Highprince Sadeas. It was a border skirmish, and Cenn thought it was with another Alethi princedom. Why were they fighting each other? Perhaps the king would have put a stop to it, but he was on the Shattered Plains, seeking vengeance for the murder of King Gavilar five years before.<P>The enemy had a lot of archers. Cenn's panic climbed to a peak as the first wave of arrows flew into the air. He stumbled again, itching to take out his shield. But Dallet grabbed his arm and yanked him forward.<P>Hundreds of arrows split the sky, dimming the sun. They arced and fell, dropping like skyeels upon their prey. Amaram's soldiers raised shields. But not Kaladin's squad. No shields for them.<P>Cenn screamed.<P>And the arrows slammed into the middle ranks of Amaram's army, behind him. Cenn glanced over his shoulder, still running. The arrows fell <I>behind him. Soldiers screamed, arrows broke against shields; only a few straggling arrows landed anywhere near the front ranks.<P>\"Why?\" he yelled at Dallet. \"How did you know?\"<P>\"They want the arrows to hit where the men are most crowded,\" the large man replied. \"Where they'll have the greatest chance of finding a body.\"<P>Several other groups in the van left their shields lowered, but most ran awkwardly with their shields angled up to the sky, worried about arrows that wouldn't hit them. That slowed them, and they risked getting trampled by the men behind who <I>were getting hit. Cenn itched to raise his shield anyway; it felt so wrong to run without it.<P>The second volley hit, and men screamed in pain. Kaladin's squad barreled toward the enemy soldiers, some of whom were dying to arrows from Amaram's archers. Cenn could hear the enemy soldiers bellowing war cries, could make out individual faces. Suddenly, Kaladin's squad pulled to a halt, forming a tight group. They'd reached the small incline that Kaladin and Dallet had chosen earlier.<P>Dallet grabbed Cenn and shoved him to the very center of the formation. Kaladin's men lowered spears, pulling out shields as the enemy bore down on them. The charging foe used no careful formation; they didn't keep the ranks of longspears in back and shortspears in front. They all just ran forward, yelling in a frenzy.<P>Cenn scrambled to get his shield unlatched from his back. Clashing spears rang in the air as squads engaged one another. A group of enemy spearmen rushed up to Kaladin's squad, perhaps coveting the higher ground. The three dozen attackers had some cohesion, though they weren't in as tight a formation as Kaladin's squad was.<P>The enemy seemed determined to make up for it in passion; they bellowed and screamed in fury, rushing Kaladin's line. Kaladin's team held rank, defending Cenn as if he were some lighteyes and they were his honor guard. The two forces met with a crash of metal on wood, shields slamming together. Cenn cringed back.<P>It was over in a few eyeblinks. The enemy squad pulled back, leaving two dead on the stone. Kaladin's team hadn't lost anyone. They held their bristling V formation, though one man stepped back and pulled out a bandage to wrap a thigh wound. The rest of the men closed in to fill the spot. The wounded man was hulking and thick-armed; he cursed, but the wound didn't look bad. He was on his feet in a moment, but didn't return to the place where he'd been. Instead, he moved down to one end of the V formation, a more protected spot.<P>The battlefield was chaos. The two armies mingled indistinguishably; sounds of clanging, crunching, and screaming churned in the air. Many of the squads broke apart, members rushing from one encounter to another. They moved like hunters, groups of three or four seeking lone individuals, then brutally falling on them.<P>Kaladin's team held its ground, engaging only enemy squads that got too close. Was this what a battle really was? Cenn's practice had trained him for long ranks of men, shoulder to shoulder. Not this frenzied intermixing, this brutal pandemonium. Why didn't more hold formation?<P><I>The real soldiers are all gone, Cenn thought. <I>Off fighting in a real battle at the Shattered Plains. No wonder Kaladin wants to get his squad there.<P>Spears flashed on all sides; it was difficult to tell friend from foe, despite the emblems on breastplates and colored paint on shields. The battlefield broke down into hundreds of small groups, like a thousand different wars happening at the same time.<P>After the first few exchanges, Dallet took Cenn by the shoulder and placed him in the rank at the very bottom of the V pattern. Cenn, however, was worthless. When Kaladin's team engaged enemy squads, all of his training fled him. It took everything he had to just remain there, holding his spear outward and trying to look threatening.<P>For the better part of an hour, Kaladin's squad held their small hill, working as a team, shoulder to shoulder. Kaladin often left his position at the front, rushing this way and that, banging his spear on his shield in a strange rhythm.<P><I>Those are signals, Cenn realized as Kaladin's squad moved from the V shape into a ring. With the screams of the dying and the thousands of men calling to others, it was nearly impossible to hear a single person's voice. But the sharp clang of the spear against the metal plate on Kaladin's shield was clear. Each time they changed formations, Dallet grabbed Cenn by the shoulder and steered him.<P>Kaladin's team didn't chase down stragglers. They remained on the defensive. And, while several of the men in Kaladin's team took wounds, none of them fell. Their squad was too intimidating for the smaller groups, and larger enemy units retreated after a few exchanges, seeking easier foes.<P>Eventually something changed. Kaladin turned, watching the tides of the battle with discerning brown eyes. He raised his spear and smacked his shield in a quick rhythm he hadn't used before. Dallet grabbed Cenn by the arm and pulled him away from the small hill. Why abandon it now?<P>Just then, the larger body of Amaram's force broke, the men scattering. Cenn hadn't realized how poorly the battle in this quarter had been going for his side. As Kaladin's team retreated, they passed many wounded and dying, and Cenn grew nauseated. Soldiers were sliced open, their insides spilling out.<P>He didn't have time for horror; the retreat quickly turned into a rout. Dallet cursed, and Kaladin beat his shield again. The squad changed direction, heading eastward. There, Cenn saw, a larger group of Amaram's soldiers was holding.<P>But the enemy had seen the ranks break, and that made them bold. They rushed forward in clusters, like wild axehounds hunting stray hogs. Before Kaladin's team was halfway across the field of dead and dying, a large group of enemy soldiers intercepted them. Kaladin reluctantly banged his shield; his squad slowed.<P>Cenn felt his heart begin to thump faster and faster. Nearby, a squad of Amaram's soldiers was consumed; men stumbled and fell, screaming, trying to get away. The enemies used their spears like skewers, killing men on the ground like cremlings.<P>Kaladin's men met the enemy in a crash of spears and shields. Bodies shoved on all sides, and Cenn was spun about. In the jumble of friend and foe, dying and killing, Cenn grew overwhelmed. So many men running in so many directions!<P>He panicked, scrambling for safety. A group of soldiers nearby wore Alethi uniforms. Kaladin's squad. Cenn ran for them, but when some turned toward him, Cenn was terrified to realize he didn't recognize them. This <I>wasn't Kaladin's squad, but a small group of unfamiliar soldiers holding an uneven, broken line. Wounded and terrified, they scattered as soon as an enemy squad got close. (Continues...) hr noshade size='1'>Excerpted from The Way of Kings by Brandon Sanderson. Copyright &copy; 2010 Dragonsteel Entertainment, LLC. Excerpted by permission of Tom Doherty Associates. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher.Excerpts are provided by Dial-A-Book Inc. solely for the personal use of visitors to this web site.hr noshade size='1'>\n\n\n\nShow More\n\n\n\n\n\n\n\n\n\nTable of Contents<H4>Contents Prelude to the Stormlight Archive, <BR />Book One&#58; The Way of Kings, <BR />Prologue&#58; To Kill, <BR />Part One&#58; Above Silence, <BR />Part Two&#58; The Illuminating Storms, <BR />Part Three&#58; Dying, <BR />Interludes, <BR />Part Five&#58; The Silence Above, <BR />Epilogue&#58; Of Most Worth, <BR />Endnote, <BR />Ars Arcanum, <BR />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Product_Tabs_loading_end\");\nperformance.measure(\n\"productTabsDur\",\n\"Product_Tabs_loading_start\",\n\"Product_Tabs_loading_end\"\n);\n}\n\n\n\n\n\nEditorial Reviews\n\nThe Way of Kings didn't just raise the curtain on Brandon Sanderson's Stormlight Machine epic; it entangled our interest in the personalities of three disparate main characters who would dominate its drama. They could scarcely be more different&#58; One, the vision-plagued brother of an assassinated king; another, a highborn young man brought low; and the third, a brilliant, yet na&iuml;ve young woman intent on fulfilling a seemingly impossible mission. A series from the author chosen to complete Robert Joran's The Wheel of Time series; now in trade paperback and NOOK Book.\n\n\n\n\nFor The Way of Kings<P>&#8220;I loved this book. What else is there to say&#63;&#8221;&#8212;Patrick Rothfuss, bestselling author of The Name of the Wind<P>&#8220;This is a great choice for fans of Robert Jordan and Terry Brooks.&#8221; &#8212;Voice of Youth Advocates<P>&#8220;The best part&#8230;is the compelling, complex story of Dalinar, Kaladin, and Shallan as they struggle though emotional, physical, and moral challenges. Fans and lovers of epic fantasy&#8230;will eagerly await the next volume.&#8221; &#8212;Library Journal<P>&#8220;Epic in every sense. Sanderson has built a world that leaps to life, a cast of varied characters and a vast history which slowly unfolds with the deepening story of Roshar.&#8221;&#8212;Guardian (UK)<P>&#8220;[Sanderson] will be spoken in the same breath as Tolkien, Leiber, Moorcock, Jordan&#8230;and George R. R. Martin.&#8221; &#8212;SFFworld.com<P>&#8220;Featuring ingenious magic . . . feisty characters, and a complex plot likely to unwind over several volumes, this high-spirited, exciting story will appeal to readers of all ages.&#8221;&#8212;Publishers Weekly, starred review, on The Rithmatist&#8220;Sanderson's outstanding fantasy debut, refreshingly complete unto itself and free of the usual genre clich&#233;s, offers something for everyone. . . . The intrigue and excitement grow steadily in this smoothly written, perfectly balanced narrative; by the end readers won't want to put it down.&#8221;&#8212;Publishers Weekly, starred review, on Elantris \nFrom the Publisher\n\n\nThis massive tome is the first of a 10-part epic fantasy series from relative newcomer Sanderson (Mistborn), best known for his efforts to complete the late Robert Jordan's Wheel of Time series. In a storm-swept world where history has dwindled into myth, self-serving aristocrats squabble over mystical weapons that render their bearers immune to mundane attacks. The ambitious scholar Shallan learns unexpected truths about the present, the virtuous aristocrat Dalinar reclaims the lost past, and the bitter and broken slave Kaladin gains unwanted power. Race-related plot themes may raise some eyebrows, and there's no hope for anything resembling a conclusion in this introductory volume, but Sanderson's fondness for misleading the reader and his talent for feeding out revelations and action scenes at just the right pace will keep epic fantasy fans intrigued and hoping for redemptive future installments. (Sept.)\nPublishers Weekly\n\n\nCenturies have passed since the Radiant Knights protected the world of Roshar from the evil of the Desolation. Their heroic deeds have long been overshadowed by stories of their betrayal, which in turn have faded into myth. The nation of Alethkar has been mired in a war to avenge the assassination of its king. The system of power used by the Radiant Knights is largely misunderstood and untapped, and yet an ancient evil stirs. Sanderson, the author of Elantris and the \"Mistborn Trilogy,\" once again creates an interesting world with a novel system of magic, but the best part of this series launch is the compelling, complex story of Dalinar, Kaladin, and Shallan as they struggle through emotional, physical, and moral challenges.Verdict Sanderson is a master of hooking the reader in the first few pages, and once again he doesn't disappoint. Fans and lovers of epoch fantasy will find the ending satisfying, yet will eagerly await the next volume. [Sanderson was the novelist chosen to complete A Memory of Light, the final volume of Robert Jordon's \"The Wheel of Time\" series.&mdash;Ed.]&mdash;William Baer, Georgia Inst. of Technology, Atlanta\nLibrary Journal\n\n\n&#9733; 2017-11-14A sweeping fantasy story set in an original and richly detailed world.Kaladin used to be a soldier. Now he's a slave, and after 10 escape attempts, he's decided he's resigned to his fate. But he can't get away from a strangely intelligent windspren&mdash;a creature that should be an ephemeral, mindless sprite&mdash;who's been following him for months and is starting to ask tough questions about why he's given up fighting for what's right. Shallan has left her sheltered home life to pursue a desperate plan to rescue her family from financial ruin. First, she must persuade the brilliant scholar-princess Jasnah to take her on as a student. From there her task only becomes more difficult. The fates of Kaladin and Shallan and thousands of others hinge on the progress of the war for the Shattered Plains, a war that the great warrior Dalinar Kholin is beginning to doubt is right, thanks to the mysterious visions that visit him whenever a highstorm comes. This tale takes place in an unusual and intricately imagined world populated by enormous crustaceans and multiple colorful civilizations and scoured by the immensely powerful highstorms. The attention to worldbuilding makes this a fantasy fan's dream, but Sanderson (The Well of Ascension, 2017, etc.) doesn't neglect his characters, giving each of them a fully realized emotional life and high personal stakes to fight for.The vast scope of this book and the main characters' compelling journeys make it an epic worthy of the name&mdash;and a real treat for fantasy fans.<BR>\nKirkus Reviews\n\n\nRead More\n\n\n\n\n\n<!-- Gigya Changes -->\n<!-- Gigya Changes -->\n\nCustomer Reviews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<!-- Internal Component Tracking - Begin -->\n<!-- Internal Component Tracking - End -->\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"BloomReach_Widget_loading_starts\");\n\n\n<!-- Related Searches -->\n\n\n\n\nsection data-modifyslick class=\"book bloomReachRelatedSearch\">\n\nRelated Searches\n\n\n\n\n\n\n\nLightbringer Series\n\n\n\n\n\n\n\nBrandon Sanderson\n\n\n\n\n\n\n\nThe Blade Itself (First Law Trilogy #1)\n\n\n\n\n\n\n\nDragonlance - Dragons of Autumn Twili&#8230;\n\n\n\n\n\n\n\nLast Argument of Kings (First Law Tri&#8230;\n\n\n\n\n\n\n\nDragonlance - Dragons of Winter Night&#8230;\n\n\n\n\n\n\n\n\n\n<!-- Explore More Items -->\n\n\n\n\nsection data-modifyslick class=\"mb-5 book bloomReachExploreItems\">\n\nExplore More Items\n\n\n\n\n\n\n\n\nThe Blinding Knife (Lightbringer Series #2)\n\n<P>From the New York Times Bestselling author of The Black Prism... <P>Gavin Guile is dying. <P>He'd thought he had five years left&#151;now he has less than one. With fifty thousand refugees, a bastard son,\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Blood Mirror (Lightbringer Series #4)\n\nThe fourth book in the Lightbringer series from New York Times bestseller Brent Weeks. When does an empire fall?The Seven Satrapies have collapsed into four-and those are falling before the White\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Broken Eye (Lightbringer Series #3)\n\nNew York Times bestsellerThe Broken Eye continues the spectacular Lightbringer series from the New York Times bestselling author of The Black Prism and The Blinding Knife. As the old gods awaken and\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Burning White (Lightbringer Series #5)\n\n<B>In this stunning conclusion to the epic <I>New York Times bestselling Lightbringer series, kingdoms clash as Kip struggles to escape his family's shadow in order to protect the land and people he\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Alloy of Law (Mistborn Series #4)\n\nFrom #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Three hundred years after the events of the\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Shattered Lens (Alcatraz Versus the Evil Librarians Series #4)\n\nNow in paperback for the first time, featuring all new covers, the Alcatraz Versus the Evil Librarians middle-grade series from #1 New York Times bestselling author Brandon Sanderson.Alcatraz Smedry\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Hero of Ages (Mistborn Series #3)\n\nFrom #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Who is the Hero of Ages?To end the Final\n\nSee Details\n\n\n\n\n\n\n\n\n\nAlcatraz contra los bibliotecarios / Alcatraz vs. the Evil Librarians\n\n<P>Alcatraz contra los Bibliotecarios Malvados es la primera novela de la exitosa y divertid&#237;sima saga hom&#243;nima de Brandon Sanderson, una serie de aventuras fant&#225;sticas juvenil y apta\n\nSee Details\n\n\n\n\n\n\n\n\n\nCitónica / Cytonic\n\n\n\nSee Details\n\n\n\n\n\n\n\n\n\nElantris (Spanish Edition)\n\n<P>Una novela imprescindible para los amantes de la fantas&iacute;a &eacute;pica. Por el consagrado autor del g&eacute;nero Brandon Sanderson. Edici&oacute;n d&eacute;cimo aniversario&#58;\n\nSee Details\n\n\n\n\n\n\n\n\n\nFirefight (The Reckoners Series #2)\n\nThe #1 New York Times bestseller and sequel to Steelheart from Brandon Sanderson, the author of Oathbringer, coauthor of Robert Jordan&rsquo;s The Wheel of Time series, and creator of the\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Rithmatist\n\nThe Rithmatist, Brandon Sanderson's New York Times bestselling epic teen adventure is now available in paperback. More than anything, Joel wants to be a Rithmatist. Rithmatists have the power to\n\nSee Details\n\n\n\n\n\n\n\n\n\nElantris\n\nThe exciting debut novel of bestselling epic fantasy author Brandon Sanderson, Elantris!Elantris was the capital of Arelon&#58; gigantic, beautiful, literally radiant, filled with benevolent beings\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Way of Kings (Stormlight Archive Series #1)\n\nFrom #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive begins an incredible new saga of epic proportion.Roshar is a world of stone and\n\nSee Details\n\n\n\n\n\n\n\n\n\nShadows of Self (Mistborn Series #5)\n\nFrom #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action.Three hundred years after the events of the\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_starts\");\n}\n\n\n<!-- ATG-26331 remove google analytics-->\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_ends\");\nperformance.measure(\n\"globalFooterDur\",\n\"Global_Footer_loading_starts\",\n\"Global_Footer_loading_ends\"\n);\n}\n\n<!-- ATG-26338 : Add modal for PDP, PLP -->\n<!-- ATG-26338 : Ends -->\nvar isresponsive= true;\n<!-- All Javascripts in js-scripts-ra.jsp has to be minified. ALl JS has to be moved to release dir as per grunt minification -->\n\n$.webshims.setOptions('basePath','//js.js-bn.com/static/redesign/srcs/js/vendor/js-webshim-1.15/minified/shims/');\n$.webshims.polyfill('es5 forms forms-ext');\n\n\nscript defer async type=\"text/javascript\" src=\"https://request.eprotect.vantivcnp.com/eProtect/eProtect-api3.js\">\n\n\nif(!$.isEmptyObject(digitalData)){\nvar digitalData1 = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Epic Fantasy\",\"Sword & Savagery\"],\"productType\":\"book\"},\"price\":{\"basePrice\":18.99},\"productInfo\":{\"departmentCode\":\"1\",\"sku\":\"9780765376671\",\"productName\":\"The Way of Kings (Stormlight Archive Series #1)\",\"productID\":\"prd9780765376671\",\"productURL\":\"/w/way-of-kings-brandon-sanderson/1100354496?ean=9780765376671\"},\"attributes\":{\"outOfStock\":false,\"reviews\":1360,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":4.7,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"25950D022E94CCCF1027D8DCA6C6F124\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Sat Aug 06 10:39:11 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:the-way-of-kings-stormlight-archive-series-1|1100354496\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"102.43.134.29\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59101892933\"}}]}]};\n$.extend(digitalData,digitalData1);\n}else{\n\nvar digitalData = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Epic Fantasy\",\"Sword & Savagery\"],\"productType\":\"book\"},\"price\":{\"basePrice\":18.99},\"productInfo\":{\"departmentCode\":\"1\",\"sku\":\"9780765376671\",\"productName\":\"The Way of Kings (Stormlight Archive Series #1)\",\"productID\":\"prd9780765376671\",\"productURL\":\"/w/way-of-kings-brandon-sanderson/1100354496?ean=9780765376671\"},\"attributes\":{\"outOfStock\":false,\"reviews\":1360,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":4.7,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"25950D022E94CCCF1027D8DCA6C6F124\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Sat Aug 06 10:39:11 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:the-way-of-kings-stormlight-archive-series-1|1100354496\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"102.43.134.29\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59101892933\"}}]}]};\n\n}\nif (typeof s_setP !== 'undefined') {\ns_setP('digitalData.component[0].componentInfo.componentName','you may also like');\ns_setP('digitalData.component[0].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[0].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[1].componentInfo.componentName','more in this series');\ns_setP('digitalData.component[1].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[1].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[2].componentInfo.componentName','recently-viewed');\ns_setP('digitalData.component[2].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[2].componentInfo.primaryCategory','internal campaign');\n\n}\n$(document).ready(function(){\nif (typeof s_setP !== 'undefined') {\n\nBN.Analytics.PDP.init();\n\nBN.Analytics.Generic.GoogleAds();\n\n}\n});\n\n\n\n\n\nvar cname = \"internalCampaign\",\ncvalue = null;\nvar curCookie = cname + \"=\" + cvalue +\n\"; expires= Thu, 01 Jan 1970 00:00:01 GMT;\" +\n\"; path=\" + \"/\" +\n\"; domain=\" + SITE_DOMAIN;\ndocument.cookie = curCookie;\n\n\n\n\n\n\n\n\n\nvar bopisEligibiltyMessage = $('#bopisEligibleMessage').val();\nvar storeName = $('#storeName').val();\nvar storeID = $('#storeID').val();\nif(typeof s_setP !== 'undefined') {\nif(s_getP('digitalData.user[0].profile[0].profileInfo.storeName') == undefined){\ns_setP('digitalData.user[0].profile[0].profileInfo.storeName', storeName);\ns_setP('digitalData.user[0].profile[0].profileInfo.storeID', storeID);\n}\nif(bopisEligibiltyMessage == 'productAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available:geo or store selected');\n}\nelse if((bopisEligibiltyMessage == 'productNotAvailable') || (bopisEligibiltyMessage == 'notEligibleForBopis')){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup unavailable:geo or store selected');\n}\nelse if(bopisEligibiltyMessage == 'storeNotAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available: geo or store unselected');\n}\n}\n\n\n/*Check id google ad needs to be loaded after page load*/\n\nvar asyncRelatedAdsEnabled = true;\nvar endemicAd = true;\n$(document).on('googleRelatedAdsLoaded', function() {\n\n})\n\n\n\n\n\n\n\n\n_satellite.pageBottom();\n\ndocument.write(\"<\\/script>\");\n/*CommerceHeaderFooter is the name of the library that we defined in webpack.config.js */\nCommerceHeaderFooter.showFooter('footer', {env:'prod', consumer_host:'https://www.barnesandnoble.com', styling:'responsive'});\n\n\n\n\n\n",
        "rating": 1,
        "price": 23.99,
        "image": "//prodimage.images-bn.com/pimages/9780765376671_p0_v5_s600x595.jpg",
        "author": "Brandon Sanderson",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9780765376671_p1_v3_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "Mexican Gothic",
        "description": "\nNEW YORK TIMES BESTSELLER &bull;&#160;&ldquo;It&rsquo;s Lovecraft meets the Bront&euml;s in Latin America, and after a slow-burn start Mexican Gothic gets seriously weird.&rdquo;&mdash;The Guardian&#160;IN DEVELOPMENT AS A HULU ORIGINAL LIMITED SERIES PRODUCED BY KELLY RIPA AND MARK CONSUELOS &bull; WINNER OF THE LOCUS AWARD &bull; NOMINATED FOR THE BRAM STOKER AWARD ONE OF THE BEST BOOKS OF THE YEAR&#58; The New Yorker, Vanity Fair, NPR, The Washington Post, Tordotcom, Marie Claire, Vox, Mashable, Men&rsquo;s Health, Library Journal, Book Riot, LibraryReads&#160;An isolated mansion. A chillingly charismatic aristocrat. And a brave socialite drawn to expose their treacherous secrets. . . . From the author of Gods of Jade and Shadow comes &ldquo;a terrifying twist on classic gothic horror&rdquo; (Kirkus Reviews) set in glamorous 1950s Mexico.After receiving a frantic letter from her newly-wed cousin begging for someone to save her from a mysterious doom, Noem&iacute; Taboada heads to High Place, a distant house in the Mexican countryside. She&rsquo;s not sure what she will find&mdash;her cousin&rsquo;s husband, a handsome Englishman, is a stranger, and Noem&iacute; knows little about the region.&#160;&#160;&#160;&#160;Noem&iacute; is also an unlikely rescuer&#58; She&rsquo;s a glamorous debutante, and her chic gowns and perfect red lipstick are more suited for cocktail parties than amateur sleuthing. But she&rsquo;s also tough and smart, with an indomitable will, and she is not afraid&#58; Not of her cousin&rsquo;s new husband, who is both menacing and alluring; not of his father, the ancient patriarch who seems to be fascinated by Noem&iacute;; and not even of the house itself, which begins to invade Noemi&rsquo;s dreams with visions of blood and doom.&#160;Her only ally in this inhospitable abode is the family&rsquo;s youngest son. Shy and gentle, he seems to want to help Noem&iacute;, but might also be hiding dark knowledge of his family&rsquo;s past. For there are many secrets behind the walls of High Place. The family&rsquo;s once colossal wealth and faded mining empire kept them from prying eyes, but as Noem&iacute; digs deeper she unearths stories of violence and madness.&#160;&#160;And Noem&iacute;, mesmerized by the terrifying yet seductive world of High Place, may soon find it impossible to ever leave this enigmatic house behind.&ldquo;It&rsquo;s as if a supernatural power compels us to turn the pages of the gripping Mexican Gothic.&rdquo;&mdash;The Washington Post&ldquo;Mexican Gothic&#160;is the perfect summer horror read, and marks Moreno-Garcia with her hypnotic and engaging prose as one of the genre&rsquo;s most exciting talents.&rdquo;&mdash;Nerdist&ldquo;A period thriller as rich in suspense as it is in lush &rsquo;50s atmosphere.&rdquo;&mdash;Entertainment Weekly",
        "rating": 3,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9780525620808_p0_v1_s600x595.jpg",
        "author": "Silvia Moreno-Garcia",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "Funny You Should Ask: A Novel",
        "description": "\nNATIONAL BESTSELLER &bull; A restless young journalist with big dreams interviews a Hollywood heartthrob&mdash;and reunites with him ten years later to discover exactly how he feels about her in this sexy and engrossing novel &ldquo;You will absolutely devour this book. It&rsquo;s filled with delightful banter, hot romance, and a love story that&rsquo;s worthy of the big screen.&rdquo;&mdash;Kate Spencer, author of In a New York Minute and host of Forever35Then. Twenty-something writer Chani Horowitz is stuck. While her former MFA classmates are nabbing high-profile book deals, all she does is churn out puff pieces. Then she&rsquo;s hired to write a profile of movie star Gabe Parker&#58; her number one celebrity crush and the latest James Bond. All Chani wants to do is keep her cool and nail the piece. But what comes next proves to be life changing in ways she never saw coming, as the interview turns into a whirlwind weekend that has the tabloids buzzing&mdash;and Chani getting closer to Gabe than she had planned.&#160;&#160; Now. Ten years later, after a brutal divorce and a healthy dose of therapy, Chani is back in Los Angeles as a successful writer with the career of her dreams. Except that no matter what new essay collection or online editorial she&rsquo;s promoting, someone always asks about The Profile. It always comes back to Gabe. So when his PR team requests that they reunite for a second interview, she wants to say no. She wants to pretend that she&rsquo;s forgotten about the time they spent together. But the truth is that Chani wants to know if those seventy-two hours were as memorable to Gabe as they were to her. And so . . . she says yes. Alternating between their first meeting and their reunion a decade later, this deliciously irresistible novel will have you hanging on until the last word.",
        "rating": 3,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9780593357323_p0_v3_s600x595.jpg",
        "author": "Elissa Sussman",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Priory of the Orange Tree",
        "description": "\nGet ready for Samantha Shannon's new novel, A Day of Fallen Night, coming in January 2023!The New York Times bestselling \"epic feminist fantasy perfect for fans of Game of Thrones\" (Bustle).NAMED A BEST BOOK OF THE YEAR BY:AMAZON (Top 100 Editors Picks and Science Fiction and Fantasy) * CHICAGO PUBLIC LIBRARY * BOOKPAGE * AUTOSTRADDLEA world divided.A queendom without an heir.An ancient enemy awakens.The House of Berethnet has ruled Inys for a thousand years. Still unwed, Queen Sabran the Ninth must conceive a daughter to protect her realm from destruction--but assassins are getting closer to her door. Ead Duryan is an outsider at court. Though she has risen to the position of lady-in-waiting, she is loyal to a hidden society of mages. Ead keeps a watchful eye on Sabran, secretly protecting her with forbidden magic.Across the dark sea, Tan&#233; has trained all her life to be a dragonrider, but is forced to make a choice that could see her life unravel.Meanwhile, the divided East and West refuse to parley, and forces of chaos are rising from their sleep.",
        "rating": 2,
        "price": 16,
        "image": "//prodimage.images-bn.com/pimages/9781635570281_p0_v5_s600x595.jpg",
        "author": "Samantha Shannon",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "My Killer Vacation",
        "description": "\nAn all-new, spicy murder mystery from Tessa Bailey, New York Times bestselling author of It Happened One Summer...It was supposed to be a relaxing vacation in sweet, sunny Cape Cod-just me and my beloved brother-but discovering a corpse in our rental house really throws a wrench into our tanning schedule. Now a rude, crude bounty hunter has arrived on the back of his motorcycle to catch the killer and refuses to believe I can be helpful, despite countless hours of true crime podcast listening. Not to mention a fulfilling teaching career of wrangling second graders. A brash bounty hunter and an energetic elementary schoolteacher&#58; the murder-solving team no one asked for, but thanks to these pesky attempts on my life, we're stuck together, come hell or high tide. I'm just here to do a job, not babysit an amateur sleuth. Although...it is becoming less and less of a hardship to have her around. Sure, she's stubborn, distracting and can't stay out of harm's way. She's also brave and beautiful and reminds me of the home I left behind three years ago. In other words, the insatiable hunger and protectiveness she is waking up in me is a threat to my peace of mind. Before I sink any deeper into this dangerous attraction, I need to solve this murder and get back on the road.But will fate take her from me before I realize the road has been leading to her all along? ",
        "rating": 2,
        "price": 13.99,
        "image": "//prodimage.images-bn.com/pimages/9781087928531_p0_v2_s600x595.jpg",
        "author": "Tessa Bailey",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Second Mrs. Astor: A Heartbreaking Historical Novel of the Titanic",
        "description": "\n<B>\"Ab&eacute;&#160;is an exquisite storyteller. Rich in detail and deeply moving.\"<B> &mdash;<B>Fiona Davis, <I>New York Times bestselling author of <I>The Magnolia Palace<BR><BR><B>\"One of the most beautifully written books I&rsquo;ve ever had the pleasure to read. A gorgeous, phenomenal novel I won&rsquo;t soon forget.&rdquo;<B> &mdash;Ellen Marie Wiseman <I>New York Times bestselling Author of <I>The Orphan Collector<BR><BR><B>Perfect for fans of Jennifer Chiaverini and Marie Benedict, this riveting novel takes you inside the scandalous courtship and catastrophic honeymoon aboard the <I>Titanic of the most famous couple of their time&mdash;John Jacob Astor and Madeleine Force. Told in rich detail, this novel of sweeping historical fiction will stay with readers long after turning the last page.<BR><BR> Madeleine Talmage Force is just seventeen when she attracts the attention of John Jacob &ldquo;Jack&rdquo; Astor. Madeleine is beautiful, intelligent, and solidly upper-class, but the Astors are in a league apart. Jack&rsquo;s mother was <I>the Mrs. Astor, American royalty and New York&rsquo;s most formidable socialite. Jack is dashing and industrious&mdash;a hero of the Spanish-American war, an inventor, and a canny businessman. Despite their twenty-nine-year age difference, and the scandal of Jack&rsquo;s recent divorce, Madeleine falls headlong into love&mdash;and becomes the press&rsquo;s favorite target.<BR><BR> On their extended honeymoon in Egypt, the newlyweds finally find a measure of peace from photographers and journalists. Madeleine feels truly alive for the first time&mdash;and is happily pregnant. The couple plans to return home in the spring of 1912, aboard an opulent new ocean liner. When the ship hits an iceberg close to midnight on April 14th, there is no immediate panic. The swift, state-of-the-art <I>RMS Titanic seems unsinkable. As Jack helps Madeleine into a lifeboat, he assures her that he&rsquo;ll see her soon in New York&hellip;<BR><BR> Four months later, at the Astors&rsquo; Fifth Avenue mansion, a widowed Madeleine gives birth to their son. In the wake of the disaster, the press has elevated her to the status of virtuous, tragic heroine. But Madeleine&rsquo;s most important decision still lies ahead: whether to accept the role assigned to her, or carve out her own remarkable path&hellip;<BR> &#160;<BR><B>&ldquo;A&#160;touching, compelling,&#160;and haunting love story that will delight fans of historical fiction&#160;and&#160;enthrall those of us for whom the <I>Titanic will always fascinate.&rdquo;<BR> &mdash;<B>Hazel<B> Gaynor, <I>New York Times bestselling author of <I>When We Were Young and Brave<BR> &#160;<BR><B>&ldquo;An engaging novel told with both heartbreaking care and vivid detail. <I>The Second Mrs. Astor is historical fiction at its gripping and irresistible best.&rdquo;<BR><B>&mdash;Patti Callahan , New York Times bestselling author of Surviving Savannah and Becoming Mrs. Lewis",
        "rating": 3,
        "price": 14.43,
        "image": "//prodimage.images-bn.com/pimages/9781496732057_p0_v2_s600x595.jpg",
        "author": "Shana Abé",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Only Woman in the Room",
        "description": "\nTHE NEW YORK TIMES BESTSELLERTHE USA TODAY BESTSELLERBestselling author Marie Benedict reveals the story of a brilliant woman scientist only remembered for her beauty.Her beauty almost certainly saved her from the rising Nazi party and led to marriage with an Austrian arms dealer. Underestimated in everything else, she overheard the Third Reich's plans while at her husband's side and understood more than anyone would guess. She devised a plan to flee in disguise from their castle, and the whirlwind escape landed her in Hollywood. She became Hedy Lamarr, screen star.But she kept a secret more shocking than her heritage or her marriage: she was a scientist. And she had an idea that might help the country fight the Nazis and revolutionize modern communication...if anyone would listen to her.A powerful book based on the incredible true story of the glamour icon and scientist, The Only Woman in the Room is a masterpiece that celebrates the many women in science that history has overlooked.Other Bestselling Historical Fiction from Marie Benedict:The Mystery of Mrs. ChristieLady ClementineCarnegie's MaidThe Other Einstein",
        "rating": 5,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781492666875_p0_v5_s600x595.jpg",
        "author": "Marie Benedict",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "22 Seconds",
        "description": "<B>22 seconds... until Lindsay Boxer loses her badge-or her life.<BR /><BR />SFPD Sergeant Lindsay Boxer has guns on her mind.<BR /> <BR />There's buzz of a last-ditch shipment of drugs and weapons crossing the Mexican border ahead of new restrictive gun laws. Before Lindsay can act, her top informant tips her to a case that hits disturbingly close to home.<BR /> <BR />Former cops. Professional hits. All with the same warning scrawled on their bodies:<BR /> <BR /><I>You talk, you die.<BR /> <BR />Now it's Lindsay's turn to choose.<BR />",
        "rating": 3,
        "price": 26.98,
        "image": "//prodimage.images-bn.com/pimages/2940176293746_p0_v3_s600x595.jpg",
        "author": "James Patterson",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb8"
    },
    {
        "name": "Neon Gods (Dark Olympus #1)",
        "description": "\nHe was supposed to be a myth. But from the moment I crossed the River Styx and fell under his dark spell...he was, quite simply, mine.*A scorchingly hot modern retelling of Hades and Persephone that's as sinful as it is sweet.*Society darling Persephone Dimitriou plans to flee the ultra-modern city of Olympus and start over far from the backstabbing politics of the Thirteen Houses. But all that's ripped away when her mother ambushes her with an engagement to Zeus, the dangerous power behind their glittering city's dark facade.With no options left, Persephone flees to the forbidden undercity and makes a devil's bargain with a man she once believed a myth...a man who awakens her to a world she never knew existed.Hades has spent his life in the shadows, and he has no intention of stepping into the light. But when he finds that Persephone can offer a little slice of the revenge he's spent years craving, it's all the excuse he needs to help her&#8212;for a price. Yet every breathless night spent tangled together has given Hades a taste for Persephone, and he'll go to war with Olympus itself to keep her close...\"Deliciously inventive...Red-hot.\"&#8212;Publishers Weekly STARRED\"I get shivers just thinking of their interactions. SHIVERS.\"&#8212;Mimi Koehler for The Nerd DailyThe World of Dark Olympus:Neon Gods (Hades & Persephone)Electric Idol (Eros & Psyche)Wicked Beauty (Achilles & Patroclus & Helen)Radiant Sin (Apollo & Cassandra)",
        "rating": 4,
        "price": 9.99,
        "image": "//prodimage.images-bn.com/pimages/9781728231747_p0_v2_s600x595.jpg",
        "author": "Katee Robert",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Darker: Fifty Shades Darker as Told by Christian",
        "description": "\nSee the world of Fifty Shades of Grey anew through the eyes of Christian Grey&#8212;a fresh perspective on the love story that has enthralled millions of readers around the world.\"Please don't bite your lip, Anastasia.\" My voice is low, full of longing. Will I always want her like this? I want to kiss her, press her into the elevator wall like I did during our first kiss. I want to make her mine again.Their scorching, sensual affair ended in heartbreak and recrimination, but Christian Grey cannot get Anastasia Steele out of his mind, or his blood. Determined to win her back, he tries to suppress his darkest desires and his need for complete control, and to love Ana on her own terms.But the horrors of his childhood still haunt him, and Ana's scheming boss, Jack Hyde, clearly wants her for himself. Can Christian's confidant and therapist, Dr. Flynn, help him face down his demons? Or will the possessiveness of Elena, his seducer, and the deranged devotion of Leila, his former submissive, drag Christian down into the past?And if Christian does win Ana back, can a man so dark and damaged ever hope to keep her?Discover the world of Fifty Shades of Grey:An Instant #1 New York Times BestsellerMore than 165 Million Copies Sold WorldwideOne of 100 Great Reads in the Great American Read133 Weeks on the New York Times Bestseller ListThis book is intended for mature audiences.",
        "rating": 4,
        "price": 9.99,
        "image": "//prodimage.images-bn.com/pimages/9780385543989_p0_v6_s600x595.jpg",
        "author": "E L James",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Hidden: An Exciting Novel of Suspense",
        "description": "\n<B><I>A page-turning new story from the bestselling author of No Way Out<I>, perfect for fans of Nora Roberts and Danielle Steel! <I>Meet a brother and sister who are drawn into a treacherous mystery through an antique with a dark past, as they race against time to help a single mother and take down a ruthless couple bent on taking control of their family&rsquo;s legacy&hellip;<BR><BR> At first glance, few would guess that Luna and Cullen Bodman are siblings. Cullen is efficient and serious while his younger sister Luna is a free spirit. When the two launch their furniture restoration shop/caf&eacute;&mdash;an offshoot of the family&rsquo;s longtime antique business&mdash;in an up-and-coming arts center, little do they know their unique talents may be their only defense against a dangerous betrayal.<BR> &#160;<BR> When Luna gets a strange sense about a piece Cullen just acquired, the two find themselves uniting to solve a mystery that has far-reaching consequences&mdash;never knowing there are some who&rsquo;ll stop at nothing to claim what they believe is theirs. No matter what, Luna and Cullen know they can rely on each other&mdash;and this time, their lives may depend on it&hellip;<BR><BR> &#160;",
        "rating": 4,
        "price": 9.49,
        "image": "//prodimage.images-bn.com/pimages/9781420152333_p0_v2_s600x595.jpg",
        "author": "Fern Michaels",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "description": "\nNEW YORK TIMES BESTSELLER<BR> <BR>&ldquo;If you&rsquo;re looking for a book to take on holiday this summer, The Seven Husbands of Evelyn Hugo has got all the glitz and glamour to make it a perfect beach read.&rdquo; &#8212;Bustle<BR> <BR>From the New York Times bestselling author of Daisy Jones & the Six&#8212;an entrancing and &ldquo;wildly addictive journey of a reclusive Hollywood starlet&rdquo; (PopSugar) as she reflects on her relentless rise to the top and the risks she took, the loves she lost, and the long-held secrets the public could never imagine.<BR><BR>Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?<BR> <BR>Monique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.<BR> <BR>Summoned to Evelyn&rsquo;s luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the &lsquo;80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn&rsquo;s story near its conclusion, it becomes clear that her life intersects with Monique&rsquo;s own in tragic and irreversible ways.<BR> <BR>&ldquo;Heartbreaking, yet beautiful&rdquo; (Jamie Blynn, Us Weekly), The Seven Husbands of Evelyn Hugo is &ldquo;Tinseltown drama at its finest&rdquo; (Redbook)&#58; a mesmerizing journey through the splendor of old Hollywood into the harsh realities of the present day as two women struggle with what it means&#8212;and what it costs&#8212;to face the truth.",
        "rating": 5,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9781501161933_p0_v13_s600x595.jpg",
        "author": "Taylor Jenkins Reid",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Book Lovers",
        "description": "\n&ldquo;One of my favorite authors.&rdquo;&mdash;Colleen HooverAn insightful, delightful, instant #1 New York Times bestseller from the&#160;author of Beach Read and People We Meet on Vacation. Named a Most Anticipated Book of 2022 by Oprah Daily &#8729; Today &#8729; Parade &#8729; Marie Claire &#8729; Bustle &#8729; PopSugar &#8729; Katie Couric Media &#8729; Book Bub &#8729; SheReads &#8729; Medium &#8729; The Washington Post &#8729;&#160;and more!One summer. Two rivals. A plot twist they didn't see coming... Nora Stephens' life is books&mdash;she&rsquo;s read them all&mdash;and she is not that type of heroine. Not the plucky one, not the laidback dream girl, and especially not the sweetheart. In fact, the only people Nora is a heroine for are her clients, for whom she lands enormous deals as a cutthroat literary agent, and her beloved little sister Libby. Which is why she agrees to go to Sunshine Falls, North Carolina for the month of August when Libby begs her for a sisters&rsquo; trip away&mdash;with visions of a small town transformation for Nora, who she&rsquo;s convinced needs to become the heroine in her own story. But instead of picnics in meadows, or run-ins with a handsome country doctor or bulging-forearmed bartender, Nora keeps bumping into Charlie Lastra, a bookish brooding editor from back in the city. It would be a meet-cute if not for the fact that they&rsquo;ve met many times and it&rsquo;s never been cute. If Nora knows she&rsquo;s not an ideal heroine, Charlie knows he&rsquo;s nobody&rsquo;s hero, but as they are thrown together again and again&mdash;in a series of coincidences no editor worth their salt would allow&mdash;what they discover might just unravel the carefully crafted stories they&rsquo;ve written about themselves.",
        "rating": 5,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9780593334836_p0_v2_s600x595.jpg",
        "author": "Emily Henry",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "I Will Die in a Foreign Land",
        "description": "\n* 2022 Young Lions Fiction Award, Winner.* VCU Cabell First Novelist Award, Longlist.* An ABA &#34;Indie Next List&#34; pick for November 2021.* &#34;A Best Book of 2021&#34; &#8212;New York Public Library,&#160;Cosmopolitan,&#160;Independent Book Review* &#34;October 2021 Must-Reads&#34;&#160;&#8212;Debutiful,&#160;The Chicago Review of Books,&#160;The MillionsIn 1913, a Russian ballet incited a riot in Paris at the new Th&#233;&#226;tre de Champs-Elys&#233;es. &#8220;Only a Russian could do that,&#34; says Aleksandr Ivanovich. &#8220;Only a Russian could make the whole world go mad.&#8221;A century later, in November 2013, thousands of Ukrainian citizens gathered at Independence Square in Kyiv to protest then-President Yanukovych&#8217;s failure to sign a referendum with the European Union, opting instead to forge a closer alliance with President Vladimir Putin and Russia. The peaceful protests turned violent when military police shot live ammunition into the crowd, killing over a hundred civilians.I Will Die in a Foreign Land follows four individuals over the course of a volatile Ukrainian winter, as their lives are forever changed by the Euromaidan protests. Katya is an Ukrainian-American doctor stationed at a makeshift medical clinic in St. Michael&#8217;s Monastery; Misha is an engineer originally from Pripyat, who has lived in Kyiv since his wife&#8217;s death; Slava is a fiery young activist whose past hardships steel her determination in the face of persecution; and Aleksandr Ivanovich, a former KGB agent, who climbs atop a burned-out police bus at Independence Square and plays the piano.As Katya, Misha, Slava, and Aleksandr&#8217;s lives become intertwined, they each seek their own solace during an especially tumultuous and violent period. The story is also told by a chorus of voices that incorporates folklore and narrates a turbulent Slavic history.While unfolding an especially moving story of quiet beauty and love in a time of terror, I Will Die in a Foreign Land is an ambitious, intimate, and haunting portrait of human perseverance and empathy.&#34;Kalani Pickhart's timely debut novel, I Will Die In a Foreign Land, is about the 2014 Ukrainian revolution which provided a pretense for Russia to annex Crimea.&#160;The story follows the experiences of several characters whose lives intersect as the country's political situation deteriorates. There's a Ukrainian-American doctor, an old KGB spy, a former mine worker, and others, and these episodes are interspersed with folk songs, news reports and historical notes.&#160;The effect&#8212;kaleidoscopic but never confusing&#8212;provides an intimate sense of a country convulsing, mourning, and somehow surviving.&#34;&#8212;CBS News, &#34;The Book Report: Recommendations from Washington Post critic Ron Charles&#34;(Watch the full video on CBS News, February 6, 2022).",
        "rating": 1,
        "price": 9.99,
        "image": "//prodimage.images-bn.com/pimages/9781953387097_p0_v2_s600x595.jpg",
        "author": "Kalani Pickhart",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The Old Man",
        "description": "\n<B>Now an original series from FX starring Jeff Bridges, John Lithgow, and Amy Brenneman<B>: a retired intelligence officer living off the grid is caught in &ldquo;[a] harrowing hunt-and-hide adventure&rdquo; (<I>The New York Times).<BR><BR> To all appearances, Dan Chase is a harmless retiree in Vermont with two big mutts and a grown daughter he keeps in touch with by phone. But most sixty-year-old widowers don&rsquo;t have multiple driver&rsquo;s licenses, savings stockpiled in banks across the country, or two Beretta Nanos stashed in the spare bedroom closet. Most have not spent decades on the run.<BR><BR> Thirty-five years ago, as a young army intelligence hotshot, Chase was sent to Libya to covertly assist a rebel army. When the plan turned sour, Chase acted according to his conscience&mdash;and triggered consequences he never could have anticipated. To this day, someone still wants him dead. And just when he thought he was finally safe, Chase is confronted with the history he spent much of his life trying to escape.<BR><BR> Edgar Award&ndash;winning author Thomas Perry writes thrillers that move &ldquo;almost faster than a speeding bullet&rdquo; (<I>Wall Street Journal). <I>The Old Man is his latest whip-smart standalone novel, and has been adapted into a critically acclaimed television series starring Jeff Bridges as retired CIA Agent Dan Chase.<BR><BR> &ldquo;Perry drives deep into Jack Reacher territory in this stand-alone [novel]&#160;.&#160;.&#160;. Swift, unsentimental, and deeply satisfying.&rdquo; &mdash;<I>Kirkus Reviews",
        "rating": 2,
        "price": 17.99,
        "image": "//prodimage.images-bn.com/pimages/9780802189769_p0_v6_s600x595.jpg",
        "author": "Thomas Perry",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Where the Crawdads Sing: A Novel",
        "description": "How long can you protect your heart?For years, rumors of the \"Marsh Girl\" have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life—until the unthinkable happens.Perfect for fans of Barbara Kingsolver and Karen Russell, Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
        "rating": 2,
        "price": 22.5,
        "image": "//prodimage.images-bn.com/pimages/2940172053900_p0_v4_s600x595.jpg",
        "author": "Delia Owens",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb8"
    },
    {
        "name": "It Ends with Us",
        "description": "\nIn this &ldquo;brave and heartbreaking novel that digs its claws into you and doesn&rsquo;t let go, long after you&rsquo;ve finished it&rdquo; (Anna Todd, New York Times bestselling author) from the #1 New York Times bestselling author of All Your Perfects, a workaholic with a too-good-to-be-true romance can&rsquo;t stop thinking about her first love.<BR><BR>Lily hasn&rsquo;t always had it easy, but that&rsquo;s never stopped her from working hard for the life she wants. She&rsquo;s come a long way from the small town where she grew up&#8212;she graduated from college, moved to Boston, and started her own business. And when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily&rsquo;s life seems too good to be true.<BR> <BR>Ryle is assertive, stubborn, maybe even a little arrogant. He&rsquo;s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn&rsquo;t hurt. Lily can&rsquo;t get him out of her head. But Ryle&rsquo;s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his &ldquo;no dating&rdquo; rule, she can&rsquo;t help but wonder what made him that way in the first place.<BR> <BR>As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan&#8212;her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.<BR> <BR>An honest, evocative, and tender novel, It Ends with Us is &ldquo;a glorious and touching read, a forever keeper. The kind of book that gets handed down&rdquo; (USA TODAY).",
        "rating": 5,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781501110368_p0_v10_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "It Ends with Us",
        "description": "\nIn this &ldquo;brave and heartbreaking novel that digs its claws into you and doesn&rsquo;t let go, long after you&rsquo;ve finished it&rdquo; (Anna Todd, New York Times bestselling author) from the #1 New York Times bestselling author of All Your Perfects, a workaholic with a too-good-to-be-true romance can&rsquo;t stop thinking about her first love.<BR><BR>Lily hasn&rsquo;t always had it easy, but that&rsquo;s never stopped her from working hard for the life she wants. She&rsquo;s come a long way from the small town where she grew up&#8212;she graduated from college, moved to Boston, and started her own business. And when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily&rsquo;s life seems too good to be true.<BR> <BR>Ryle is assertive, stubborn, maybe even a little arrogant. He&rsquo;s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn&rsquo;t hurt. Lily can&rsquo;t get him out of her head. But Ryle&rsquo;s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his &ldquo;no dating&rdquo; rule, she can&rsquo;t help but wonder what made him that way in the first place.<BR> <BR>As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan&#8212;her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.<BR> <BR>An honest, evocative, and tender novel, It Ends with Us is &ldquo;a glorious and touching read, a forever keeper. The kind of book that gets handed down&rdquo; (USA TODAY).",
        "rating": 3,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781501110368_p0_v10_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "Pink Lemonade Cake Murder",
        "description": "\n<B>Fans of deliciously charming, page-turning whodunits rejoice! Beloved <I>New York Times bestselling author and Queen of the Culinary Mystery Joanne Fluke delivers the twenty-eighth mouthwatering Hannah Swensen Mystery!<BR> &#160; <B><I>In this irresistible mystery from<B> New York Times<I> and USA Today<I> bestselling author Joanne Fluke, Hannah Swensen is at the center of a lively summer fest with fun for everyone in Lake Eden, Minnesota&mdash;including a cold-blooded murderer . . . <BR> &#160;<BR> The Tri-County Summer Solstice Celebration has come to town, and even among local artisans, athletes, and marching bands, Hannah attracts fans of her own while serving lip-smacking pink lemonade desserts. But the mood sours when a body turns up, leading revelers to wonder if the festivities mark both the <I>longest day of the year and the <I>deadliest . . .<BR> &#160;<BR> A retired professional MLB player has met a terrifying end&mdash;and, considering the rumors swirling about his past, the list of suspects could fill a small stadium. Among them could soon be Delores, Hannah&rsquo;s mother, who publicly held a grunge against the victim after he infamously dunked her in the tank at a previous county fair . . . &#160;<BR> &#160;<BR> Now, with her mother&rsquo;s innocence on the line, a life-changing announcement at The Cookie Jar, and a plethora of desserts to bake, Hannah can&rsquo;t afford to strike out as she begins a dangerous investigation into the ruthless killer who&rsquo;s truly in a league of their own . . . &#160;<BR><B>Features Over a Dozen Cookie and Dessert Recipes from The Cookie Jar!<BR> &#160;",
        "rating": 4,
        "price": 22.95,
        "image": "//prodimage.images-bn.com/pimages/9781496736130_p0_v1_s600x595.jpg",
        "author": "Joanne Fluke",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Throne of Glass (Throne of Glass Series #1)",
        "description": "\nAfter serving out a year of hard labor in the salt mines of Endovier for her crimes, 18-year-old assassin Celaena Sardothien is dragged before the Crown Prince. Prince Dorian offers her her freedom on one condition&#58; she must act as his champion in a competition to find a new royal assassin.Her opponents are men-thieves and assassins and warriors from across the empire, each sponsored by a member of the king's council. If she beats her opponents in a series of eliminations, she'll serve the kingdom for three years and then be granted her freedom. Celaena finds her training sessions with the captain of the guard, Westfall, challenging and exhilirating. But she's bored stiff by court life. Things get a little more interesting when the prince starts to show interest in her... but it's the gruff Captain Westfall who seems to understand her best.Then one of the other contestants turns up dead... quickly followed by another. Can Celaena figure out who the killer is before she becomes a victim? As the young assassin investigates, her search leads her to discover a greater destiny than she could possibly have imagined.",
        "rating": 1,
        "price": 9.59,
        "image": "//prodimage.images-bn.com/pimages/9781599909394_p0_v5_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "The 7½ Deaths of Evelyn Hardcastle",
        "description": "\n\"Pop your favorite Agatha Christie whodunnit into a blender with a scoop of Downton Abbey, a dash of Quantum Leap, and a liberal sprinkling of Groundhog Day and you'll get this unique murder mystery.\" ?Harper's BazaarThe 7&#189; Deaths of Evelyn Hardcastle is a breathlessly addictive mystery that follows one man's race to find a killer, with an astonishing time-turning twist that means nothing and no one are quite what they seem.Aiden Bishop knows the rules. Evelyn Hardcastle will die every day until he can identify her killer and break the cycle. But every time the day begins again, Aiden wakes up in the body of a different guest at Blackheath Manor. And some of his hosts are more helpful than others. With a locked-room mystery that Agatha Christie would envy, Stuart Turton unfurls a breakneck novel of intrigue and suspense.International bestselling author Stuart Turton delivers inventive twists in a thriller of such unexpected creativity it will leave readers guessing until the very last page.Other Thrillers from Sourcebooks Landmark:The Devil and the Dark Water by Stuart TurtonThe Lies I Tell by Julie ClarkThe Last Housewife by Ashley WinsteadThe Last Party by Clare MackintoshTrue Crime Story by Joseph Knox",
        "rating": 1,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781492657972_p0_v4_s600x595.jpg",
        "author": "Stuart Turton",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Dirtbag, Massachusetts: A Confessional",
        "description": "\nINSTANT NEW YORK TIMES BESTSELLERINSTANT USA TODAY BESTSELLER &#8220;The best of what memoir can accomplish... pulling no punches on the path to truth, but it always finds the capacity for grace and joy.&#8221; &#8211;Esquire, \"Best Memoirs of the Year\"A TIME Best Book of the Summer * A Rolling Stone Top Culture Pick * A Publishers Weekly Best Memoir of the Season * A Buzzfeed Book Pick * A Goodreads Readers' Most Anticipated Book * A Chicago Tribune Book Pick * A Boston.com Book You Should Read * A Los Angeles Times Book to Add to Your Reading List * An Entertainment Weekly Best Book of the Month * A 2022 New England Book Award FinalistIsaac Fitzgerald has lived many lives. He's been an altar boy, a bartender, a fat kid, a smuggler, a biker, a prince of New England. But before all that, he was a bomb that exploded his parents' lives-or so he was told. In Dirtbag, Massachusetts, Fitzgerald, with warmth and humor, recounts his ongoing search for forgiveness, a more far-reaching vision of masculinity, and a more expansive definition of family and self.Fitzgerald's memoir-in-essays begins with a childhood that moves at breakneck speed from safety to violence, recounting an extraordinary pilgrimage through trauma to self-understanding and, ultimately, acceptance. From growing up in a Boston homeless shelter to bartending in San Francisco, from smuggling medical supplies into Burma to his lifelong struggle to make peace with his body, Fitzgerald strives to take control of his own story: one that aims to put aside anger, isolation, and entitlement to embrace the idea that one can be generous to oneself by being generous to others.Gritty and clear-eyed, loud-hearted and beautiful, Dirtbag, Massachusetts is a rollicking book that might also be a lifeline.",
        "rating": 4,
        "price": 18.9,
        "image": "//prodimage.images-bn.com/pimages/9781635573985_p0_v6_s600x595.jpg",
        "author": "Isaac Fitzgerald",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Reminders of Him",
        "description": "\nA troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover.After serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter&#8217;s life is determined to shut Kenna out, no matter how hard she works to prove herself.The only person who hasn&#8217;t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna&#8217;s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna&#8217;s life, both would risk&#160;losing the trust of everyone important to them.The two form a connection despite the&#160;pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing.",
        "rating": 4,
        "price": 15.95,
        "image": "//prodimage.images-bn.com/pimages/9781542025607_p0_v1_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Love on the Brain",
        "description": "\nFrom the New York Times bestselling author of The Love Hypothesis comes a new STEMinist rom-com in which a scientist is forced to work on a project with her nemesis&mdash;with explosive results.Like an avenging, purple-haired Jedi bringing balance to the mansplained universe, Bee K&ouml;nigswasser lives by a simple code&#58; What would Marie Curie do? If NASA offered her the lead on a neuroengineering project&mdash;a literal dream come true after years scraping by on the crumbs of academia&mdash;Marie would accept without hesitation. Duh. But the mother of modern physics never had to co-lead with Levi Ward. &#160; Sure, Levi is attractive in a tall, dark, and piercing-eyes kind of way. And sure, he caught her in his powerfully corded arms like a romance novel hero when she accidentally damseled in distress on her first day in the lab. But Levi made his feelings toward Bee very clear in grad school&mdash;archenemies work best employed in their own galaxies far, far away. &#160; Now, her equipment is missing, the staff is ignoring her, and Bee finds her floundering career in somewhat of a pickle. Perhaps it&rsquo;s her occipital cortex playing tricks on her, but Bee could swear she can see Levi softening into an ally, backing her plays, seconding her ideas&hellip;devouring her with those eyes. And the possibilities have all her neurons firing. But when it comes time to actually make a move and put her heart on the line, there&rsquo;s only one question that matters&#58; What will Bee K&ouml;nigswasser do?",
        "rating": 3,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9780593336847_p0_v6_s600x595.jpg",
        "author": "Ali Hazelwood",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "The Perfect Marriage",
        "description": "\n<B>The bestselling thriller with &#8220;a tantalizing premise and twists at every turn&#160;.&#160;.&#160;. a sizzling, masterful debut about betrayal and justice&#8221; (Samantha M. Bailey, #1 national bestselling author).<B>Optioned by Picture Perfect Federation for development as a film or TV seriesSarah Morgan is a successful and powerful defense attorney in Washington D.C. As a named partner at her firm, life is going exactly how she planned. The same cannot be said for her husband, Adam. He&#8217;s a struggling writer who has had little success in his career and he tires of his and Sarah&#8217;s relationship as she is constantly working.&#160;Out in the secluded woods, at the couple&#8217;s lake house, Adam engages in a passionate affair with Kelly Summers. But one morning everything changes. Kelly is found brutally stabbed to death and now, Sarah must take on her hardest case yet, defending her own husband, a man accused of murdering his mistress.&#160;<I>The Perfect Marriage is a juicy, twisty, and utterly addictive thriller that will keep you turning pages. You won&#8217;t see the ending coming&#160;.&#160;.&#160;. guaranteed!<B>&#8220;A twisty, compulsive book that will keep you reading all night! Fast-paced with crisp writing and an intriguing plot. Jeneva Rose is one to watch.&#8221; &#8212;Samantha Downing, #1 international bestselling author of <I>My Lovely Wife<B>&#8220;A book to be read in one gulp&#8212;this dastardly debut flies to a shocking reveal. I couldn&#8217;t put it down; I had to see what happened. Twists galore.&#8221; &#8212;J.T. Ellison, <I>New York Times&#8211;bestselling author of <I>Her Dark Lies",
        "rating": 1,
        "price": 9.99,
        "image": "//prodimage.images-bn.com/pimages/9781504071574_p0_v1_s600x595.jpg",
        "author": "Jeneva Rose",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Verity",
        "description": "\n<B><I>New York Times<B>&#160;Bestseller<B><I>USA Today&#160;Bestseller<I>The Globe and Mail&#160;Bestseller<I>Publishers Weekly&#160;Bestseller<I>Whose truth is the lie?&#160;Stay up all night reading&#160;the sensational psychological thriller that has readers obsessed, from the #1&#160;<I>New York Times&#160;bestselling author of&#160;<I>It Ends With Us.Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.&#160;Lowen arrives at the Crawford home, ready to sort through years of Verity&rsquo;s notes and outlines, hoping to find enough material to get her started. What Lowen doesn&rsquo;t expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity&#39;s recollection of the night her family was forever altered.&#160;Lowen decides to keep the manuscript hidden from Jeremy, knowing its contents could devastate the already grieving father. But as Lowen&rsquo;s feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife&rsquo;s words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue loving her.",
        "rating": 4,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781538724736_p0_v4_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Kingdom of the Feared (B&N Exclusive Edition) (Kingdom of the Wicked Series #3)",
        "description": "\n<B>This Barnes & Noble Exclusive Edition contains a spicy bonus chapter from Envy’s POV and features a unique cover!From the #1 <I>New York Times bestselling author of the Stalking Jack the Ripper series comes the steamy conclusion to Kingdom of the Wicked trilogy.<B><I>Two curses.<BR><B><I>One prophecy.<BR><B><I>A reckoning all have feared.<B><I>And a love more powerful than fate. All hail the king and queen of Hell.Emilia is reeling from a shocking discovery about her sister, Vittoria. But before she faces the demons of her past, Emilia yearns to claim her king, the seductive Prince of Wrath, in the flesh. She doesn’t just desire his body; she wants his heart and soul—but that’s something the enigmatic demon can’t promise her.When a high-ranking member of House Greed is assassinated, damning evidence somehow points to Vittoria as the murderer. Now, Emilia will do anything to get to the bottom of these accusations against the sister she thought she knew. Together, Emilia and Wrath play a sin-fueled game of deception to solve the murder and stop the unrest that’s brewing between witches, demons, shape-shifters, and the most treacherous foes of all: the Feared. Emilia was warned that when it came to the Wicked, nothing was as it seemed. But have the true villains been much closer all along?#1 New York Times bestselling author Kerri Maniscalco delivers sizzling romance, sexy secrets, and unexpected twists in this unforgettable conclusion to the Kingdom of the Wicked series.Suggested for ages 16 and up. \n",
        "rating": 2,
        "price": 19.99,
        "image": "//prodimage.images-bn.com/pimages/9780316479882_p0_v2_s600x595.jpg",
        "author": "Kerri Maniscalco",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9780316479882_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780316479882_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780316479882_p3_v5_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Loveless",
        "description": "\nFor fans of <I>Love, Simon and <I>I Wish You All the Best, a funny, honest, messy, completely relatable story of a girl who realizes that love can be found in many ways that don't involve sex or romance.<P><P>From the marvelous author of <I>Heartstopper comes an exceptional YA novel about discovering that it's okay if you don't have sexual or romantic feelings for anyone . . . since there are plenty of other ways to find love and connection.<P><P>This is the funny, honest, messy, completely relatable story of Georgia, who doesn't understand why she can't crush and kiss and make out like her friends do. She's surrounded by the narrative that dating + sex = love. It's not until she gets to college that she discovers the A range of the LGBTQIA+ spectrum &#151; coming to understand herself as asexual/aromantic. Disrupting the narrative that she's been told since birth isn't easy &#151; there are many mistakes along the way to inviting people into a newly found articulation of an always-known part of your identity. But Georgia's determined to get her life right, with the help of (and despite the major drama of) her friends.",
        "rating": 3,
        "price": 18.99,
        "image": "//prodimage.images-bn.com/pimages/9781338751932_p0_v1_s600x595.jpg",
        "author": "Alice Oseman",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781338751932_p1_v2_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "Heartstopper, Volume 1",
        "description": "\n<B>Boy meets boy. Boys become friends. Boys fall in love. A sweet and charming coming-of-age story that explores friendship, love, and coming out. This edition features beautiful two-color artwork.<P><B>Now streaming on Netflix!<P><P>Shy and softhearted Charlie Spring sits next to rugby player Nick Nelson in class one morning. A warm and intimate friendship follows, and that soon develops into something more for Charlie, who doesn't think he has a chance.<P>But Nick is struggling with feelings of his own, and as the two grow closer and take on the ups and downs of high school, they come to understand the surprising and delightful ways in which love works.",
        "rating": 2,
        "price": 14.99,
        "image": "//prodimage.images-bn.com/pimages/9781338617436_p0_v2_s600x595.jpg",
        "author": "Alice Oseman",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781338617436_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617436_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617436_p3_v5_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "The New Neighbor: A Thriller",
        "description": "\n\"The New Neighbor is a dizzying descent into a Byzantine maze of psychological suspense. Carter Wilson proves once again why he is one of the best most inventive thriller writers working today.\" &#8212; S. A. Cosby, New York Times bestselling author of Razorblade Tears and Blacktop WastelandUSA Today bestselling author Carter Wilson returns with another chilling psychological thriller, for readers of Megan Miranda and Alex MichaelidesAidan holds the winning Powerball numbers.Is today the best day of his life... or the worst?Aidan Marlowe is the superstitious type&#8212;he's been playing the same lottery numbers for fifteen years, never hitting the jackpot. Until now. On the day of his wife's funeral.Aidan struggles to cope with these two sudden extremes: instant wealth beyond his imagination, and the loss of the only woman he's ever loved, the mother of his twin children. But the money gives him and his kids options they didn't have before. They can leave everything behind. They can start a new life in a new town. So they do.But a huge new house and all the money in the world can't replace what they've lost, and it's not long before Aidan realizes he's merely trading old demons for new ones. Because someone is watching him and his family very closely. Someone who knows exactly who they are, where they've come from, and what they're trying to hide. Someone who will stop at nothing to get what they want...\"Carter Wilson's writing is evocative and intense, his characters deeply flawed yet relatable.\"&#8212;Julie Clark, New York Times bestselling author of The Last Flight for The Dead Husband\"A smashing story about families and secrets and all the things you don't want to know about the people closest to you. Read it!\"&#8212;David Bell, USA Today bestselling author for The Dead HusbandMore books by Carter Wilson:The Dead HusbandThe Dead Girl in 2AMister Tender's Girl",
        "rating": 1,
        "price": 9.99,
        "image": "//prodimage.images-bn.com/pimages/9781728247533_p0_v2_s600x595.jpg",
        "author": "Carter Wilson",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "A Court of Silver Flames (B&N Exclusive Edition) (A Court of Thorns and Roses Series #4)",
        "description": "\nThis Barnes & Noble Exclusive edition will have a special cover featuring a mask accentuated with foil and spot gloss. Additionally, this B&N Exclusive Edition will include a second printing of the bonus scene featuring Feyre and Rhys. Sarah J. Maas's sexy, richly imagined series continues with the journey of Feyre's fiery sister, Nesta. Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it.The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other. Meanwhile, the treacherous human queens who returned to the Continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might very well rely on Cassian and Nesta facing their haunting pasts.Against the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms.",
        "rating": 3,
        "price": 19,
        "image": "//prodimage.images-bn.com/pimages/9781639730841_p0_v3_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Twilight",
        "description": "\n<B>Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a \"literary phenomenon\" and redefined romance for a generation (<I>New York Times).Isabella Swan's move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella's life takes a thrilling and terrifying turn.Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife &#151; between desire and danger.Deeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite.<B>It's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, <I>Midnight Sun&#58; the iconic love story of Bella and Edward told from the vampire's point of view.<B>\"People do not want to just read Meyer's books; they want to climb inside them and live there.\" &#151; <I>Time<B><B>\"A literary phenomenon.\" &#151; <I>The New York Times",
        "rating": 2,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9780316327336_p0_v1_s600x595.jpg",
        "author": "Stephenie Meyer",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "All of Us Villains",
        "description": "The blockbuster co-writing debut of Amanda Foody and Christine Lynn Herman, All of Us Villains begins a dark tale of ambition and magick...You Fell In Love With The Victors of The Hunger Games.Now Prepare To Meet The Villains of The Blood Veil.The Blood Moon rises. The Blood Veil falls.The Tournament begins.Every generation, at the coming of the Blood Moon, seven families in the remote city of Ilvernath each name a champion to compete in a tournament to the death. The prize? Exclusive control over a secret wellspring of high magick, the most powerful resource in the world-one thought long depleted. This year, thanks to a salacious tell-all book, the seven champions are thrust into worldwide spotlight, granting each of them new information, new means to win, and most importantly: a choice: accept their fate or rewrite their story.But this is a story that must be penned in blood.A Macmillan Audio production from Tor Teen",
        "rating": 1,
        "price": 26.99,
        "image": "//prodimage.images-bn.com/pimages/2940172933424_p0_v3_s600x595.jpg",
        "author": "Amanda Foody",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb8"
    },
    {
        "name": "A Touch of Darkness",
        "description": "\nFrom bestselling author Scarlett St. Clair comes a dark and enthralling reimagining of the Hades and Persephone Greek myth. \"Let me worship you,\" he said.She remembered the words she had whispered to him in the back of the limo after La Rose. \"You will worship me, and I won't even have to order you.\" His request felt sinful and devious, and she reveled in it.She answered, \"Yes.\"Persephone is the Goddess of Spring in title only. Since she was a little girl, flowers have only shriveled at her touch. After moving to New Athens, she hoped to lead an unassuming life disguised as a mortal journalist. All of that changes when she sits down in a forbidden nightclub to play a hand of cards with a hypnotic and mysterious stranger.Hades, God of the Dead, has built a gambling empire in the mortal world and his favorite bets are rumored to be impossible. But nothing has ever intrigued him as much as the goddess offering him a bargain he can't resist.After her encounter with Hades, Persephone finds herself in a contract with the God of the Dead, and his terms are impossible&#58; Persephone must create life in the Underworld or lose her freedom forever. The bet does more than expose Persephone's failure as a goddess, however. As she struggles to sow the seeds of her freedom, love for the God of the Dead grows&#8212;a love that is both captivating and forbidden.",
        "rating": 2,
        "price": 16.99,
        "image": "//prodimage.images-bn.com/pimages/9781728258454_p0_v2_s600x595.jpg",
        "author": "Scarlett St. Clair",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "The Atlas Six",
        "description": "\nAn instant New York Times bestseller!The much-acclaimed viral sensation from Olivie Blake, The Atlas Six&#151;now newly revised and edited with additional content.&#8226; The tag #theatlassix has millions of views on TikTok&#8226; A dark academic debut fantasy with an established cult following that reads like The Secret History meets The Umbrella Academy&#8226; The first in an explosive trilogy&#8226; Indigo's Top 10 Most Anticipated Sci-Fi & Fantasy Books of 2022&#8226; Tor.com's Most Anticipated SFF of 2022 Each decade, only the six most uniquely talented magicians are selected to earn a place in the Alexandrian Society, the foremost secret society in the world. The chosen will secure a life of power and prestige beyond their wildest dreams.But at what cost?Each of the six newest recruits has their reasons for accepting the Society&#8217;s elusive invitation. Even if it means growing closer than they could have imagined to their most dangerous enemies&#8212; or risking unforgivable betrayal from their most trusted allies&#8212; they will fight tooth and nail for the right to join the ranks of the Alexandrians.Even if it means they won&#8217;t all survive the year.&#8220;With a cast of complicated hate-to-love-them characters and enough delicious philosophizing to satisfy even the pickiest dark academia heart, this book will drag you into its undertow and refuse to let you go til morning.\" &#8212; Victoria Lee, author of A Lesson in Vengeance and The Fever King\"Compelling, entertaining, and addictive. The Atlas Six is academic Darwinism&#58; survival of the smartest with a healthy dose of magic.\" &#8212; T.L. Huchu, author of The Library of The Dead\"Lethally smart. Filled with a cast of brilliantly realized characters, each entangled with one another in torturously delicious ways, The Atlas Six will grip you by the throat and refuse to let go. Olivie Blake is a mind-blowing talent.\"&#8212;Chloe Gong, author of the New York Times bestseller These Violent Delights\"The Atlas Six will thrill those who love twisted plots, twisted relationships, and morally grey characters ready to kill for knowledge and power. Dark, ambitious, and engaging.\" &#8212; H.G. Parry, author of A Declaration Of The Rights For Magicians\"With a fascinating magic system explored through the lens of philosophy and morality, narrated by dynamic, enthralling characters, the ATLAS SIX is a tour de force. I read this book in two sittings&#151;once I picked it up, I found it almost impossible to put down.\" &#8212; Christine Lynn Herman, New York Times and indie bestselling author of All of Us Villains \" This chilling story of ambition and magic will make you question your own morals as you grow to love (and hate) its fascinating, ruthless cast of characters. I utterly devoured this book.\" &#8212; Amanda Foody, New York Times and indie bestselling author of All of Us Villains \"The Atlas Six is a fantasy novel that understands that what the people want is more dark academia stories with flawless vibes and aesthetics and hot morally fraudulent characters who are constantly on the verge of either killing each other or fucking each other. I'm the people.\"&#8212;chai, viral book reviewer @proyearner",
        "rating": 4,
        "price": 25.99,
        "image": "//prodimage.images-bn.com/pimages/9781250854513_p0_v4_s600x595.jpg",
        "author": "Olivie Blake",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "The Final Gambit (Inheritance Games Series #3)",
        "description": "<B>OVER 750,000 COPIES SOLD OF THE #1 BESTSELLING SERIES!<BR /><BR /><B>Avery's fortune, life, and loves are on the line in the game that <I>everyone will be talking about.<BR /><BR />To inherit billions, all Avery Kylie Grambs has to do is survive a few more weeks living in Hawthorne House. The paparazzi are dogging her every step. Financial pressures are building. Danger is a fact of life. And the only thing getting Avery through it all is the Hawthorne brothers. Her life is intertwined with theirs. She knows their secrets, and they know <I>her.<BR /> <BR />But as the clock ticks down to the moment when Avery will become the richest teenager on the planet, trouble arrives in the form of a visitor who needs her help-and whose presence in Hawthorne House could change everything. It soon becomes clear that there is one last puzzle to solve, and Avery and the Hawthorne brothers are drawn into a dangerous game against an unknown and powerful player.<BR /> <BR /><I>Secrets upon secrets. Riddles upon riddles. In this game, there are hearts and lives at stake-and there is nothing more Hawthorne than winning.",
        "rating": 2,
        "price": 25.98,
        "image": "//prodimage.images-bn.com/pimages/2940176135848_p0_v2_s600x595.jpg",
        "author": "Jennifer Lynn Barnes",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb8"
    },
    {
        "name": "Crown of Midnight (Throne of Glass Series #2)",
        "description": "\nShe is the greatest assassin her world has ever known.But does she have the heart of a killer?After a year of hard labor in the Salt Mines of Endovier, eighteen-year-old assassin Celaena Sardothien has won the king's contest to become the new royal assassin. But Calaena is far from loyal to the crown. Keeping up the charade - while pretending to do the king's bidding - will test her skills in an entirely new way. And it certainly isn't the only point of confusion for the young girl. Because though she's made her choice between Dorian and Chaol, the ways of the heart are never simple...",
        "rating": 2,
        "price": 9.59,
        "image": "//prodimage.images-bn.com/pimages/9781619630635_p0_v7_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    },
    {
        "name": "Normal People",
        "description": "\nNOW AN EMMY-NOMINATED HULU ORIGINAL SERIES &bull;&#160;NEW YORK TIMES&#160;BESTSELLER &bull; &ldquo;A stunning novel about the transformative power of relationships&rdquo; (People) from the author of Conversations with Friends,&#160;&ldquo;a master of the literary page-turner&rdquo; (J. Courtney Sullivan).&#160;ONE OF THE TEN BEST NOVELS OF THE DECADE&mdash;Entertainment WeeklyTEN BEST BOOKS OF THE YEAR&mdash;People, Slate,&#160;The New York Public Library,&#160;Harvard CrimsonAND BEST BOOKS OF THE YEAR&mdash;The New York Times,&#160;The New York Times Book Review,&#160;O&#58; The Oprah Magazine,&#160;Time,&#160;NPR,&#160;The Washington Post, Vogue, Esquire, Glamour, Elle, Marie Claire, Vox, The Paris Review, Good Housekeeping, Town & Country Connell and Marianne grew up in the same small town, but the similarities end there. At school, Connell is popular and well liked, while Marianne is a loner. But when the two strike up a conversation&mdash;awkward but electrifying&mdash;something life changing begins.A year later, they&rsquo;re both studying at Trinity College in Dublin. Marianne has found her feet in a new social world while Connell hangs at the sidelines, shy and uncertain. Throughout their years at university, Marianne and Connell circle one another, straying toward other people and possibilities but always magnetically, irresistibly drawn back together. And as she veers into self-destruction and he begins to&#160;search for meaning elsewhere, each must confront&#160;how far they are willing to go to save the other.Normal People&#160;is the story of mutual fascination, friendship and love. It takes us from that first conversation to the years beyond, in the company of two people who try to stay apart but find that they can&rsquo;t. &#160; Praise for&#160;Normal People &#160; &ldquo;[A] novel that demands to be read compulsively, in one sitting.&rdquo;&mdash;The Washington Post &ldquo;Arguably the buzziest novel of the season, Sally Rooney&rsquo;s elegant sophomore effort . . . is a worthy successor to&#160;Conversations with Friends. Here, again, she unflinchingly explores class dynamics and young love with wit and nuance.&rdquo;&mdash;The Wall Street Journal &ldquo;[Rooney] has been hailed as the first great millennial novelist for her stories of love and late capitalism. . . . [She writes] some of the best dialogue I&rsquo;ve read.&rdquo;&mdash;The New Yorker",
        "rating": 2,
        "price": 17,
        "image": "//prodimage.images-bn.com/pimages/9781984822185_p0_v9_s600x595.jpg",
        "author": "Sally Rooney",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb6"
    },
    {
        "name": "Heartstopper, Volume 2",
        "description": "\n<B>The second book in the delightfully sweet Heartstopper series, featuring beautiful two-color artwork!<P><B>Now streaming on Netflix!<P>Nick and Charlie are best friends, but one spontaneous kiss has changed everything. In the aftermath, Charlie thinks that he's made a horrible mistake and ruined his friendship with Nick, but Nick is more confused than ever.Love works in surprising ways, and Nick comes to see the world from a new perspective. He discovers all sorts of things about his friends, his family... and himself.",
        "rating": 5,
        "price": 14.99,
        "image": "//prodimage.images-bn.com/pimages/9781338617474_p0_v1_s600x595.jpg",
        "author": "Alice Oseman",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781338617474_p1_v2_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617474_p2_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617474_p3_v4_s600x595.jpg"
        ],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "It Starts with Us: A Novel",
        "description": "\nBefore It Ends with Us, it started with Atlas. Colleen Hoover tells fan favorite Atlas&rsquo;s side of the story and shares what comes next in this long-anticipated sequel to the &ldquo;glorious and touching&rdquo; (USA TODAY) #1 New York Times bestseller It Ends with Us.<BR><BR>Lily and her ex-husband, Ryle, have just settled into a civil coparenting rhythm when she suddenly bumps into her first love, Atlas, again. After nearly two years separated, she is elated that for once, time is on their side, and she immediately says yes when Atlas asks her on a date.<BR> <BR>But her excitement is quickly hampered by the knowledge that, though they are no longer married, Ryle is still very much a part of her life&#8212;and Atlas Corrigan is the one man he will hate being in his ex-wife and daughter&rsquo;s life.<BR> <BR>Switching between the perspectives of Lily and Atlas, It Starts with Us picks up right where the epilogue for the &ldquo;gripping, pulse-pounding&rdquo; (Sarah Pekkanen, author of Perfect Neighbors) bestselling phenomenon It Ends with Us left off. Revealing more about Atlas&rsquo;s past and following Lily as she embraces a second chance at true love while navigating a jealous ex-husband, it proves that &ldquo;no one delivers an emotional read like Colleen Hoover&rdquo; (Anna Todd, New York Times bestselling author).",
        "rating": 1,
        "price": 17.99,
        "image": "//prodimage.images-bn.com/pimages/9781668001226_p0_v3_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb2"
    },
    {
        "name": "Nightmare in Pink (Travis McGee Series #2)",
        "description": "\nFrom a beloved master of crime fiction, Nightmare in Pink is one of many classic novels featuring Travis McGee, the hard-boiled detective who lives on a houseboat. &#160; Travis McGee&rsquo;s permanent address is the Busted Flush, Slip F-18, Bahia Mar, Lauderdale, and there isn&rsquo;t a hell of a lot that compels him to leave it. Except maybe a call from an old army buddy who needs a favor. If it wasn&rsquo;t for him, McGee might not be alive. For that kind of friend, Travis McGee will travel almost anywhere, even New York City. Especially when there&rsquo;s a damsel in distress. &#160; &ldquo;As a young writer, all I ever wanted was to touch readers as powerfully as John D. MacDonald touched me.&rdquo;&mdash;Dean Koontz &#160; The damsel in question is his old friend&rsquo;s kid sister, whose fianc&eacute; has just been murdered in what the authorities claim was a standard Manhattan mugging. But Nina knows better. Her soon-to-be husband had been digging around, finding scum and scandal at his real estate investment firm. And this scum will go to any lengths to make sure their secrets don&rsquo;t get out. &#160; Travis is determined to get to the bottom of things, but just as he&rsquo;s closing in on the truth, he finds himself drugged and taken captive. If he&rsquo;s being locked up in a mental institution with a steady stream of drugs siphoned into his body, how can Travis keep his promise to his old friend? More important, how can he get himself out alive? &#160; Features a new Introduction by Lee Child",
        "rating": 2,
        "price": 16,
        "image": "//prodimage.images-bn.com/pimages/9780812983951_p0_v3_s600x595.jpg",
        "author": "John D. MacDonald",
        "thumbnails": [],
        "categoryId": "62ee7d0a4d3ca74e4a03fcb4"
    }
]