[
    {
        "name": "Twisted Love - Special Edition (Twisted Series #1)",
        "description": "\nHe has a heart of ice...but for her, he'd burn the world.Alex Volkov is a devil blessed with the face of an angel and cursed with a past he can't escape.Driven by a tragedy that has haunted him for most of his life, his ruthless pursuits for success and vengeance leave little room for matters of the heart.But when he's forced to look after his best friend's sister, he starts to feel something in his chest&#58;A crack.A melt.A fire that could end his world as he knew it.***Ava Chen is a free spirit trapped by nightmares of a childhood she can't remember.But despite her broken past, she's never stopped seeing the beauty in the world...including the heart beneath the icy exterior of a man she shouldn't want.Her brother's best friend.Her neighbor.Her savior and her downfall.Theirs is a love that was never supposed to happen-but when it does, it unleashes secrets that could destroy them both...and everything they hold dear.Twisted Love is a brother's best friend/opposites attract romance with a hint of suspense. It's book one in the Twisted series but can be read as a standalone.WARNING&#58; This book contains a jealous/possessive antihero, explicit sexual content, and profanity. Recommended for 18+.",
        "rating": 1,
        "price":"15.99",
        "image": "//prodimage.images-bn.com/pimages/9781087939278_p0_v1_s550x406.jpg"
    },
    {
        "name": "Where the Crawdads Sing",
        "description": "\nNOW A MAJOR MOTION PICTURE&mdash;The #1 New York Times bestselling worldwide sensation with more than 15 million copies sold, hailed by The New York Times Book Review as &ldquo;a painfully beautiful first novel that is at once a murder mystery, a coming-of-age narrative and a celebration of nature.&rdquo;For years, rumors of the &ldquo;Marsh Girl&rdquo; have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life&mdash;until the unthinkable happens.Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
        "rating": 5,
        "price":"18.00",
        "image": "//prodimage.images-bn.com/pimages/9780735219106_p0_v10_s550x406.jpg"
    },
    {
        "name": "Shutter",
        "description": "\nThis blood-chilling debut set in New Mexico&rsquo;s Navajo Nation is equal parts gripping crime thriller, supernatural horror, and poignant portrayal of coming of age on the reservation.Rita Todacheene is a forensic photographer working for the Albuquerque police force. Her excellent photography skills have cracked many cases&mdash;she is almost supernaturally good at capturing details. In fact, Rita has been hiding a secret&#58; she sees the ghosts of crime victims who point her toward the clues that other investigators overlook. As a lone portal back to the living for traumatized spirits, Rita is terrorized by nagging ghosts who won&rsquo;t let her sleep and who sabotage her personal life. Her taboo and psychologically harrowing ability was what drove her away from the Navajo reservation, where she was raised by her grandmother. It has isolated her from friends and gotten her in trouble with the law. And now it might be what gets her killed.When Rita is sent to photograph the scene of a supposed suicide on a highway overpass, the furious, discombobulated ghost of the victim&mdash;who insists she was murdered&mdash;latches onto Rita, forcing her on a quest for revenge against her killers, and Rita finds herself in the crosshairs of one of Albuquerque&rsquo;s most dangerous cartels. Written in sparkling, gruesome prose, Shutter is an explosive debut from one of crime fiction's most powerful new voices.",
        "rating": 3,
        "price":"25.95",
        "image": "//prodimage.images-bn.com/pimages/9781641293334_p0_v2_s550x406.jpg"
    },
    {
        "name": "The Heartbreak Bakery",
        "description": "\nTeenage baker Syd sends ripples of heartbreak through Austin&#8217;s queer community when a batch of post-being-dumped brownies turns out to be magical&#8212;and makes everyone who eats them break up.&#8220;What&#8217;s done is done.&#8221;Unless, of course, it was done by my brownies. Then it&#8217;s getting undone.Syd (no pronouns, please) has always dealt with big, hard-to-talk-about things by baking. Being dumped is no different, except now Syd is baking at the Proud Muffin, a queer bakery and community space in Austin. And everyone who eats Syd&#8217;s breakup brownies . . . breaks up. Even Vin and Alec, who own the Proud Muffin. And their breakup might take the bakery down with it. Being dumped is one thing; causing ripples of queer heartbreak through the community is another. But the cute bike delivery person, Harley (he or they, check the pronoun pin, it&#8217;s probably on the messenger bag), believes Syd about the magic baking. And Harley believes Syd&#8217;s magical baking can fix things, too&#8212;one recipe at a time.",
        "rating": 3,
        "price":"18.99",
        "image": "//prodimage.images-bn.com/pimages/9781536222371_p0_v1_s550x406.jpg"
    },
    {
        "name": "Finding Me",
        "description": "Narrated by Viola DavisIn my book, you will meet a little girl named Viola who ran from her past until she made a life-changing decision to stop running forever.This is my story, from a crumbling apartment in Central Falls, Rhode Island, to the stage in New York City, and beyond. This is the path I took to finding my purpose but also my voice in a world that didn't always see me.As I wrote Finding Me, my eyes were open to the truth of how our stories are often not given close examination. We are forced to reinvent them to fit into a crazy, competitive, judgmental world. So I wrote this for anyone running through life untethered, desperate and clawing their way through murky memories, trying to get to some form of self-love. For anyone who needs reminding that a life worth living can only be born from radical honesty and the courage to shed facades and be . . . you.Finding Me is a deep reflection, a promise, and a love letter of sorts to self. My hope is that my story will inspire you to light up your own life with creative expression and rediscover who you were before the world put a label on you.",
        "rating": 5,
        "price":"27.99",
        "image": "//prodimage.images-bn.com/pimages/2940176382365_p0_v4_s550x406.jpg"
    },
    {
        "name": "Fairy Tale",
        "description": "\nLegendary storyteller Stephen King goes into the deepest well of his imagination in this spellbinding novel about a seventeen-year-old boy who inherits the keys to a parallel world where good and evil are at war, and the stakes could not be higher&#8212;for that world or ours.<BR><BR>Charlie Reade looks like a regular high school kid, great at baseball and football, a decent student. But he carries a heavy load. His mom was killed in a hit-and-run accident when he was ten, and grief drove his dad to drink. Charlie learned how to take care of himself&#8212;and his dad. When Charlie is seventeen, he meets a dog named Radar and her aging master, Howard Bowditch, a recluse in a big house at the top of a big hill, with a locked shed in the backyard. Sometimes strange sounds emerge from it.<BR> <BR> Charlie starts doing jobs for Mr. Bowditch and loses his heart to Radar. Then, when Bowditch dies, he leaves Charlie a cassette tape telling a story no one would believe. What Bowditch knows, and has kept secret all his long life, is that inside the shed is a portal to another world.<BR> <BR> King&rsquo;s storytelling in Fairy Tale soars. This is a magnificent and terrifying tale in which good is pitted against overwhelming evil, and a heroic boy&#8212;and his dog&#8212;must lead the battle.<BR> <BR> Early in the Pandemic, King asked himself&#58; &ldquo;What could you write that would make you happy?&rdquo;<BR> <BR> &ldquo;As if my imagination had been waiting for the question to be asked, I saw a vast deserted city&#8212;deserted but alive. I saw the empty streets, the haunted buildings, a gargoyle head lying overturned in the street. I saw smashed statues (of what I didn&rsquo;t know, but I eventually found out). I saw a huge, sprawling palace with glass towers so high their tips pierced the clouds. Those images released the story I wanted to tell.&rdquo;",
        "rating": 2,
        "price":"32.50",
        "image": "//prodimage.images-bn.com/pimages/9781668002179_p0_v3_s550x406.jpg"
    },
    {
        "name": "Where the Crawdads Sing: A Novel",
        "description": "How long can you protect your heart?For years, rumors of the \"Marsh Girl\" have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life—until the unthinkable happens.Perfect for fans of Barbara Kingsolver and Karen Russell, Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
        "rating": 4,
        "price":"22.50",
        "image": "//prodimage.images-bn.com/pimages/2940172053900_p0_v3_s550x406.jpg"
    },
    {
        "name": "Babel: Or the Necessity of Violence: An Arcane History of the Oxford Translators' Revolution",
        "description": "\nFrom award-winning author R. F. Kuang comes&#160;Babel, a thematic response to&#160;The Secret History&#160;and a tonal retort to&#160;Jonathan Strange &#38; Mr. Norrell&#160;that grapples with student revolutions, colonial resistance, and the use of language and translation as the dominating tool of the British empire. Traduttore, traditore&#58; An act of translation is always an act of betrayal.1828. Robin Swift, orphaned by cholera in Canton, is brought to London by the mysterious Professor Lovell. There, he trains for years in Latin, Ancient Greek, and Chinese, all in preparation for the day he&#8217;ll enroll in Oxford University&#8217;s prestigious Royal Institute of Translation&#8212;also known as Babel.Babel is the world's center for translation and, more importantly, magic. Silver working&#8212;the art of manifesting the meaning lost in translation using enchanted silver bars&#8212;has made the British unparalleled in power, as its knowledge serves the Empire&#8217;s quest for colonization.For Robin, Oxford is a utopia dedicated to the pursuit of knowledge. But knowledge obeys power, and as a Chinese boy raised in Britain, Robin realizes serving Babel means betraying his motherland. As his studies progress, Robin finds himself caught between Babel and the shadowy Hermes Society, an organization dedicated to stopping imperial expansion. When Britain pursues an unjust war with China over silver and opium, Robin must decide&#8230;Can powerful institutions be changed from within, or does revolution always require violence?&#160;",
        "rating": 5,
        "price":"27.99",
        "image": "//prodimage.images-bn.com/pimages/9780063021426_p0_v6_s550x406.jpg"
    },
    {
        "name": "The Code Breaker: Jennifer Doudna, Gene Editing, and the Future of the Human Race",
        "description": "\nA Best Book of 2021 by Bloomberg BusinessWeek, Time, and The Washington Post<BR> <BR>The bestselling author of Leonardo da Vinci and Steve Jobs returns with a &ldquo;compelling&rdquo; (The Washington Post) account of how Nobel Prize winner Jennifer Doudna and her colleagues launched a revolution that will allow us to cure diseases, fend off viruses, and have healthier babies.<BR><BR>When Jennifer Doudna was in sixth grade, she came home one day to find that her dad had left a paperback titled The Double Helix on her bed. She put it aside, thinking it was one of those detective tales she loved. When she read it on a rainy Saturday, she discovered she was right, in a way. As she sped through the pages, she became enthralled by the intense drama behind the competition to discover the code of life. Even though her high school counselor told her girls didn&rsquo;t become scientists, she decided she would.<BR> <BR>Driven by a passion to understand how nature works and to turn discoveries into inventions, she would help to make what the book&rsquo;s author, James Watson, told her was the most important biological advance since his codiscovery of the structure of DNA. She and her collaborators turned a curiosity of nature into an invention that will transform the human race&#58; an easy-to-use tool that can edit DNA. Known as CRISPR, it opened a brave new world of medical miracles and moral questions.<BR> <BR>The development of CRISPR and the race to create vaccines for coronavirus will hasten our transition to the next great innovation revolution. The past half-century has been a digital age, based on the microchip, computer, and internet. Now we are entering a life-science revolution. Children who study digital coding will be joined by those who study genetic code.<BR> <BR>Should we use our new evolution-hacking powers to make us less susceptible to viruses? What a wonderful boon that would be! And what about preventing depression? Hmmm...Should we allow parents, if they can afford it, to enhance the height or muscles or IQ of their kids?<BR> <BR>After helping to discover CRISPR, Doudna became a leader in wrestling with these moral issues and, with her collaborator Emmanuelle Charpentier, won the Nobel Prize in 2020. Her story is an &ldquo;enthralling detective story&rdquo; (Oprah Daily) that involves the most profound wonders of nature, from the origins of life to the future of our species.",
        "rating": 5,
        "price":"20.99",
        "image": "//prodimage.images-bn.com/pimages/9781982115869_p0_v3_s550x406.jpg"
    },
    {
        "name": "The Daughter of Doctor Moreau",
        "description": "\nNEW YORK TIMES EDITORS&rsquo; CHOICE &bull; From the bestselling author of Mexican Gothic and Velvet Was the Night comes&#160;a lavish&#160;historical drama reimagining of The Island of Doctor Moreau set against the backdrop of nineteenth-century Mexico.&ldquo;This is historical science fiction at its best&#58; a dreamy reimagining of a classic story with vivid descriptions of lush jungles and feminist themes. Some light romance threads through the heavier ethical questions concerning humanity.&rdquo;&mdash;Library Journal (starred review)&ldquo;The imagination of Silvia Moreno-Garcia is a thing of wonder, restless and romantic, fearless in the face of genre, embracing the polarities of storytelling&mdash;the sleek and the bizarre, wild passions and deep hatreds&mdash;with cool equanimity.&rdquo;&mdash;The New York TimesCarlota Moreau&#58; A young woman growing up on a distant and luxuriant estate, safe from the conflict and strife of the Yucat&aacute;n peninsula. The only daughter of a researcher who is either a genius or a madman.Montgomery Laughton&#58; A melancholic overseer with a tragic past and a propensity for alcohol. An outcast who assists Dr. Moreau with his experiments, which are financed by the Lizaldes, owners of magnificent haciendas and plentiful coffers.The hybrids&#58; The fruits of the doctor&rsquo;s labor, destined to blindly obey their creator and remain in the shadows. A motley group of part human, part animal monstrosities.All of them live in a perfectly balanced and static world, which is jolted by the abrupt arrival of Eduardo Lizalde, the charming and careless son of Dr. Moreau&rsquo;s patron, who will unwittingly begin a dangerous chain reaction.For Moreau keeps secrets, Carlota has questions, and, in the sweltering heat of the jungle, passions may ignite.The Daughter of Doctor Moreau is both a dazzling historical novel and a daring science fiction journey.",
        "rating": 5,
        "price":"28.00",
        "image": "//prodimage.images-bn.com/pimages/9780593355336_p0_v1_s550x406.jpg"
    },
    {
        "name": "The Rise and Fall of the Dinosaurs: A New History of Their Lost World",
        "description": "\n\"THE ULTIMATE DINOSAUR BIOGRAPHY,\"&#160;hails Scientific American&#58; A thrilling new history of the age of dinosaurs, from one of our finest young scientists. \"A masterpiece of science writing.\" &#8212;Washington PostA New York Times&#160;Bestseller &#8226;&#160;Goodreads Choice Awards&#160;Winner &#8226;&#160;A BEST BOOK OF THE YEAR&#58;&#160;Smithsonian, Science Friday,&#160;The Times (London), Popular Mechanics,&#160;Science News\"This is scientific storytelling at its most visceral, striding with the beasts through their Triassic dawn, Jurassic dominance, and abrupt demise in the Cretaceous.\" &#8212;NatureThe dinosaurs. Sixty-six million years ago, the Earth&#8217;s most fearsome creatures vanished. Today they remain one of our planet&#8217;s great mysteries. Now The Rise and Fall of the Dinosaurs reveals their extraordinary, 200-million-year-long story as never before.In this captivating narrative (enlivened with more than seventy original illustrations and photographs),&#160;Steve Brusatte, a young American paleontologist who has emerged as one of the foremost stars of the field&#8212;naming fifteen new species and leading groundbreaking scientific studies and fieldwork&#8212;masterfully tells the complete, surprising, and new history of the dinosaurs, drawing on cutting-edge science to dramatically bring to life their lost world and illuminate their enigmatic origins, spectacular flourishing, astonishing diversity, cataclysmic extinction, and startling living legacy. Captivating and revelatory, The Rise and Fall of the Dinosaurs is a book for the ages.Brusatte traces the evolution of dinosaurs from their inauspicious start as small shadow dwellers&#8212;themselves the beneficiaries of a mass extinction caused by volcanic eruptions at the beginning of the Triassic period&#8212;into the dominant array of species every wide-eyed child memorizes today, T. rex, Triceratops, Brontosaurus, and more. This gifted scientist and writer re-creates the dinosaurs&#8217; peak during the Jurassic and Cretaceous, when thousands of species thrived, and winged and feathered dinosaurs, the prehistoric ancestors of modern birds, emerged. The story continues to the end of the Cretaceous period, when a giant asteroid or comet struck the planet and nearly every dinosaur species (but not all) died out, in the most extraordinary extinction event in earth&#8217;s history, one full of lessons for today as we confront a &#8220;sixth extinction.&#8221;Brusatte also recalls compelling stories from his globe-trotting expeditions during one of the most exciting eras in dinosaur research&#8212;which he calls &#8220;a new golden age of discovery&#8221;&#8212;and offers thrilling accounts of some of the remarkable findings he and his colleagues have made, including primitive human-sized tyrannosaurs; monstrous carnivores even larger than T. rex; and paradigm-shifting feathered raptors from China.An electrifying scientific history that unearths the dinosaurs&#8217; epic saga, The Rise and Fall of the Dinosaurs will be a definitive and treasured account for decades to come.Includes 75 images, world maps of the prehistoric earth, and a dinosaur family tree.",
        "rating": 4,
        "price":"18.99",
        "image": "//prodimage.images-bn.com/pimages/9780062490438_p0_v2_s550x406.jpg"
    },
    {
        "name": "Lapvona: A Novel",
        "description": "\nAn Instant New York Times Bestseller!&ldquo;Lapvona flips all the conventions of familial and parental relations, putting hatred where love should be or a negotiation where grief should be . . . Through a mix of witchery, deception, murder, abuse, grand delusion, ludicrous conversations, and cringeworthy moments of bodily disgust, Moshfegh creates a world that you definitely don&rsquo;t want to live in, but from which you can&rsquo;t look away.&rdquo; &mdash;The AtlanticIn a village in a medieval fiefdom buffeted by natural disasters, a motherless shepherd boy finds himself the unlikely pivot of a power struggle that puts all manner of faith to a savage test, in a spellbinding novel that represents Ottessa Moshfegh&rsquo;s most exciting leap yetLittle Marek, the abused and delusional son of the village shepherd, never knew his mother; his father told him she died in childbirth. One of life&rsquo;s few consolations for Marek is his enduring bond with the blind village midwife, Ina, who suckled him when he was a baby, as she did so many of the village&rsquo;s children. Ina&rsquo;s gifts extend beyond childcare&#58; she possesses a unique ability to communicate with the natural world. Her gift often brings her the transmission of sacred knowledge on levels far beyond those available to other villagers, however religious they might be. For some people, Ina&rsquo;s home in the woods outside of the village is a place to fear and to avoid, a godless place.&#160;&#160;Among their number is Father Barnabas, the town priest and lackey for the depraved lord and governor, Villiam, whose hilltop manor contains a secret embarrassment of riches. The people&rsquo;s desperate need to believe that there are powers that be who have their best interests at heart is put to a cruel test by Villiam and the priest, especially in this year of record drought and famine.&#160;But when fate brings Marek into violent proximity to the lord&rsquo;s family, new and occult forces upset the old order. By year&rsquo;s end, the veil between blindness and sight, life and death, the natural world and the spirit world, will prove to be very thin indeed.",
        "rating": 1,
        "price":"27.00",
        "image": "//prodimage.images-bn.com/pimages/9780593300268_p0_v3_s550x406.jpg"
    },
    {
        "name": "The Lost Apothecary: A Novel",
        "description": "\nINSTANT NEW YORK TIMES BESTSELLERNamed Most Anticipated of 2021 by Newsweek, Good Housekeeping, Hello! magazine, Oprah.com, Bustle, Popsugar, Betches, Sweet July, and GoodReads!March 2021 Indie Next Pick and #1 LibraryReads Pick&ldquo;A bold, edgy, accomplished debut!&rdquo; &mdash;Kate Quinn, New York Times bestselling author of The Alice NetworkA forgotten history. A secret network of women. A legacy of poison and revenge. Welcome to The Lost Apothecary&hellip;Hidden in the depths of eighteenth-century London, a secret apothecary shop caters to an unusual kind of clientele. Women across the city whisper of a mysterious figure named Nella who sells well-disguised poisons to use against the oppressive men in their lives. But the apothecary&rsquo;s fate is jeopardized when her newest patron, a precocious twelve-year-old, makes a fatal mistake, sparking a string of consequences that echo through the centuries.Meanwhile in present-day London, aspiring historian Caroline Parcewell spends her tenth wedding anniversary alone, running from her own demons. When she stumbles upon a clue to the unsolved apothecary murders that haunted London two hundred years ago, her life collides with the apothecary&rsquo;s in a stunning twist of fate&mdash;and not everyone will survive.With crackling suspense, unforgettable characters and searing insight, The Lost Apothecary is a subversive and intoxicating debut novel of secrets, vengeance and the remarkable ways women can save each other despite the barrier of time.",
        "rating": 4,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9780778311973_p0_v12_s550x406.jpg"
    },
    {
        "name": "Long Live the Pumpkin Queen: Tim Burton's The Nightmare Before Christmas (B&N Exclusive Edition)",
        "description": "\nThe Barnes & Noble Exclusive Edition features a unique jacket and a customized case. Exclusive bonus content includes Sally's collection of secret recipes, potions, and apothecary cures.Jack and Sally are \"truly meant to be\"...or are they?Sally Skellington is the official, newly-minted Pumpkin Queen after a whirlwind courtship with her true love, Jack, who Sally adores with every inch of her fabric seams&mdash;if only she could say the same for her new role as Queen of Halloween Town. Cast into the spotlight and tasked with all sorts of queenly duties, Sally can't help but wonder if all she's done is trade her captivity under Dr. Finkelstein for a different&mdash;albeit gilded&mdash;cage. But when Sally and Zero accidentally uncover a long-hidden doorway to an ancient realm called Dream Town in the forest Hinterlands, she'll unknowingly set into motion a chain of sinister events that put her future as Pumpkin Queen, and the future of Halloween Town itself, into jeopardy. Can Sally discover what it means to be true to herself and save the town she's learned to call home, or will her future turn into her worst...well, nightmare?\n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"Product_Tabs_loading_start\");\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10391,Starts-->\n<!-- Code Change For ATG-10391,Ends-->\n<!-- Code Change For ATG-10237,Ends-->\n\n\nRelated collections and offers\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nThe Nightmare Before Christmas Collection\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBarnes &amp; Noble Exclusives\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBookseller Favorites\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nOur Most Anticipated YA Book Releases This August\n\n\n\n\n\n\n\nProduct Details\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\nAbout the Author\n\n\n\n\n\n\n\nProduct Details\n\n\n<!-- changes start for ATG-9471 -->\n\nISBN-13:\n<!-- changes End for ATG-9471 -->\n9781368084383\n\n\nPublisher:\n\nDisney Press\n\n\n Publication date:\n08/02/2022\n\nEdition description:\nB&N Exclusive Edition\n\n Pages:\n352\n\nSales rank:\n1\n\nProduct dimensions:\n 5.40(w) x 8.40(h) x 1.20(d)\n\nAge Range:\n12 - 18 Years\n\n\n\n\n\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n\nAbout the Author\n\n<!-- ATG-10370 : Adding header after empty check for image-->\n<!-- ATG-10370 : Adding header after empty check for content and image-->\n\n\nSHEA ERNSHAW is a <I>New York Times bestselling author and winner of the Oregon Book Award. Her books have been published in over twelve countries/languages, and her novels <I>The Wicked Deep and <I>Winterwood were Indie Next Picks. Her debut adult fiction novel A History of Wild Places will release in December of 2021.\n<!-- ATG-10370 : Adding header after empty check for image, content and authorbiocommentary -->\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Product_Tabs_loading_end\");\nperformance.measure(\n\"productTabsDur\",\n\"Product_Tabs_loading_start\",\n\"Product_Tabs_loading_end\"\n);\n}\n\n<!-- Gigya Changes -->\n<!-- Gigya Changes -->\n\nCustomer Reviews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<!-- Internal Component Tracking - Begin -->\n<!-- Internal Component Tracking - End -->\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"BloomReach_Widget_loading_starts\");\n\n\n<!-- Related Searches -->\n\n\n\n\nsection data-modifyslick class=\"book bloomReachRelatedSearch\">\n\nRelated Searches\n\n\n\n\n\n\n\nMaximum Ride Series\n\n\n\n\n\n\n\nSusan Kaye Quinn\n\n\n\n\n\n\n\nMagiFreez Holiday Hipster\n\n\n\n\n\n\n\nYummy Cookie PJs\n\n\n\n\n\n\n\nElf Pets®: A Saint Bernard Tradition\n\n\n\n\n\n\n\nThe Elf on the Shelf® - Girl Light\n\n\n\n\n\n\n\n\n\n<!-- Explore More Items -->\n\n\n\n\nsection data-modifyslick class=\"mb-5 book bloomReachExploreItems\">\n\nExplore More Items\n\n\n\n\n\n\n\n\nMAX (Maximum Ride Series #5)\n\n<B>James Patterson's bestselling Maximum Ride series is back . . . and Max and her flock are ready for their most daring rescue mission yet.Someone &#151; or some<I>thing &#151; is decimating ships and sea \n\nSee Details\n\n\n\n\n\n\n\n\n\nMaximum Ride Forever (Maximum Ride Series #9)\n\n<B>Navigate a post-apocalyptic world and experience a thrilling finale with the ultimate <I>Maximum Ride novel.Discover the ninth and ultimate Maximum Ride story! Legions of Max fans won't be disappointed\n\nSee Details\n\n\n\n\n\n\n\n\n\nNevermore (Maximum Ride Series #8)\n\n<P>Maximum Ride and her faithful friends stand ready to face the two greatest threats that humankind has ever known&#151;now combining forces in an unbeatable plot to destroy life as we know it once and \n\nSee Details\n\n\n\n\n\n\n\n\n\nFANG (Maximum Ride Series #6)\n\nAngel says that Fang will be the first to die, and Angel is never wrong. Maximum Ride is used to living desperately on the run from evil forces sabotaging her quest to save the world&#151;but nothing \n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Final Warning (Maximum Ride Series #4)\n\n<B>\"Three cheers! Max is one of the smartest, strongest, funniest heroines around.\" - Diane Garrett, Diane's BooksIn this breathtaking new story from the astonishing imagination of James Patterson, a\n\nSee Details\n\n\n\n\n\n\n\n\n\nCross (Alex Cross Series #12)\n\n<B>Alex Cross was a rising star in the Washington, DC, Police Department when an unknown shooter gunned down his wife, Maria, in front of him. Alex's need for vengeance was placed on hold as he faced\n\nSee Details\n\n\n\n\n\n\n\n\n\nAgainst Medical Advice: One Family's Struggle with an Agonizing Medical Mystery\n\nCory Friedman woke up one morning when he was five years old with the uncontrollable urge to twitch his neck. From that day forward his life became a hell of irrepressible tics and involuntary\n\nSee Details\n\n\n\n\n\n\n\n\n\nNow You See Her\n\n<B>From bestselling team James Patterson and Michael Ledwidge, Nina Bloom must confront the killer she thought she escaped forever to save the life of an innocent man. <B>The perfect lifeA successful\n\nSee Details\n\n\n\n\n\n\n\n\n\nSaving the World and Other Extreme Sports (Maximum Ride Series #3)\n\nIn MAXIMUM RIDE&#58; SAVING THE WORLD AND OTHER EXTREME SPORTS, the time has arrived for Max and her winged \"Flock\" to face their ultimate enemy and discover their original purpose&#58; to defeat the \n\nSee Details\n\n\n\n\n\n\n\n\n\nAngel (Maximum Ride Series #7)\n\n<B>Max Ride and her best friends are up against a deadly force, but Fang is gone just when they need him most. Will they be ready for the ultimate showdown? Max Ride and her best friends have always had \n\nSee Details\n\n\n\n\n\n\n\n\n\nSchool's Out - Forever (Maximum Ride Series #2)\n\nIn this eagerly awaited follow-up, brave bird-kid Max and her flock are discovered by an FBI agent and forced to go to \"school.\" There is no such thing as an ordinary day as Max deciphers how and\n\nSee Details\n\n\n\n\n\n\n\n\n\nSam's Letters to Jennifer\n\n<B>Discover two extraordinary romantic stories about the power of a life-changing love letter.<B>Have you ever gotten a letter that changed your life completely? <I>Sam's Letters to Jennifer is a novel about\n\nSee Details\n\n\n\n\n\n\n\n\n\nSundays at Tiffany's\n\n<B>The successful but lonely daughter of a powerful New York theater icon falls for her childhood imaginary friend in this touching love story.As a little girl, Jane has no one. Her mother, a powerful\n\nSee Details\n\n\n\n\n\n\n\n\n\n10th Anniversary (Women's Murder Club Series #10)\n\n<B>Secrets. Lies. Murder. In this pulse-pounding Women's Murder Club novel, mysteries and lives unravel.Detective Lindsay Boxer's long-awaited wedding celebration becomes a distant memory when she is\n\nSee Details\n\n\n\n\n\n\n\n\n\nRun for Your Life (Michael Bennett Series #2)\n\nA calculating killer who calls himself The Teacher is taking on New York City, killing the powerful and the arrogant. His message is clear&#58; remember your manners or suffer the consequences! For\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_starts\");\n}\n\n\n<!-- ATG-26331 remove google analytics-->\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_ends\");\nperformance.measure(\n\"globalFooterDur\",\n\"Global_Footer_loading_starts\",\n\"Global_Footer_loading_ends\"\n);\n}\n\n<!-- ATG-26338 : Add modal for PDP, PLP -->\n<!-- ATG-26338 : Ends -->\nvar isresponsive= true;\n<!-- All Javascripts in js-scripts-ra.jsp has to be minified. ALl JS has to be moved to release dir as per grunt minification -->\n\n$.webshims.setOptions('basePath','//js.js-bn.com/static/redesign/srcs/js/vendor/js-webshim-1.15/minified/shims/');\n$.webshims.polyfill('es5 forms forms-ext');\n\n\nscript defer async type=\"text/javascript\" src=\"https://request.eprotect.vantivcnp.com/eProtect/eProtect-api3.js\">\n\n\nif(!$.isEmptyObject(digitalData)){\nvar digitalData1 = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Dark fantasy->Teen fiction\",\"Media Spin-Offs->Teen fiction\"],\"productType\":\"book\"},\"price\":{\"basePrice\":14.99},\"productInfo\":{\"departmentCode\":\"6\",\"sku\":\"9781368084383\",\"productName\":\"Long Live the Pumpkin Queen: Tim Burton's The Nightmare Before Christmas (B&N Exclusive Edition)\",\"productID\":\"prd9781368084383\",\"productURL\":\"/w/long-live-the-pumpkin-queen-shea-ernshaw/1139906449?ean=9781368084383\"},\"attributes\":{\"outOfStock\":false,\"reviews\":0,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":0,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"1C8ADC09E657CE7536181F20F6CDBB91\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Tue Aug 02 20:32:03 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:long-live-the-pumpkin-queen-tim-burtons-the-nightmare-before-christmas-bn-exclusive-edition|1139906449\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"41.43.237.103\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59044910331\"}}]}]};\n$.extend(digitalData,digitalData1);\n}else{\n\nvar digitalData = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Dark fantasy->Teen fiction\",\"Media Spin-Offs->Teen fiction\"],\"productType\":\"book\"},\"price\":{\"basePrice\":14.99},\"productInfo\":{\"departmentCode\":\"6\",\"sku\":\"9781368084383\",\"productName\":\"Long Live the Pumpkin Queen: Tim Burton's The Nightmare Before Christmas (B&N Exclusive Edition)\",\"productID\":\"prd9781368084383\",\"productURL\":\"/w/long-live-the-pumpkin-queen-shea-ernshaw/1139906449?ean=9781368084383\"},\"attributes\":{\"outOfStock\":false,\"reviews\":0,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":0,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"1C8ADC09E657CE7536181F20F6CDBB91\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Tue Aug 02 20:32:03 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:long-live-the-pumpkin-queen-tim-burtons-the-nightmare-before-christmas-bn-exclusive-edition|1139906449\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"41.43.237.103\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59044910331\"}}]}]};\n\n}\nif (typeof s_setP !== 'undefined') {\ns_setP('digitalData.component[0].componentInfo.componentName','you may also like');\ns_setP('digitalData.component[0].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[0].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[1].componentInfo.componentName','more in this series');\ns_setP('digitalData.component[1].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[1].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[2].componentInfo.componentName','recently-viewed');\ns_setP('digitalData.component[2].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[2].componentInfo.primaryCategory','internal campaign');\n\n}\n$(document).ready(function(){\nif (typeof s_setP !== 'undefined') {\n\nBN.Analytics.PDP.init();\n\nBN.Analytics.Generic.GoogleAds();\n\n}\n});\n\n\n\n\n\nvar cname = \"internalCampaign\",\ncvalue = null;\nvar curCookie = cname + \"=\" + cvalue +\n\"; expires= Thu, 01 Jan 1970 00:00:01 GMT;\" +\n\"; path=\" + \"/\" +\n\"; domain=\" + SITE_DOMAIN;\ndocument.cookie = curCookie;\n\n\n\n\n\n\n\n\n\nvar bopisEligibiltyMessage = $('#bopisEligibleMessage').val();\nvar storeName = $('#storeName').val();\nvar storeID = $('#storeID').val();\nif(typeof s_setP !== 'undefined') {\nif(s_getP('digitalData.user[0].profile[0].profileInfo.storeName') == undefined){\ns_setP('digitalData.user[0].profile[0].profileInfo.storeName', storeName);\ns_setP('digitalData.user[0].profile[0].profileInfo.storeID', storeID);\n}\nif(bopisEligibiltyMessage == 'productAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available:geo or store selected');\n}\nelse if((bopisEligibiltyMessage == 'productNotAvailable') || (bopisEligibiltyMessage == 'notEligibleForBopis')){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup unavailable:geo or store selected');\n}\nelse if(bopisEligibiltyMessage == 'storeNotAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available: geo or store unselected');\n}\n}\n\n\n/*Check id google ad needs to be loaded after page load*/\n\nvar asyncRelatedAdsEnabled = true;\nvar endemicAd = true;\n$(document).on('googleRelatedAdsLoaded', function() {\n\n})\n\n\n\n\n\n\n\n\n_satellite.pageBottom();\n\ndocument.write(\"<\\/script>\");\n/*CommerceHeaderFooter is the name of the library that we defined in webpack.config.js */\nCommerceHeaderFooter.showFooter('footer', {env:'prod', consumer_host:'https://www.barnesandnoble.com', styling:'responsive'});\n\n\n\n\n\n",
        "rating": 1,
        "price":"18.99",
        "image": "//prodimage.images-bn.com/pimages/9781368084383_p0_v4_s550x406.jpg"
    },
    {
        "name": "Verity",
        "description": "\n<B><I>New York Times<B>&#160;Bestseller<B><I>USA Today&#160;Bestseller<I>The Globe and Mail&#160;Bestseller<I>Publishers Weekly&#160;Bestseller<I>Whose truth is the lie?&#160;Stay up all night reading&#160;the sensational psychological thriller that has readers obsessed, from the #1&#160;<I>New York Times&#160;bestselling author of&#160;<I>It Ends With Us.Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.&#160;Lowen arrives at the Crawford home, ready to sort through years of Verity&rsquo;s notes and outlines, hoping to find enough material to get her started. What Lowen doesn&rsquo;t expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity&#39;s recollection of the night her family was forever altered.&#160;Lowen decides to keep the manuscript hidden from Jeremy, knowing its contents could devastate the already grieving father. But as Lowen&rsquo;s feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife&rsquo;s words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue loving her.",
        "rating": 5,
        "price":"16.99",
        "image": "//prodimage.images-bn.com/pimages/9781538724736_p0_v4_s550x406.jpg"
    },
    {
        "name": "Sparring Partners",
        "description": "#1 NEW YORK TIMES BESTSELLER ¿ John Grisham is the acknowledged master of the legal thriller. In his first collection of novellas, law is a common thread, but America's favorite storyteller has several surprises in store. “Homecoming” takes us back to Ford County, the fictional setting of many of John Grisham's unforgettable stories. Jake Brigance is back, but he's not in the courtroom. He's called upon to help an old friend, Mack Stafford, a former lawyer in Clanton, who three years earlier became a local legend when he stole money from his clients, divorced his wife, filed for bankruptcy, and left his family in the middle of the night, never to be heard from again-until now. Now Mack is back, and he's leaning on his old pals, Jake and Harry Rex, to help him return. His homecoming does not go as planned.In “Strawberry Moon,” we meet Cody Wallace, a young death row inmate only three hours away from execution. His lawyers can't save him, the courts slam the door, and the governor says no to a last-minute request for clemency. As the clock winds down, Cody has one final request. The “Sparring Partners” are the Malloy brothers, Kirk and Rusty, two successful young lawyers who inherited a once prosperous firm when its founder, their father, was sent to prison. Kirk and Rusty loathe each other, and speak to each other only when necessary. As the firm disintegrates, the resulting fiasco falls into the lap of Diantha Bradshaw, the only person the partners trust. Can she save the Malloys, or does she take a stand for the first time in her career and try to save herself?By turns suspenseful, hilarious, powerful, and moving, these are three of the greatest stories John Grisham has ever told.",
        "rating": 2,
        "price":"25.00",
        "image": "//prodimage.images-bn.com/pimages/2940178474105_p0_v3_s550x406.jpg"
    },
    {
        "name": "Grave Reservations: A Novel",
        "description": "A psychic travel agent and a Seattle PD detective try to solve a murder in this “ebullient tap dance of a mystery” (Christopher Moore, New York Times bestselling author)-perfect for fans of Lisa Lutz's The Spellman Files and Elle Cosimano's Finlay Donovan series.Meet Leda Foley: devoted friend, struggling travel agent, and inconsistent psychic. Impulsively re-booking Seattle PD detective Grady Merritt's flight, she has no idea that her life is about to change in ways she could have never foretold. When his original plane blows up on the runway, Grady begins to suspect that Leda's special abilities could help him with a cold case he just can't crack. Despite her scattershot premonitions, she agrees to join the investigation for a secret reason: her fiancé's murder remains unsolved. Leda's psychic abilities couldn't help that sad case, but she's been honing her skills and drawing a crowd at her favorite bar's open-mic nights, where she performs her klairvoyant karaoke-singing whatever song comes to mind when she holds people's personal effects. Now joined by a ragtag group of bar patrons and pals, Leda and Grady set out to catch a killer-and learn how the two cases that haunt them have more in common than they ever suspected.",
        "rating": 5,
        "price":"19.99",
        "image": "//prodimage.images-bn.com/pimages/2940176986723_p0_v2_s550x406.jpg"
    },
    {
        "name": "The Splendid and the Vile: A Saga of Churchill, Family, and Defiance During the Blitz",
        "description": "\n#1&#160;NEW YORK TIMES&#160;BESTSELLER &bull; The author of&#160;The Devil in the White City&#160;and&#160;Dead Wake&#160;delivers an&#160;intimate chronicle&#160;of Winston Churchill and London during the Blitz&mdash;an inspiring portrait of courage and leadership in a time of unprecedented crisis &#160; &ldquo;One of [Erik Larson&rsquo;s] best books yet . . . perfectly timed for the moment.&rdquo;&mdash;Time&#160;&bull;&#160;&ldquo;A bravura performance by one of America&rsquo;s greatest storytellers.&rdquo;&mdash;NPR&#160;&#160; NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The New York Times Book Review &bull; Time &bull; Vogue &bull; NPR &bull;&#160;The Washington Post &bull; Chicago Tribune &bull; The Globe & Mail&#160;&bull; Fortune &bull; Bloomberg&#160;&bull; New York Post&#160;&bull;&#160;The New York Public Library &bull; Kirkus Reviews&#160;&bull; LibraryReads &bull; PopMattersOn Winston Churchill&rsquo;s first day as prime minister, Adolf Hitler invaded Holland and Belgium. Poland and Czechoslovakia had already fallen, and the Dunkirk evacuation was just two weeks away. For the next twelve months, Hitler would wage a relentless bombing campaign, killing 45,000 Britons. It was up to Churchill to hold his country together and persuade President Franklin Roosevelt that Britain was a worthy ally&mdash;and willing to fight to the end. In The Splendid and the Vile, Erik Larson shows, in cinematic detail, how Churchill taught the British people &ldquo;the art of being fearless.&rdquo; It is a story of political brinkmanship, but it&rsquo;s also an intimate domestic drama, set against the backdrop of Churchill&rsquo;s prime-ministerial country home, Chequers; his wartime retreat, Ditchley, where he and his entourage go when the moon is brightest and the bombing threat is highest; and of course 10 Downing Street in London. Drawing on diaries, original archival documents, and once-secret intelligence reports&mdash;some released only recently&mdash;Larson provides a new lens on London&rsquo;s darkest year through the day-to-day experience of Churchill and his family&#58; his wife, Clementine; their youngest daughter, Mary, who chafes against her parents&rsquo; wartime protectiveness; their son, Randolph, and his beautiful, unhappy wife, Pamela; Pamela&rsquo;s illicit lover, a dashing American emissary; and the advisers in Churchill&rsquo;s &ldquo;Secret Circle,&rdquo; to whom he turns in the hardest moments.&#160;The Splendid and the Vile&#160;takes readers out of today&rsquo;s political dysfunction and back to a time of true leadership, when, in the face of unrelenting horror, Churchill&rsquo;s eloquence, courage, and perseverance bound a country, and a family, together.",
        "rating": 3,
        "price":"20.00",
        "image": "//prodimage.images-bn.com/pimages/9780385348737_p0_v1_s550x406.jpg"
    },
    {
        "name": "The Book of Gothel",
        "description": "\n<B>This dark, lush, and beautiful reimagining of the story of Rapunzel presents the witch&rsquo;s perspective in this tale of motherhood, magic, and the stories we pass down to our children.<I>&quot;Smart, swift, sure-footed and fleet-winged, The Book of Gothel launches its magic from a most reliable source&#58; the troubled heart. Mary McMyne is a magician.&quot;&mdash;Gregory Maguire, NYT bestselling author of&#160;WickedEveryone knows the tale of Rapunzel in her tower, but do you know the story of the witch who put her there?&#160;Haelewise has always lived under the shadow of her mother, Hedda&mdash;a woman who will do anything to keep her daughter protected. For with her strange black eyes and even stranger fainting spells, Haelewise is shunned by her village, and her only solace lies in the stories her mother tells of child'stealing witches, of princes in wolf-skins, of an ancient tower cloaked in mist, where women will find shelter if they are brave enough to seek it.&#160;Then, Hedda dies, and Haelewise is left unmoored. With nothing left for her in her village, she sets out to find the legendary tower her mother used to speak of&mdash;a place called Gothel, where Haelewise meets a wise woman willing to take her under her wing.&#160;But Haelewise is not the only woman to seek refuge at Gothel. It&rsquo;s also a haven for a girl named Rika, who carries with her a secret the Church strives to keep hidden. A secret that reveals a dark world of ancient spells and murderous nobles behind the world Haelewise has always known...&#160;<B>Told from her own perspective, <I>The Book of Gothel is a lush, historical retelling filled with dark magic, crumbling towers, mysterious woods, and evil princes. This is the truth they never wanted you to know, as only a witch might tell it.",
        "rating": 3,
        "price":"28.00",
        "image": "//prodimage.images-bn.com/pimages/9780316393119_p0_v3_s550x406.jpg"
    },
    {
        "name": "Triple Cross",
        "description": "\n<B>Detective Alex Cross hunts down a serial killer who targets entire families&mdash;and who will next be coming for the Crosses.&emsp; &#160; A precise killer, he always moves under the cover of darkness, flawlessly triggering no alarms, leaving no physical evidence.&#160;&#160; &#160; Cross and Sampson aren&rsquo;t the only ones investigating.&#160;&#160; &#160; Also in on this most intriguing case is the world&rsquo;s bestselling true-crime author, who sees patterns everyone else misses. &#160; The writer, Thomas Tull, calls the Family Man murders the perfect crime story. He believes the killer may never be caught.&#160;&#160; &#160; Cross knows there <I>is no perfect crime. And he&rsquo;s going to hunt down the Family Man no matter what it takes.&#160;&#160; &#160; Until the Family Man decides to flip the narrative and bring down Cross and his family.&#160;",
        "rating": 5,
        "price":"29.00",
        "image": "//prodimage.images-bn.com/pimages/9780316499187_p0_v3_s550x406.jpg"
    },
    {
        "name": "It Starts with Us: A Novel",
        "description": "\nBefore It Ends with Us, it started with Atlas. Colleen Hoover tells fan favorite Atlas&rsquo;s side of the story and shares what comes next in this long-anticipated sequel to the &ldquo;glorious and touching&rdquo; (USA TODAY) #1 New York Times bestseller It Ends with Us.<BR><BR>Lily and her ex-husband, Ryle, have just settled into a civil coparenting rhythm when she suddenly bumps into her first love, Atlas, again. After nearly two years separated, she is elated that for once, time is on their side, and she immediately says yes when Atlas asks her on a date.<BR> <BR>But her excitement is quickly hampered by the knowledge that, though they are no longer married, Ryle is still very much a part of her life&#8212;and Atlas Corrigan is the one man he will hate being in his ex-wife and daughter&rsquo;s life.<BR> <BR>Switching between the perspectives of Lily and Atlas, It Starts with Us picks up right where the epilogue for the &ldquo;gripping, pulse-pounding&rdquo; (Sarah Pekkanen, author of Perfect Neighbors) bestselling phenomenon It Ends with Us left off. Revealing more about Atlas&rsquo;s past and following Lily as she embraces a second chance at true love while navigating a jealous ex-husband, it proves that &ldquo;no one delivers an emotional read like Colleen Hoover&rdquo; (Anna Todd, New York Times bestselling author).",
        "rating": 2,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9781668001226_p0_v3_s550x406.jpg"
    },
    {
        "name": "56 Days",
        "description": "\nA New York Times Best Thriller of 2021A Washington Post Best Thriller of 2021A New York Public Library Best Book of the Year An Amazon Editors&#8217; Pick ''Bloody good.'' &#8212;The New York Times''Timely, surprising, emotionally alive, this is about as good as suspense fiction gets.'' &#8212;Washington PostNo one even knew they were together. Now one of them is dead.56 DAYS AGOCiara and Oliver meet in a supermarket queue in Dublin and start dating the same week COVID-19 reaches Irish shores.35 DAYS AGOWhen lockdown threatens to keep them apart, Oliver suggests they move in together. Ciara sees a unique opportunity for a relationship to flourish without the scrutiny of family and friends. Oliver sees a chance to hide who&#8212;and what&#8212;he really is.TODAYDetectives arrive at Oliver&#8217;s apartment to discover a decomposing body inside.Can they determine what really happened, or has lockdown created an opportunity for someone to commit the perfect crime?",
        "rating": 1,
        "price":"15.99",
        "image": "//prodimage.images-bn.com/pimages/9798200834389_p0_v3_s550x406.jpg"
    },
    {
        "name": "Book Lovers",
        "description": "“One of my favorite authors.”-Colleen HooverAn insightful, delightful, instant #1 New York Times bestseller from the author of Beach Read and People We Meet on Vacation. Named a Most Anticipated Book of 2022 by Oprah Daily ¿ Today ¿ Parade ¿ Marie Claire ¿ Bustle ¿ PopSugar ¿ Katie Couric Media ¿ Book Bub ¿ SheReads ¿ Medium ¿ The Washington Post ¿ and more!One summer. Two rivals. A plot twist they didn't see coming... Nora Stephens' life is books-she's read them all-and she is not that type of heroine. Not the plucky one, not the laidback dream girl, and especially not the sweetheart. In fact, the only people Nora is a heroine for are her clients, for whom she lands enormous deals as a cutthroat literary agent, and her beloved little sister Libby. Which is why she agrees to go to Sunshine Falls, North Carolina for the month of August when Libby begs her for a sisters' trip away-with visions of a small town transformation for Nora, who she's convinced needs to become the heroine in her own story. But instead of picnics in meadows, or run-ins with a handsome country doctor or bulging-forearmed bartender, Nora keeps bumping into Charlie Lastra, a bookish brooding editor from back in the city. It would be a meet-cute if not for the fact that they've met many times and it's never been cute. If Nora knows she's not an ideal heroine, Charlie knows he's nobody's hero, but as they are thrown together again and again-in a series of coincidences no editor worth their salt would allow-what they discover might just unravel the carefully crafted stories they've written about themselves.",
        "rating": 1,
        "price":"22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176169102_p0_v3_s550x406.jpg"
    },
    {
        "name": "Black Sun",
        "description": "\nFrom the New York Times bestselling author of Star Wars&#58; Resistance Reborn comes the &ldquo;engrossing and vibrant&rdquo; (Tochi Onyebuchi, author of Riot Baby) first book in the Between Earth and Sky trilogy inspired by the civilizations of the Pre-Columbian Americas and woven into a tale of celestial prophecies, political intrigue, and forbidden magic.<BR><BR>A god will return<BR> When the earth and sky converge<BR> Under the black sun<BR> <BR>In the holy city of Tova, the winter solstice is usually a time for celebration and renewal, but this year it coincides with a solar eclipse, a rare celestial even proscribed by the Sun Priest as an unbalancing of the world.<BR> <BR>Meanwhile, a ship launches from a distant city bound for Tova and set to arrive on the solstice. The captain of the ship, Xiala, is a disgraced Teek whose song can calm the waters around her as easily as it can warp a man&rsquo;s mind. Her ship carries one passenger. Described as harmless, the passenger, Serapio is a young man, blind, scarred, and cloaked in destiny. As Xiala well knows, when a man is described as harmless, he usually ends up being a villain.<BR> <BR>Crafted with unforgettable characters, Rebecca Roanhorse has created a &ldquo;brilliant world that shows the full panoply of human grace and depravity&rdquo; (Ken Liu, award-winning author of The Grace of Kings). This epic adventure explores the decadence of power amidst the weight of history and the struggle of individuals swimming against the confines of society and their broken pasts in this &ldquo;absolutely tremendous&rdquo; (S.A. Chakraborty, nationally bestselling author of The City of Brass) and most original series debut of the decade.",
        "rating": 4,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9781534437685_p0_v4_s550x406.jpg"
    },
    {
        "name": "The 6:20 Man",
        "description": "<B>A cryptic murder pulls a former soldier turned financial analyst deep into the corruption and menace that prowl beneath the opulent world of finance, in #1 New York Times bestselling author David Baldacci's new thriller.<BR /><BR />Every day without fail, Travis Devine puts on a cheap suit, grabs his faux-leather briefcase, and boards the 6:20 commuter train to Manhattan, where he works as an entry-level analyst at the city's most prestigious investment firm. In the mornings, he gazes out the train window at the lavish homes of the uberwealthy, dreaming about joining their ranks. In the evenings, he listens to the fiscal news on his phone, already preparing for the next grueling day in the cutthroat realm of finance. Then one morning Devine's tedious routine is shattered by an anonymous email: She is dead. <BR /><BR />Sara Ewes, Devine's coworker and former girlfriend, has been found hanging in a storage room of his office building-presumably a suicide, at least for now-prompting the NYPD to come calling on him. If that wasn't enough, before the day is out, Devine receives another ominous visit, a confrontation that threatens to dredge up grim secrets from his past in the army unless he participates in a clandestine investigation into his firm. This treacherous role will take him from the impossibly glittering lives he once saw only through a train window, to the darkest corners of the country's economic halls of power . . . where something rotten lurks. And apart from this high-stakes conspiracy, there's a killer out there with their own agenda, and Devine is the bull's-eye.",
        "rating": 3,
        "price":"26.98",
        "image": "//prodimage.images-bn.com/pimages/2940176072808_p0_v4_s550x406.jpg"
    },
    {
        "name": "Treasure State: A Cassie Dewell Novel",
        "description": "\n#1 New York Times bestselling author C. J. Box's Treasure State finds Cassie Dewell in Montana on the trail of a con man.Private Investigator Cassie Dewell&#8217;s business is thriving, and her latest case puts her on the hunt for a slippery con man who&#8217;s disappeared somewhere in the &#8220;treasure state&#8221;. A wealthy Florida widow has accused him of absconding with her fortune, and wants Cassie to find him and get it back. The trail takes Cassie to Anaconda, Montana, a quirky former copper mining town that&#8217;s the perfect place to reinvent yourself. As the case develops, Cassie begins to wonder if her client is telling her everything.On top of that, Cassie is also working what's easily one of her strangest assignments ever. A poem that promises buried treasure to one lucky adventurer has led to a cutthroat competition and five deaths among treasure-hunters. But Cassie&#8217;s client doesn&#8217;t want the treasure. Instead, he claims to be the one who hid the gold and wrote the poem. And he&#8217;s hired Cassie to try to find him. Between the two cases, Cassie has her hands full.In Montana, a killer view can mean more than just the scenery, and Cassie knows much darker things hide behind the picturesque landscape of Big Sky Country. Treasure State, C. J. Box's highly anticipated follow-up to The Bitterroots, is full of more twists and turns than the switchbacks through the Anaconda Range.",
        "rating": 5,
        "price":"28.99",
        "image": "//prodimage.images-bn.com/pimages/9781250766960_p0_v3_s550x406.jpg"
    },
    {
        "name": "Ugly Love",
        "description": "\nFrom Colleen Hoover, the #1 New York Times bestselling author of It Ends with Us, a heart-wrenching love story that proves attraction at first sight can be messy. <BR><BR>When Tate Collins meets airline pilot Miles Archer, she doesn't think it's love at first sight. They wouldn&rsquo;t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn&rsquo;t want love, she doesn&rsquo;t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her.<BR> <BR>Never ask about the past. <BR> Don&rsquo;t expect a future.<BR> <BR>They think they can handle it, but realize almost immediately they can&rsquo;t handle it at all.<BR> <BR>Hearts get infiltrated. <BR> Promises get broken. <BR> Rules get shattered.<BR> Love gets ugly.",
        "rating": 3,
        "price":"16.99",
        "image": "//prodimage.images-bn.com/pimages/9781476753188_p0_v9_s550x406.jpg"
    },
    {
        "name": "Dreamland",
        "description": "\nFrom the #1 New York Times bestselling author of The Wish comes a poignant love story about risking everything for a dream&mdash;and whether it&rsquo;s possible to leave the past behind.&#160;Colby Mills once felt destined for a musical career, until tragedy grounded his aspirations. Now the head of a small family farm in North Carolina, he spontaneously takes a gig playing at a bar in St. Pete Beach, Florida, seeking a rare break from his duties at home.&#160;But when he meets Morgan Lee, his world is turned upside-down, making him wonder if the responsibilities he has shouldered need dictate his life forever. The daughter of affluent Chicago doctors, Morgan has graduated from a prestigious college music program with the ambition to move to Nashville and become a star. Romantically and musically, she and Colby complete each other in a way that neither has ever known.&#160;While they are falling headlong in love, Beverly is on a heart-pounding journey of another kind. Fleeing an abusive husband with her six-year-old son, she is trying to piece together a life for them in a small town far off the beaten track. With money running out and danger seemingly around every corner, she makes a desperate decision that will rewrite everything she knows to be true.&#160;In the course of a single unforgettable week, two young people will navigate the exhilarating heights and heartbreak of first love. Hundreds of miles away, Beverly will put her love for her young son to the test. And fate will draw all three people together in a web of life-altering connections . . . forcing each to wonder whether the dream of a better life can ever survive the weight of the past.",
        "rating": 4,
        "price":"28.99",
        "image": "//prodimage.images-bn.com/pimages/9780593449554_p0_v5_s550x406.jpg"
    },
    {
        "name": "Pachinko",
        "description": "\n<B>A <I>New York Times Top Ten Book of the Year and National Book Award finalist, <I>Pachinko is an \"extraordinary epic\" of four generations of a poor Korean immigrant family as they fight to control their destiny in 20th-century Japan (<I>San Francisco Chronicle).<I> NEW YORK TIMES NOTABLE BOOK OF 2017 * A <I>USA TODAY TOP TEN OF 2017 * JULY PICK FOR THE <I>PBS NEWSHOUR-NEW YORK TIMES BOOK CLUB <I>NOW READ THIS * FINALIST FOR THE 2018DAYTON LITERARY PEACE PRIZE* WINNER OF THE MEDICI BOOK CLUB PRIZE Roxane Gay's Favorite Book of 2017, <I>Washington Post<I> NEW YORK TIMES BESTSELLER * #1 <I>BOSTON GLOBE BESTSELLER * <I>USA TODAY BESTSELLER * <I>WALL STREET JOURNAL BESTSELLER * <I>WASHINGTON POST BESTSELLER<I> \"There could only be a few winners, and a lot of losers. And yet we played on, because we had hope that we might be the lucky ones.\" In the early 1900s, teenaged Sunja, the adored daughter of a crippled fisherman, falls for a wealthy stranger at the seashore near her home in Korea. He promises her the world, but when she discovers she is pregnant&#151;and that her lover is married&#151;she refuses to be bought. Instead, she accepts an offer of marriage from a gentle, sickly minister passing through on his way to Japan. But her decision to abandon her home, and to reject her son's powerful father, sets off a dramatic saga that will echo down through the generations. Richly told and profoundly moving, Pachinko is a story of love, sacrifice, ambition, and loyalty. From bustling street markets to the halls of Japan's finest universities to the pachinko parlors of the criminal underworld, Lee's complex and passionate characters&#151;strong, stubborn women, devoted sisters and sons, fathers shaken by moral crisis&#151;survive and thrive against the indifferent arc of history.<I>*Includes reading group guide*",
        "rating": 1,
        "price":"18.99",
        "image": "//prodimage.images-bn.com/pimages/9781455563920_p0_v5_s550x406.jpg"
    },
    {
        "name": "Desperation in Death (In Death Series #55)",
        "description": "\nThe #1 New York Times bestselling author presents a gripping new thriller that pits homicide detective Eve Dallas against a conspiracy of exploitation and evil&#8230;New York, 2061&#58; The place called the Pleasure Academy is a living nightmare where abducted girls are trapped, trained for a life of abject service while their souls are slowly but surely destroyed. Dorian, a thirteen-year-old runaway who&#8217;d been imprisoned there, might never have made it out if not for her fellow inmate Mina, who&#8217;d hatched the escape plan. Mina was the more daring of the two&#8212;but they&#8217;d been equally desperate. Unfortunately, they didn&#8217;t get away fast enough. Now Dorian is injured, terrified, and wandering the streets of New York, and Mina lies dead near the waterfront while Lt. Eve Dallas looks over the scene.Mina&#8217;s expensive, elegant clothes and beauty products convince Dallas that she was being groomed, literally and figuratively, for sex trafficking&#8212;and that whoever is investing in this high-overhead operation expects windfall profits. Her billionaire husband, Roarke, may be able to help, considering his ties to the city&#8217;s ultra-rich. But Roarke is also worried about the effect this case is having on Dallas, as it brings a rage to the surface she can barely control. No matter what, she must keep her head clear&#151;because above all, she is desperate for justice and to take down those who prey on and torment the innocent.",
        "rating": 3,
        "price":"28.99",
        "image": "//prodimage.images-bn.com/pimages/9781250278234_p0_v3_s550x406.jpg"
    },
    {
        "name": "Suspect",
        "description": "\n<B>The #1 <I><B>New York Times<B> bestselling author of <I><B>Presumed Innocent<B> and <I><B>The Last Trial<B> returns with a riveting legal thriller in which a reckless private detective is embroiled in a fraught police scandal.For as long as Lucia Gomez has been the police chief in the city of Highland Isle, near Kindle County, she has known that any woman in law enforcement must walk a precarious line between authority and camaraderie to gain respect.&#160; She has maintained a spotless reputation&mdash;until now. Three male police officers have accused her of soliciting sex in exchange for promotions to higher ranks. With few people left who she can trust, Chief Gomez turns to an old friend, Rik Dudek, to act as her attorney in the federal grand jury investigation, insisting to Rik that the accusations against her are part of an ugly smear campaign designed to destroy her career and empower her enemies&mdash;both outside the police force and within..&#160;Clarice &ldquo;Pinky&rdquo; Granum spent most of her youth experimenting with an impressive array of drugs and failing out of various professions, including the police academy. Pinky knows that in the eyes of most people, she&#39;s nothing but a screwup&mdash;but she doesn&#39;t trust most people&#39;s opinions anyway. Moreover, she finally has a respectable-enough job as a licensed P.I. working for Rik on his roster of mostly minor cases, like workman&#39;s comp, DUIs and bar fights. Rik&#39;s shabby office and even shabbier cases are a far cry from the kinds of high-profile criminal matters Pinky became familiar with in the law office of her grandfather, Sandy Stern. But Rik and Pinky feel that Chief Gomez&rsquo;s case, which has attracted national attention, is their chance to break into the legal big leagues. &#160;&#160;&#160;&#160;Guided by her gut instinct and razor-sharp investigative skills, Pinky dives headfirst into a twisted scandal that will draw her into the deepest recesses of the city&rsquo;s criminal networks, as well as the human mind. But she will need every scrap of tenacity and courage to unravel the dark secrets those closest to her are determined to keep hidden.",
        "rating": 1,
        "price":"29.00",
        "image": "//prodimage.images-bn.com/pimages/9781538706329_p0_v3_s550x406.jpg"
    },
    {
        "name": "Reminders of Him",
        "description": "\nA troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover.After serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter&#8217;s life is determined to shut Kenna out, no matter how hard she works to prove herself.The only person who hasn&#8217;t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna&#8217;s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna&#8217;s life, both would risk&#160;losing the trust of everyone important to them.The two form a connection despite the&#160;pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing.",
        "rating": 2,
        "price":"15.95",
        "image": "//prodimage.images-bn.com/pimages/9781542025607_p0_v1_s550x406.jpg"
    },
    {
        "name": "The Measure: A Novel",
        "description": "INSTANT NEW YORK TIMES BESTSELLER - The Read With Jenna Today Show Book Club Pick!\"A story of love and hope as interweaving characters display: how all moments, big and small, can measure a life. If you want joy, love, romance, and hope-read with us.\" -Jenna Bush Hager A luminous, spirit-lifting blockbuster for readers of The Midnight Library. Eight ordinary people. One extraordinary choice.It seems like any other day. You wake up, pour a cup of coffee, and head out.But today, when you open your front door, waiting for you is a small wooden box. This box holds your fate inside: the answer to the exact number of years you will live.From suburban doorsteps to desert tents, every person on every continent receives the same box. In an instant, the world is thrust into a collective frenzy. Where did these boxes come from? What do they mean? Is there truth to what they promise?As society comes together and pulls apart, everyone faces the same shocking choice: Do they wish to know how long they'll live? And, if so, what will they do with that knowledge?The Measure charts the dawn of this new world through an unforgettable cast of characters whose decisions and fates interweave with one another: best friends whose dreams are forever entwined, pen pals finding refuge in the unknown, a couple who thought they didn't have to rush, a doctor who cannot save himself, and a politician whose box becomes the powder keg that ultimately changes everything.Enchanting and deeply uplifting, The Measure is a sweeping, ambitious, and invigorating story about family, friendship, hope, and destiny that encourages us to live life to the fullest.",
        "rating": 1,
        "price":"27.99",
        "image": "//prodimage.images-bn.com/pimages/2940176288032_p0_v2_s550x406.jpg"
    },
    {
        "name": "The Boys from Biloxi: A Legal Thriller",
        "description": "\n#1 New York Times bestselling author John Grisham returns to Mississippi in his most gripping legal thriller yet, the riveting story of two sons of immigrant families who grow up as friends, but ultimately find themselves on opposite sides of the law. Grisham&rsquo;s trademark twists and turns will keep you tearing through the pages until the stunning conclusion.For most of the last hundred years, Biloxi was known for its beaches, resorts, and seafood industry. But it had a darker side. It was also notorious for corruption and vice, everything from gambling, prostitution, bootleg liquor, and drugs to contract killings. The vice was controlled by small cabal of mobsters, many of them rumored to be members of the Dixie Mafia. &#160; Keith Rudy and Hugh Malco grew up in Biloxi in the sixties and were childhood friends, as well as Little League all-stars. But as teenagers, their lives took them in different directions. Keith&rsquo;s father became a legendary prosecutor, determined to &ldquo;clean up the Coast.&rdquo; Hugh&rsquo;s father became the &ldquo;Boss&rdquo; of Biloxi&rsquo;s criminal underground. Keith went to law school and followed in his father&rsquo;s footsteps. Hugh preferred the nightlife and worked in his father&rsquo;s clubs. The two families were headed for a showdown, one that would happen in a courtroom. &#160;Life itself hangs in the balance&#160;in The Boys from Biloxi, a sweeping saga rich with history and with a large cast of unforgettable characters.",
        "rating": 3,
        "price":"29.95",
        "image": "//prodimage.images-bn.com/pimages/9780385548922_p0_v3_s550x406.jpg"
    },
    {
        "name": "A World of Curiosities",
        "description": "\nChief Inspector Armand Gamache returns in the eighteenth book in #1 New York Times bestseller Louise Penny's beloved series.It&#8217;s spring and Three Pines is reemerging after the harsh winter. But not everything buried should come alive again. Not everything lying dormant should reemerge. But something has.As the villagers prepare for a special celebration, Armand Gamache and Jean-Guy Beauvoir find themselves increasingly worried. A young man and woman have reappeared in the S&#251;ret&#233; du Qu&#233;bec investigators&#8217; lives after many years. The two were young children when their troubled mother was murdered, leaving them damaged, shattered. Now they&#8217;ve arrived in the village of Three Pines. But to what end?Gamache and Beauvoir&#8217;s memories of that tragic case, the one that first brought them together, come rushing back. Did their mother&#8217;s murder hurt them beyond repair? Have those terrible wounds, buried for decades, festered and are now about to erupt?As Chief Inspector Gamache works to uncover answers, his alarm grows when a letter written by a long dead stone mason is discovered. In it the man describes his terror when bricking up an attic room somewhere in the village. Every word of the 150-year-old letter is filled with dread. When the room is found, the villagers decide to open it up. As the bricks are removed, Gamache, Beauvoir and the villagers discover a world of curiosities. But the head of homicide soon realizes there&#8217;s more in that room than meets the eye. There are puzzles within puzzles, and hidden messages warning of mayhem and revenge. In unsealing that room, an old enemy is released into their world. Into their lives. And into the very heart of Armand Gamache&#8217;s home.",
        "rating": 2,
        "price":"28.99",
        "image": "//prodimage.images-bn.com/pimages/9781250145291_p0_v2_s550x406.jpg"
    },
    {
        "name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "description": "From Taylor Jenkins Reid, \"a genius when it comes to stories about life and love\" (Redbook), comes an unforgettable and sweeping novel about one classic film actress's relentless rise to the top—the risks she took, the loves she lost, and the long-held secrets the public could never imagine.Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one in the journalism community is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband, David, has left her, and her career has stagnated. Regardless of why Evelyn has chosen her to write her biography, Monique is determined to use this opportunity to jumpstart her career. Summoned to Evelyn's Upper East Side apartment, Monique listens as Evelyn unfurls her story: from making her way to Los Angeles in the 1950s to her decision to leave show business in the late 80s, and, of course, the seven husbands along the way. As Evelyn's life unfolds—revealing a ruthless ambition, an unexpected friendship, and a great forbidden love—Monique begins to feel a very a real connection to the actress. But as Evelyn's story catches up with the present, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways. Written with Reid's signature talent for \"creating complex, likable characters\" (Real Simple), this is a fascinating journey through the splendor of Old Hollywood into the harsh realities of the present day as two women struggle with what it means—and what it takes—to face the truth.",
        "rating": 4,
        "price":"23.99",
        "image": "//prodimage.images-bn.com/pimages/2940171293987_p0_v2_s550x406.jpg"
    },
    {
        "name": "Happy Dreamer (B&N Exclusive Edition)",
        "description": "\n<B> The beloved, worldwide bestselling creator of <I>The Dot and <I>I Am Human inspires readers of every age to find their own unique path to happy, and to always follow their dreams.<P><B> From the beloved, bestselling creator of <I>The Dot, <I>The Word Collector, and <I>I Am Human.Picture book and creativity guru Peter H. Reynolds's inspirational book is a wonderful gift for graduations, new babies, milestone moments, and any happy occasion throughout the year. Discover a universally poignant celebration of the colorful spectrum of what it means to <B>dream and the many ways to find <B>happy! <P>While the world tells us to sit still, to follow the rules, and to color inside the lines, <I>Happy Dreamer celebrates all those moments in between when the mind and spirit soar and we are free to become our own true <B>dreamer maximus! In Peter's signature voice and style, this empowering picture book reminds children of how much their dreams matter, and while life will have ups and downs, he enlists readers to stay true to who they are, to tap into their most creative inner selves, and to never ever forget to <B>dream big!",
        "rating": 4,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9781338844139_p0_v1_s550x406.jpg"
    },
    {
        "name": "The Terminal List (Terminal List Series #1)",
        "description": "\nA Navy SEAL has nothing left to live for and everything to kill for after he discovers that the American government is behind the deaths of his team in this ripped-from-the-headlines political thriller that is &ldquo;so powerful, so pulse-pounding, so well-written&#8212;rarely do you read a debut novel this damn good&rdquo; (Brad Thor, #1 New York Times bestselling author).<BR><BR>On his last combat deployment, Lieutenant Commander James Reece&rsquo;s entire team was killed in a catastrophic ambush. But when those dearest to him are murdered on the day of his homecoming, Reece discovers that this was not an act of war by a foreign enemy but a conspiracy that runs to the highest levels of government.<BR> <BR>Now, with no family and free from the military&rsquo;s command structure, Reece applies the lessons that he&rsquo;s learned in over a decade of constant warfare toward avenging the deaths of his family and teammates. With breathless pacing and relentless suspense, Reece ruthlessly targets his enemies in the upper echelons of power without regard for the laws of combat or the rule of law.<BR> <BR>With &ldquo;crackerjack plotting, vivid characters both in and out of uniform, and a relentless pace to a worthy finish&rdquo; (Stephen Hunter, #1 New York Times bestselling author), The Terminal List is perfect for fans of Vince Flynn, Brad Thor, and Nelson DeMille.",
        "rating": 5,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9781982158118_p0_v8_s550x406.jpg"
    },
    {
        "name": "The Lost Metal (Mistborn Series #7)",
        "description": "\nReturn to #1 New York Times bestseller Brandon Sanderson&#8217;s Mistborn world of Scadrial as its second era, which began with The Alloy of Law, comes to its earth-shattering conclusion in The Lost Metal. For years, frontier lawman turned big-city senator Waxillium Ladrian has hunted the shadowy organization the Set&#8212;with his late uncle and his sister among their leaders&#8212;since they started kidnapping people with the power of Allomancy in their bloodlines. When Detective Marasi Colms and her partner Wayne find stockpiled weapons bound for the Outer City of Bilming, this opens a new lead. Conflict between Elendel and the Outer Cities only favors the Set, and their tendrils now reach to the Elendel Senate&#8212;whose corruption Wax and Steris have sought to expose&#8212;and Bilming is even more entangled.After Wax discovers a new type of explosive that can unleash unprecedented destruction and realizes that the Set must already have it, an immortal kandra serving Scadrial&#8217;s god, Harmony, reveals that Bilming has fallen under the influence of another god&#58; Trell, worshipped by the Set. And Trell isn&#8217;t the only factor at play from the larger Cosmere&#8212;Marasi is recruited by offworlders with strange abilities who claim their goal is to protect Scadrial...at any cost.Wax must choose whether to set aside his rocky relationship with God and once again become the Sword that Harmony has groomed him to be. If no one steps forward to be the hero Scadrial needs, the planet and its millions of people will come to a sudden and calamitous ruin.Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) OathbringerDawnshard (Novella)Rhythm of War The Mistborn trilogy Mistborn&#58; The Final Empire The Well of Ascension The Hero of Ages Mistborn&#58; The Wax and Wayne series Alloy of Law Shadows of Self Bands of MourningThe Lost Metal Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity",
        "rating": 2,
        "price":"29.99",
        "image": "//prodimage.images-bn.com/pimages/9780765391193_p0_v5_s550x406.jpg"
    },
    {
        "name": "The It Girl",
        "description": "<B>INSTANT <I>NEW YORK TIMES BESTSELLER The #1 New York Times bestselling author of the “claustrophobic spine-tingler” (People) One by One returns with an unputdownable mystery following a woman on the search for answers a decade after her friend's murder. April Clarke-Cliveden was the first person Hannah Jones met at Oxford. Vivacious, bright, occasionally vicious, and the ultimate It girl, she quickly pulled Hannah into her dazzling orbit. Together, they developed a group of devoted and inseparable friends-Will, Hugh, Ryan, and Emily-during their first term. By the end of the year, April was dead. Now, a decade later, Hannah and Will are expecting their first child, and the man convicted of killing April, former Oxford porter John Neville, has died in prison. Relieved to have finally put the past behind her, Hannah's world is rocked when a young journalist comes knocking and presents new evidence that Neville may have been innocent. As Hannah reconnects with old friends and delves deeper into the mystery of April's death, she realizes that the friends she thought she knew all have something to hide¿including a murder. “The Agatha Christie of our generation” (David Baldacci, #1 New York Times bestselling author) proves once again that she is “as ingenious and indefatigable as the Queen of Crime” (The Washington Post) with this propulsive murder mystery that will keep you on the edge of your seat.",
        "rating": 1,
        "price":"24.99",
        "image": "//prodimage.images-bn.com/pimages/2940176380576_p0_v3_s550x406.jpg"
    },
    {
        "name": "Greenlights",
        "description": "#1 NEW YORK TIMES BESTSELLER ¿ Discover the life-changing memoir that has inspired millions of readers through the Academy Award®-winning actor's unflinching honesty, unconventional wisdom, and lessons learned the hard way about living with greater satisfaction.NAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE GUARDIAN “McConaughey's book invites us to grapple with the lessons of his life as he did-and to see that the point was never to win, but to understand.”-Mark Manson, author of The Subtle Art of Not Giving a F*ckI've been in this life for fifty years, been trying to work out its riddle for forty-two, and been keeping diaries of clues to that riddle for the last thirty-five. Notes about successes and failures, joys and sorrows, things that made me marvel, and things that made me laugh out loud. How to be fair. How to have less stress. How to have fun. How to hurt people less. How to get hurt less. How to be a good man. How to have meaning in life. How to be more me. Recently, I worked up the courage to sit down with those diaries. I found stories I experienced, lessons I learned and forgot, poems, prayers, prescriptions, beliefs about what matters, some great photographs, and a whole bunch of bumper stickers. I found a reliable theme, an approach to living that gave me more satisfaction, at the time, and still: If you know how, and when, to deal with life's challenges-how to get relative with the inevitable-you can enjoy a state of success I call “catching greenlights.” So I took a one-way ticket to the desert and wrote this book: an album, a record, a story of my life so far. This is fifty years of my sights and seens, felts and figured-outs, cools and shamefuls. Graces, truths, and beauties of brutality. Getting away withs, getting caughts, and getting wets while trying to dance between the raindrops. Hopefully, it's medicine that tastes good, a couple of aspirin instead of the infirmary, a spaceship to Mars without needing your pilot's license, going to church without having to be born again, and laughing through the tears. It's a love letter. To life. It's also a guide to catching more greenlights-and to realizing that the yellows and reds eventually turn green too. Good luck.",
        "rating": 2,
        "price":"20.00",
        "image": "//prodimage.images-bn.com/pimages/2940176987478_p0_v1_s550x406.jpg"
    },
    {
        "name": "Einstein's Fridge: How the Difference Between Hot and Cold Explains the Universe",
        "description": "This entertaining, eye-opening account of how the laws of thermodynamics are essential to understanding the world today-from refrigeration and jet engines to calorie counting and global warming-is “a lesson in how to do popular science right” (Kirkus Reviews).Einstein's Fridge tells the incredible epic story of the scientists who, over two centuries, harnessed the power of heat and ice and formulated a theory essential to comprehending our universe. “Although thermodynamics has been studied for hundreds of years¿few nonscientists appreciate how its principles have shaped the modern world” (Scientific American). Thermodynamics-the branch of physics that deals with energy and entropy-governs everything from the behavior of living cells to the black hole at the center of our galaxy. Not only that, but thermodynamics explains why we must eat and breathe, how lights turn on, the limits of computing, and how the universe will end. The brilliant people who decoded its laws came from every branch of the sciences; they were engineers, physicists, chemists, biologists, cosmologists, and mathematicians. From French military engineer and physicist Sadi Carnot to Lord Kelvin, James Joule, Albert Einstein, Emmy Noether, Alan Turing, and Stephen Hawking, author Paul Sen introduces us to all of the players who passed the baton of scientific progress through time and across nations. Incredibly driven and idealistic, these brave pioneers performed groundbreaking work often in the face of torment and tragedy. Their discoveries helped create the modern world and transformed every branch of science, from biology to cosmology. “Elegantly written and engaging” (Financial Times), Einstein's Fridge brings to life one of the most important scientific revolutions of all time and captures the thrill of discovery and the power of scientific progress to shape the course of history.",
        "rating": 1,
        "price":"19.99",
        "image": "//prodimage.images-bn.com/pimages/2940177331201_p0_v1_s550x406.jpg"
    },
    {
        "name": "The Art of Prophecy: A Novel",
        "description": "\nA &ldquo;superb fantasy saga&rdquo; (Helene Wecker) of&#160;martial&#160;arts and magic, about what happens when a prophesied hero is not the chosen one after all&mdash;but has to work with a band of unlikely allies to save the kingdom anyway, from the #1 New York Times bestselling author&#160;of The Lives&#160;of&#160;Tao&#160;&ldquo;An ambitious and touching exploration of disillusionment in faith, tradition, and family&mdash;a glorious reinvention of fantasy and wuxia tropes.&rdquo;&mdash;Naomi Novik, New York Times bestselling author of A Deadly EducationSo many stories begin the same way&#58; With a prophecy. A chosen one. And the inevitable quest to slay a villain, save the kingdom, and fulfill a grand destiny. &#160;But this is not that kind of story.&#160;&#160;It does begin with a prophecy&#58; A child will rise to defeat the Eternal Khan, a cruel immortal god-king, and save the kingdom.&#160;&#160;And that prophecy did anoint a hero, Jian, raised since birth in luxury and splendor, and celebrated before he has won a single battle.&#160;&#160;But that&rsquo;s when the story hits its first twist&#58; The prophecy is wrong.&#160;&#160;What follows is a story more wondrous than any prophecy could foresee, and with many unexpected heroes&#58; Taishi, an older woman who is the greatest grandmaster of magical martial arts in the kingdom but who thought her adventuring days were all behind her; Sali, a straitlaced warrior who learns the rules may no longer apply when the leader to whom she pledged her life is gone; and Qisami, a chaotic assassin who takes a little too much pleasure in the kill.&#160;And Jian himself, who has to find a way to become what he no longer believes he can be&mdash;a hero after all.",
        "rating": 5,
        "price":"28.99",
        "image": "//prodimage.images-bn.com/pimages/9780593237632_p0_v2_s550x406.jpg"
    },
    {
        "name": "Into the Mist: A Novel",
        "description": "\nFrom #1 New York Times bestselling author P. C. Cast comes INTO THE MIST, the first book in a pulse-pounding dystopian duology for our times. Practical Magic meets Station Eleven in this gripping take on female power and the inevitable, destructive path of violent patriarchies.As men fall to the mist, the age of womankind begins to rise. The world as we know it ends when an attack on the U.S. unleashes bombs that deliver fire and biological destruction. Along with sonic detonations and devastating earthquakes, the bombs have also brought the green mist. If breathed in, it is deadly to all men&mdash;but alters the body chemistry of many women, imbuing them with superhuman abilities. A group of high school teachers heading home from a conference experiences firsthand the strength of these new powers. Mercury Rhodes is the Warrior, possessing heightened physical powers. Stella Carver is the Seer, with a sixth sense about the future. Imani Andrews is the Watcher, with a rare connection to the earth. Karen Gay is the Priestess, demonstrating a special connection with Spirits. And Gemma Jenkins is the Healer, a sixteen-year-old student who joins the group after losing her parents. As they cross the Pacific Northwest, trying to find a safe place to ride out the apocalypse, the women soon learn they can't trust anyone, and with fresh danger around every corner, it will take all their powers to save themselves&mdash;and possibly the world. With timely commentary on power and community, Into the Mist delivers a thrilling and fantastical future that is equal parts a feminist commentary and an amazing, witty adventure filled with wine and women&ndash; as only P.C. Cast&rsquo;s brilliant storytelling can bring to life.",
        "rating": 1,
        "price":"24.99",
        "image": "//prodimage.images-bn.com/pimages/9781643859187_p0_v2_s550x406.jpg"
    },
    {
        "name": "Verity (Collector's Edition)",
        "description": "\n<B>A gorgeous new collector&rsquo;s edition of Colleen Hoover&rsquo;s <I>Verity, featuring an embossed, gold foil cover, <B>a letter from the author,<B> and an exclusive new chapter.<B><I>New York Times<B> Bestseller<B><I>USA Today Bestseller<I>The Globe and Mail Bestseller<I>Publishers Weekly Bestseller<B><I>Whose truth is the lie?&#160;<B>Stay up all night reading&#160;the sensational psychological thriller that has readers obsessed, from the #1&#160;<I>New York Times&#160;bestselling author of&#160;<I>It Ends With Us.Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.&#160;Lowen arrives at the Crawford home, ready to sort through years of Verity&rsquo;s notes and outlines, hoping to find enough material to get her started. What Lowen doesn&rsquo;t expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity&#39;s recollection of the night her family was forever altered.&#160;Lowen decides to keep the manuscript hidden from Jeremy, knowing its contents could devastate the already grieving father. But as Lowen&rsquo;s feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife&rsquo;s words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue loving her.",
        "rating": 5,
        "price":"29.00",
        "image": "//prodimage.images-bn.com/pimages/9781538739723_p0_v2_s550x406.jpg"
    },
    {
        "name": "The City We Became",
        "description": "\n<B>Three-time Hugo Award-winning and <I>New York Times bestselling author N.K. Jemisin crafts her most incredible novel yet, a &quot;glorious&quot; story of culture, identity, magic, and myths in contemporary New York City.&#160;In Manhattan, a young grad student gets off the train and realizes he doesn&#39;t remember who he is, where he&#39;s from, or even his own name. But he can sense the beating heart of the city, see its history, and feel its power.&#160;In the Bronx, a Lenape gallery director discovers strange graffiti scattered throughout the city, so beautiful and powerful it&#39;s as if the paint is literally calling to her.&#160;In Brooklyn, a politician and mother finds she can hear the songs of her city, pulsing to the beat of her Louboutin heels.&#160;And they&#39;re not the only ones.&#160;<B>Every great city has a soul. Some are ancient as myths, and others are as new and destructive as children. New York? She&#39;s got six.For more from N. K. Jemisin, check out&#58;&#160;<B>The Inheritance Trilogy<I>The Hundred Thousand Kingdoms<I>The Broken Kingdoms<I>The Kingdom of Gods&#160;<I>The Inheritance Trilogy (omnibus edition)<I>Shades in Shadow&#58; An Inheritance Triptych (e-only short fiction)<I>The Awakened Kingdom (e-only novella)&#160;<B>Dreamblood Duology<I>The Killing Moon<I>The Shadowed Sun&#160;<I>The Dreamblood Duology (omnibus)&#160;<B>The Broken Earth<I>The Fifth Season<I>The Obelisk Gate<I>The Stone Sky&#160;<I>How Long &#39;til Black Future Month? (short story collection)<B>&quot;A glorious fantasy.&quot; &mdash;Neil Gaiman",
        "rating": 4,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9780316509886_p0_v3_s550x406.jpg"
    },
    {
        "name": "Lessons in Chemistry",
        "description": "NEW YORK TIMES BESTSELLER ¿ GOOD MORNING AMERICA BOOK CLUB PICK ¿ A must-read debut! Meet Elizabeth Zott: a one-of-a-kind scientist in 1960s California whose career takes a detour when she becomes the unlikely star of a beloved TV cooking show in this novel that is “irresistible, satisfying and full of fuel. It reminds you that change takes time and always requires heat” (The New York Times Book Review).“It's the world versus Elizabeth Zott, an extraordinary woman determined to live on her own terms, and I had no trouble choosing a side.... A page-turning and highly satisfying tale: zippy, zesty, and Zotty.” -Maggie Shipstead, best-selling author of Great Circle Chemist Elizabeth Zott is not your average woman. In fact, Elizabeth Zott would be the first to point out that there is no such thing as an average woman. But it's the early 1960s and her all-male team at Hastings Research Institute takes a very unscientific view of equality. Except for one: Calvin Evans; the lonely, brilliant, Nobel-prize nominated grudge-holder who falls in love with-of all things-her mind. True chemistry results. But like science, life is unpredictable. Which is why a few years later Elizabeth Zott finds herself not only a single mother, but the reluctant star of America's most beloved cooking show Supper at Six. Elizabeth's unusual approach to cooking (“combine one tablespoon acetic acid with a pinch of sodium chloride”) proves revolutionary. But as her following grows, not everyone is happy. Because as it turns out, Elizabeth Zott isn't just teaching women to cook. She's daring them to change the status quo.  Laugh-out-loud funny, shrewdly observant, and studded with a dazzling cast of supporting characters, Lessons in Chemistry is as original and vibrant as its protagonist.",
        "rating": 3,
        "price":"22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176164176_p0_v3_s550x406.jpg"
    },
    {
        "name": "Tomorrow, and Tomorrow, and Tomorrow",
        "description": "In this exhilarating novel by the best-selling author of The Storied Life of A. J. Fikry two friends-often in love, but never lovers-come together as creative partners in the world of video game design, where success brings them fame, joy, tragedy, duplicity, and, ultimately, a kind of immortality.On a bitter-cold day, in the December of his junior year at Harvard, Sam Masur exits a subway car and sees, amid the hordes of people waiting on the platform, Sadie Green. He calls her name. For a moment, she pretends she hasn't heard him, but then, she turns, and a game begins: a legendary collaboration that will launch them to stardom. They borrow money, beg favors, and, before even graduating college, they have created their first blockbuster, Ichigo: a game where players can escape the confines of a body and the betrayals of a heart, and where death means nothing more than a chance to restart and play again. This is the story of the perfect worlds Sam and Sadie build, the imperfect world they live in, and of everything that comes after success: Money. Fame. Duplicity. Tragedy. Spanning thirty years, from Cambridge, Massachusetts, to Venice Beach, California, and lands in between and far beyond, Gabrielle Zevin's Tomorrow, and Tomorrow, and Tomorrow is a dazzling and intricately imagined novel that examines the multifarious nature of identity, games as artform, technology and the human experience, disability, failure, the redemptive possibilities in play, and above all, our need to connect: to be loved and to love. Yes, it is a love story, but it is not one you have read before.Cover image: The Great Wave (detail) by Katsushika Hokusai. The Metropolitan Museum of Art, New York.",
        "rating": 5,
        "price":"22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176038163_p0_v4_s550x406.jpg"
    },
    {
        "name": "The Many Daughters of Afong Moy: A Novel",
        "description": "\nThe New York Times bestselling author of the &ldquo;mesmerizing and evocative&rdquo; (Sara Gruen, author of Water for Elephants) Hotel on the Corner of Bitter and Sweet returns with a powerful exploration of the love that binds one family across the generations. <BR><BR>Dorothy Moy breaks her own heart for a living. <BR> <BR>As Washington&rsquo;s former poet laureate, that&rsquo;s how she describes channeling her dissociative episodes and mental health struggles into her art. But when her five-year-old daughter exhibits similar behavior and begins remembering things from the lives of their ancestors, Dorothy believes the past has truly come to haunt her. Fearing that her child is predestined to endure the same debilitating depression that has marked her own life, Dorothy seeks radical help. <BR> <BR>Through an experimental treatment designed to mitigate inherited trauma, Dorothy intimately connects with past generations of women in her family&#58; Faye Moy, a nurse in China serving with the Flying Tigers; Zoe Moy, a student in England at a famous school with no rules; Lai King Moy, a girl quarantined in San Francisco during a plague epidemic; Greta Moy, a tech executive with a unique dating app; and Afong Moy, the first Chinese woman to set foot in America.<BR> <BR>As painful recollections affect her present life, Dorothy discovers that trauma isn&rsquo;t the only thing she&rsquo;s inherited. A stranger is searching for her in each time period. A stranger who&rsquo;s loved her through all of her genetic memories. Dorothy endeavors to break the cycle of pain and abandonment, to finally find peace for her daughter, and gain the love that has long been waiting, knowing she may pay the ultimate price.",
        "rating": 2,
        "price":"28.00",
        "image": "//prodimage.images-bn.com/pimages/9781982158217_p0_v2_s550x406.jpg"
    },
    {
        "name": "One by One",
        "description": "\nINSTANT NEW YORK TIMES BESTSELLER<BR> &ldquo;A claustrophobic spine-tingler.&rdquo; &#8212;People<BR> &ldquo;Not only do Ware&rsquo;s novels wink at [Agatha] Christie in a saucy way, but Ware herself is turning out to be as ingenious and indefatigable as the Queen of Crime.&rdquo; &#8212;The Washington Post<BR> <BR>The #1 New York Times bestselling author of The Turn of the Key and In a Dark, Dark Wood returns with another suspenseful thriller set on a snow-covered mountain.<BR><BR>Getting snowed in at a luxurious, rustic ski chalet high in the French Alps doesn&rsquo;t sound like the worst problem in the world. Especially when there&rsquo;s a breathtaking vista, a full-service chef and housekeeper, a cozy fire to keep you warm, and others to keep you company. Unless that company happens to be eight coworkers&hellip;each with something to gain, something to lose, and something to hide.<BR> <BR>When the cofounder of Snoop, a trendy London-based tech start-up, organizes a weeklong trip for the team in the French Alps, it starts out as a corporate retreat like any other&#58; PowerPoint presentations and strategy sessions broken up by mandatory bonding on the slopes. But as soon as one shareholder upends the agenda by pushing a lucrative but contentious buyout offer, tensions simmer and loyalties are tested. The storm brewing inside the chalet is no match for the one outside, however, and a devastating avalanche leaves the group cut off from all access to the outside world. Even worse, one Snooper hadn&rsquo;t made it back from the slopes when the avalanche hit.<BR> <BR>As each hour passes without any sign of rescue, panic mounts, the chalet grows colder, and the group dwindles further&hellip;one by one.",
        "rating": 2,
        "price":"16.99",
        "image": "//prodimage.images-bn.com/pimages/9781501188824_p0_v2_s550x406.jpg"
    },
    {
        "name": "It Ends with Us",
        "description": "\nIn this &ldquo;brave and heartbreaking novel that digs its claws into you and doesn&rsquo;t let go, long after you&rsquo;ve finished it&rdquo; (Anna Todd, New York Times bestselling author) from the #1 New York Times bestselling author of All Your Perfects, a workaholic with a too-good-to-be-true romance can&rsquo;t stop thinking about her first love.<BR><BR>Lily hasn&rsquo;t always had it easy, but that&rsquo;s never stopped her from working hard for the life she wants. She&rsquo;s come a long way from the small town where she grew up&#8212;she graduated from college, moved to Boston, and started her own business. And when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily&rsquo;s life seems too good to be true.<BR> <BR>Ryle is assertive, stubborn, maybe even a little arrogant. He&rsquo;s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn&rsquo;t hurt. Lily can&rsquo;t get him out of her head. But Ryle&rsquo;s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his &ldquo;no dating&rdquo; rule, she can&rsquo;t help but wonder what made him that way in the first place.<BR> <BR>As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan&#8212;her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.<BR> <BR>An honest, evocative, and tender novel, It Ends with Us is &ldquo;a glorious and touching read, a forever keeper. The kind of book that gets handed down&rdquo; (USA TODAY).",
        "rating": 1,
        "price":"16.99",
        "image": "//prodimage.images-bn.com/pimages/9781501110368_p0_v10_s550x406.jpg"
    },
    {
        "name": "A Broken Blade",
        "description": "\n<B>The BookTok sensation from debut author Melissa Blair&mdash;now with exclusive bonus content!&quot;Gripping and fierce. This is much-needed fantasy with its fangs honed sharp by the power of resistance. Melissa Blair has built a tremendous world.&quot; &mdash;Chloe Gong, #1&#160;<I>New York Times&#160;bestselling author of&#160;<I>These Violent Delights<B>My body is made of scars,<B>some were done to me,<B>but most I did to myself. &#160; Keera is a killer. As the King&#39;s Blade, she is the most talented spy in the kingdom. And the king&rsquo;s favored assassin. When a mysterious figure moves against the Crown, Keera is called upon to hunt down the so-called Shadow.&#160; &#160; She tracks her target into the magical lands of the Fae, but Faeland is not what it seems . . . and neither is the Shadow. Keera is shocked by what she learns, and can&#39;t help but wonder who her enemy truly is&#58; the King that destroyed her people or the Shadow that threatens the peace? &#160; As she searches for answers, Keera is haunted by a promise she made long ago, one that will test her in every way. To keep her word, Keera must not only save herself, but an entire kingdom. &#160;",
        "rating": 1,
        "price":"17.99",
        "image": "//prodimage.images-bn.com/pimages/9781454947875_p0_v1_s550x406.jpg"
    },
    {
        "name": "Midnight in the Garden of Good and Evil",
        "description": "\nNATIONAL BESTSELLER &bull;&#160;&ldquo;Elegant and wicked.... [This]&#160;might be the first true-crime book that makes the reader want to book a bed and breakfast for an extended weekend at the scene of the crime.\" &mdash;The New York Times Book ReviewShots rang out in Savannah's grandest mansion in the misty,early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters&#58; the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else. Midnight in the Garden of Good and Evil is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic.",
        "rating": 4,
        "price":"18.00",
        "image": "//prodimage.images-bn.com/pimages/9780679751526_p0_v2_s550x406.jpg"
    }
]