[
    {
        "name": "Ten Restaurants That Changed America",
        "description": "\nFinalist for the IACP Cookbook Award A Washington Post Notable Book of the Year A Smithsonian Best Food Book of the Year Longlisted for the Art of Eating Prize Featuring a new chapter on ten restaurants changing America today, a &#8220;fascinating . . . sweep through centuries of food culture&#8221; (Washington Post). Combining an historian&#8217;s rigor with a food enthusiast&#8217;s palate, Paul Freedman&#8217;s seminal and highly entertaining Ten Restaurants That Changed America reveals how the history of our restaurants reflects nothing less than the history of America itself. Whether charting the rise of our love affair with Chinese food through San Francisco&#8217;s fabled Mandarin; evoking the poignant nostalgia of Howard Johnson&#8217;s, the beloved roadside chain that foreshadowed the pandemic of McDonald&#8217;s; or chronicling the convivial lunchtime crowd at Schrafft&#8217;s, the first dining establishment to cater to women&#8217;s tastes, Freedman uses each restaurant to reveal a wider story of race and class, immigration and assimilation. &#8220;As much about the contradictions and contrasts in this country as it is about its places to eat&#8221; (The New Yorker), Ten Restaurants That Changed America is a &#8220;must-read&#8221; (Eater) that proves &#8220;essential for anyone who cares about where they go to dinner&#8221; (Wall Street Journal Magazine).",
        "rating": 5,
        "price": "$23.95",
        "image": "//prodimage.images-bn.com/pimages/9781631492464_p0_v5_s600x595.jpg",
        "author": "Paul  Freedman",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Book Lovers",
        "description": "“One of my favorite authors.”-Colleen HooverAn insightful, delightful, instant #1 New York Times bestseller from the author of Beach Read and People We Meet on Vacation. Named a Most Anticipated Book of 2022 by Oprah Daily ¿ Today ¿ Parade ¿ Marie Claire ¿ Bustle ¿ PopSugar ¿ Katie Couric Media ¿ Book Bub ¿ SheReads ¿ Medium ¿ The Washington Post ¿ and more!One summer. Two rivals. A plot twist they didn't see coming... Nora Stephens' life is books-she's read them all-and she is not that type of heroine. Not the plucky one, not the laidback dream girl, and especially not the sweetheart. In fact, the only people Nora is a heroine for are her clients, for whom she lands enormous deals as a cutthroat literary agent, and her beloved little sister Libby. Which is why she agrees to go to Sunshine Falls, North Carolina for the month of August when Libby begs her for a sisters' trip away-with visions of a small town transformation for Nora, who she's convinced needs to become the heroine in her own story. But instead of picnics in meadows, or run-ins with a handsome country doctor or bulging-forearmed bartender, Nora keeps bumping into Charlie Lastra, a bookish brooding editor from back in the city. It would be a meet-cute if not for the fact that they've met many times and it's never been cute. If Nora knows she's not an ideal heroine, Charlie knows he's nobody's hero, but as they are thrown together again and again-in a series of coincidences no editor worth their salt would allow-what they discover might just unravel the carefully crafted stories they've written about themselves.",
        "rating": 2,
        "price": "$22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176168440_p0_v3_s600x595.jpg",
        "author": "Emily Henry",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Inheritance Games (Inheritance Games Series #1)",
        "description": "\n<B>OVER 750,000 COPIES SOLD OF THE #1 BESTSELLING SERIES!Don&#39;t miss this <I>New York Times bestselling &quot;impossible to put down&quot; (Buzzfeed) novel with deadly stakes, thrilling twists, and juicy secrets&#151;perfect for fans of <I>One of Us is Lying and <I>Knives Out.Avery Grambs has a plan for a better future&#58; survive high school, win a scholarship, and get out. But her fortunes change in an instant when billionaire Tobias Hawthorne dies and leaves Avery virtually his entire fortune. The catch? Avery has no idea why &#151; or even who Tobias Hawthorne is.To receive her inheritance, Avery must move into sprawling, secret passage-filled Hawthorne House, where every room bears the old man&#39;s touch &#151; and his love of puzzles, riddles, and codes. Unfortunately for Avery, Hawthorne House is also occupied by the family that Tobias Hawthorne just dispossessed. This includes the four Hawthorne grandsons&#58; dangerous, magnetic, brilliant boys who grew up with every expectation that one day, they would inherit billions. Heir apparent Grayson Hawthorne is convinced that Avery must be a conwoman, and he&#39;s determined to take her down. His brother, Jameson, views her as their grandfather&#39;s last hurrah&#58; a twisted riddle, a puzzle to be solved. Caught in a world of wealth and privilege, with danger around every turn, Avery will have to play the game herself just to survive.** <I>Avery&#39;s story continues in&#160;The Hawthorne Legacy<I>&#160;and&#160;The Final Gambit",
        "rating": 4,
        "price": "$10.99",
        "image": "//prodimage.images-bn.com/pimages/9780759555402_p0_v2_s600x595.jpg",
        "author": "Jennifer Lynn Barnes",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9780759555402_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780759555402_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780759555402_p3_v5_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780759555402_p4_v6_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Where the Crawdads Sing: A Novel",
        "description": "How long can you protect your heart?For years, rumors of the \"Marsh Girl\" have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life—until the unthinkable happens.Perfect for fans of Barbara Kingsolver and Karen Russell, Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
        "rating": 4,
        "price": "$22.50",
        "image": "//prodimage.images-bn.com/pimages/2940169470185_p0_v3_s600x595.jpg",
        "author": "Delia Owens",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Twilight",
        "description": "\n<B>Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a \"literary phenomenon\" and redefined romance for a generation (<I>New York Times).Isabella Swan's move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella's life takes a thrilling and terrifying turn.Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife &#151; between desire and danger.Deeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite.<B>It's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, <I>Midnight Sun&#58; the iconic love story of Bella and Edward told from the vampire's point of view.<B>\"People do not want to just read Meyer's books; they want to climb inside them and live there.\" &#151; <I>Time<B><B>\"A literary phenomenon.\" &#151; <I>The New York Times",
        "rating": 4,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9780316327336_p0_v1_s600x595.jpg",
        "author": "Stephenie Meyer",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Summer Place",
        "description": "<B>INSTANT NEW YORK TIMES BESTELLER From the #1 New York Times bestselling author of That Summer comes another heartfelt and unputdownable novel of family, secrets, and the ties that bind. When her twenty-two-year-old stepdaughter announces her engagement to her pandemic boyfriend, Sarah Danhauser is shocked. But the wheels are in motion. Headstrong Ruby has already set a date (just three months away!) and spoken to her beloved safta, Sarah's mother Veronica, about having the wedding at the family's beach house in Cape Cod. Sarah might be worried, but Veronica is thrilled to be bringing the family together one last time before putting the big house on the market. But the road to a wedding day usually comes with a few bumps. Ruby has always known exactly what she wants, but as the wedding date approaches, she finds herself grappling with the wounds left by the mother who walked out when she was a baby. Veronica ends up facing unexpected news, thanks to her meddling sister, and must revisit the choices she made long ago, when she was a bestselling novelist with a different life. Sarah's twin brother, Sam, is recovering from a terrible loss, and confronting big questions about who he is-questions he hopes to resolve during his stay on the Cape. Sarah's husband, Eli, who's been inexplicably distant during the pandemic, confronts the consequences of a long ago lapse from his typical good-guy behavior. And Sarah, frustrated by her husband, concerned about her stepdaughter, and worn out by challenges of life during quarantine, faces the alluring reappearance of someone from her past and a life that could have been. When the wedding day arrives, lovers are revealed as their true selves, misunderstandings take on a life of their own, and secrets come to light. There are confrontations and revelations that will touch each member of the extended family, ensuring that nothing will ever be the same. From “the undisputed boss of the beach read” (The New York Times), The Summer Place is a testament to family in all its messy glory; a story about what we sacrifice and how we forgive. Enthralling, witty, big-hearted, and sharply observed, this is Jennifer Weiner's love letter to the Outer Cape and the power of home, the way our lives are enriched by the people we call family, and the endless ways love can surprise us.",
        "rating": 3,
        "price": "$24.99",
        "image": "//prodimage.images-bn.com/pimages/2940173218964_p0_v4_s600x595.jpg",
        "author": "Jennifer Weiner",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Practice of Adaptive Leadership: Tools and Tactics for Changing Your Organization and the World",
        "description": "When change requires you to challenge people's familiar reality, it can be difficult, dangerous work. Whatever the context-whether in the private or the public sector-many will feel threatened as you push though major changes. But as a leader, you need to find a way to make it work.Ron Heifetz first defined this problem with his distinctive theory of adaptive leadership in <I>Leadership Without Easy Answers. In a second book, <I>Leadership on the Line, Heifetz and coauthor Marty Linsky highlighted the individual and organizational dangers of leading through deep change in business, politics, and community life. Now, Heifetz, Linsky, and coauthor Alexander Grashow are taking the next step: <I>The Practice of Adaptive Leadership is a hands-on, practical guide containing stories, tools, and cases to help you develop your skills as an adaptive leader, able to take people outside their comfort zones and assess and address the toughest challenges.The authors have decades of experience helping people and organizations create cultures of adaptive leadership. In today's rapidly changing world, <I>The Practice of Adaptive Leadership can be your handbook to meeting the demands of leadership in the midst of complexity.",
        "rating": 4,
        "price": "$24.99",
        "image": "//prodimage.images-bn.com/pimages/2940176236880_p0_v1_s600x595.jpg",
        "author": "Ronald A. Heifetz",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "22 Seconds",
        "description": "<B>22 seconds... until Lindsay Boxer loses her badge-or her life.<BR /><BR />SFPD Sergeant Lindsay Boxer has guns on her mind.<BR /> <BR />There's buzz of a last-ditch shipment of drugs and weapons crossing the Mexican border ahead of new restrictive gun laws. Before Lindsay can act, her top informant tips her to a case that hits disturbingly close to home.<BR /> <BR />Former cops. Professional hits. All with the same warning scrawled on their bodies:<BR /> <BR /><I>You talk, you die.<BR /> <BR />Now it's Lindsay's turn to choose.<BR />",
        "rating": 5,
        "price": "$26.98",
        "image": "//prodimage.images-bn.com/pimages/2940176293746_p0_v3_s600x595.jpg",
        "author": "James Patterson",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "James Patterson by James Patterson: The Stories of My Life",
        "description": "<B>“It's quite a life, Patterson's, and this fizzing, funny, often deeply moving memoir is a perfect way to understand the dizzying world of a best-selling writer.\" -<I>Daily Mail <BR /><BR /> “Damn near addictive. I loved it . . . that Patterson guy can write!” -Ron Howard<BR /><BR /><B>THE INSTANT #1 <I>NEW YORK TIMES BESTSELLER-How did a kid whose dad lived in the poorhouse become the most successful storyteller in the world? On the morning he was born, he nearly died. Growing up, he didn't love to read.  That changed. He worked at a mental hospital in Massachusetts, where he met the singer James Taylor and the poet Robert Lowell.   While he toiled in advertising hell, James wrote the ad jingle line “I'm a Toys `R' Us Kid.” He once watched James Baldwin and Norman Mailer square off to trade punches at a party. He's only been in love twice.  Both times are amazing. Dolly Parton once sang “Happy Birthday” to James over the phone.  She calls him J.J., for Jimmy James.  Three American presidents have invited him to golf with them.  How did a boy from small-town New York become the world's most successful writer? How does he do it? He has always wanted to write the kind of novel that would be read and reread so many times that the binding breaks and the book literally falls apart. As he says, “I'm still working on that one.” <BR /><BR /><B><I>James Patterson by James Patterson<B> is the most anticipated memoir of 2022.",
        "rating": 5,
        "price": "$26.98",
        "image": "//prodimage.images-bn.com/pimages/2940176323207_p0_v4_s600x595.jpg",
        "author": "James Patterson",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Homewreckers",
        "description": "Summer begins with Mary Kay Andrews, in this delightful summer read about flipping houses, and finding true love.\"Narrator Kathleen McInerney exudes beach-read energy in this entertaining audiobook....Listeners will be swept up in the complicated plot and enjoy the entire wild ride.\" -AudioFile on The HomewreckersHattie Kavanaugh went to work restoring homes for Kavanaugh & Son Restorations at eighteen, married the boss's son at twenty, and became a widow at twenty-five. Now, she's passionate about her work, but that's the only passion in her life. “Never love something that can't love you back,” is advice her father-in-law gives her, but Hattie doesn't follow it and falls head-over-heels for a money pit of a house. She's determined to make it work, but disaster after disaster occurs, and Hattie's dream might cost Kavanaugh & Son their livelihood. Hattie needs money, and fast. When a slick Hollywood producer shows up in her hometown of Savannah, Georgia, she gets a once-in-a-lifetime opportunity: star in a beach house renovation reality show called The Homewreckers, cast against a male lead who may be a love interest, or may be the ultimate antagonist. Soon, there's more at stake than bad pipes and dry rot: during the demolition, evidence comes to light that points to the mysterious disappearance of a young wife and mother years before.With a burned out detective investigating the case, an arsonist on the loose, two men playing with her emotions, and layers upon layers of vintage wallpaper causing havoc, it's a question of who will flip, who will flop, and if Hattie will ever get her happily-ever-after.",
        "rating": 4,
        "price": "$32.99",
        "image": "//prodimage.images-bn.com/pimages/2940176378375_p0_v1_s600x595.jpg",
        "author": "Mary Kay Andrews",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Burning Bright: A Play in Story Form",
        "description": "The last of John Steinbeck's play-novelettes, Burning Bright was the author's final attempt after 1937's Of Mice and Men and 1942's The Moon is Down to create what he saw as a new, experimental literary form.  Four scenes, four people: the husband who yearns for a son, ignorant of his own sterility; the wife who commits adultery to fulfill her husband's wish; the father of the child; and the outsider whose actions will affect them all. In this turn on a medieval morality play, Nobel Prize winner John Steinbeck casts an unwavering light on these four intertwined lives, revealing in their finely drawn circumstances the universal contours of vulnerability and passion, desperation and desire. This edition features an introduction and notes for further reading by Steinbeck scholar John Ditsky.  \n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"Product_Tabs_loading_start\");\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10391,Starts-->\n<!-- Code Change For ATG-10391,Ends-->\n<!-- Code Change For ATG-10237,Ends-->\n\n\nRelated collections and offers\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nLimited Time Audiobook Deals\n\n\n\n\n\n\n\nli hidden>\nProduct Details\nRelated Subjects\n\n\n\n\n\n\n\nEditorial Reviews\n\n\nFrom the Publisher\nBy the Winner of the Nobel Prize in Literature&ldquo;A morality play conceived with poetic intensity.&rdquo; &mdash;New York Herald Tribune &#160; &ldquo;[Burning Bright&rsquo;s] four solitary characters are neither flesh-and-blood nor stock figures; husband, wife, friend, outsider, they are the legendary archetypes of folklore, speaking a spare, bare-boned language salted with color&mdash;a kind of abstract folk speech that is stilted, poetic and moving.&rdquo; &mdash;The New York Times\n\n\n\n\n\n\nProduct Details\n\n\n<!-- changes start for ATG-9471 -->\n\nBN ID:\n<!-- changes End for ATG-9471 -->\n2940169467635\n\n\nPublisher:\n\nPenguin Random House\n\n\n Publication date:\n03/12/2022\n\nSeries:\n\nPenguin Audio Classics\n\nEdition description:\nUnabridged\n\n\n\n\n\n\n\nRelated Subjects\n\n\n20th Century American Fiction - 1945-2000\n\nAdultery & Infidelity - Fiction\n\nAmerican Fiction & Literature Classics\n\nBooks by Nobel Prize in Literature Laureates->1961-1970\n\nLiterary Fiction\n\nMarriage - Fiction\n\n\n\n\n\n\n<!-- -->\n\n\nVideos\n\n<!-- -->\n<!-- CAP TITLE LENGTH -->\n\n<!-- \n -->\n\n\n\n\n\n\n\n<!-- \n -->\n<!-- -->\n\n\n\n<!-- -->\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Product_Tabs_loading_end\");\nperformance.measure(\n\"productTabsDur\",\n\"Product_Tabs_loading_start\",\n\"Product_Tabs_loading_end\"\n);\n}\n\n\n\n\n\nEditorial Reviews\n\nBy the Winner of the Nobel Prize in Literature&ldquo;A morality play conceived with poetic intensity.&rdquo; &mdash;New York Herald Tribune &#160; &ldquo;[Burning Bright&rsquo;s] four solitary characters are neither flesh-and-blood nor stock figures; husband, wife, friend, outsider, they are the legendary archetypes of folklore, speaking a spare, bare-boned language salted with color&mdash;a kind of abstract folk speech that is stilted, poetic and moving.&rdquo; &mdash;The New York Times\nFrom the Publisher\n\n\n\n\n\n<!-- Gigya Changes -->\n<!-- Gigya Changes -->\n\nCustomer Reviews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nscript defer>\n$(function() {\nvar isLoggedIn = false;\nvar ratingsParams = {\ncategoryID: 'Products',\nstreamID: '1002937563', /* use Product ID for unique identifier? SkuID? - prd2940169467635 - ProductID? */\ncontainerID: 'ratingsDisplay',\nwidth: '100%',\nshowCommentButton: false,\nratingTemplate: '',\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#ratingsDisplay'),\n// numRating = $(\".gig-average-review\").html();\n//SRL-2749\nnumRating = $('.gig-rating-stars').attr('title') || $(\".gig-average-review\").html() || 0;\nvar skutype = 'digitalAudiobook',\n$headerReviewLink = $('.sticky-left .gig-rating-readReviewsLink'),\nreviewCountTxt = $reviewLink.html();\nif($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n}\nelse if(skutype == 'book' || skutype == 'eBook'){\nif($reviewLink.html() === \"1 Review\"){\nreviewCountTxt = reviewCountTxt.replace(\"Review\", \"Customer Review\");\n}\nelse{\nreviewCountTxt = reviewCountTxt.replace(\"Reviews\", \"Customer Reviews\");\n}\n$headerReviewLink.html(reviewCountTxt);\n}\nvar widthOfAuthor= calculateWidthOfauthor();\nvar widthOfReadReviewsLink= parseInt($('.header-gigiya-wrapper .gig-rating-readReviewsLink').width());\nif($('.read-review-header').length)\t{\n$('.read-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\nif($('#EditorialReviews').length){\n$('.editorial-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\n$(\"#avgRating\").html(\"Average Rating: \" + numRating);\n//SRL-2749 : Star rating information is not clear\nvar ariaText = numRating + \" rating out of 5 Stars\";\n$(\".gig-rating-stars\").attr('aria-label',ariaText);\ninitBuyOptnsPDP();\n}\n},\nratingsParamsComments = {\ncategoryID: 'Products',\nstreamID: '1002937563',\ncontainerID: 'prodReviewInfo',\nratingTemplate:\n'' +\n'',\nwidth: '100%',\nshowCommentButton: false,\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#prodReviewInfo'),\nnumRating = $('#ratingsDisplay .gig-rating-stars').attr('title') || $(\".gig-average-review\").first().text() || 0;\nif ($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n$('.customer-reviews-body h3').hide();\n$('.reviews-view-all').hide();\n$('.customer-reviews-body').append('');\n}\n\n// Analytics set review and ratings\nif(typeof s_setP !== 'undefined' && typeof s_getP !== 'undefined') {\nvar digitalDataRating = s_getP('digitalData.product[0].attributes.rating'),\ndigitalDataReview = s_getP('digitalData.product[0].attributes.reviews'),\nnumReview = 0,\n$review = $('.gig-rating-readReviewsLink').first(),\nreviewStringParse = '';\nif($review.length > 0) {\nreviewStringParse = $review.text();\nnumReview = reviewStringParse.replace(/reviews/gi,'').trim();\n}\nif(typeof digitalDataRating == 'undefined' || digitalDataRating != numRating) {\ns_setP('digitalData.product[0].attributes.rating', parseFloat(numRating));\n}\n\nif((typeof digitalDataReview == 'undefined' || digitalDataReview != numReview) && !isNaN(numReview)) {\ns_setP('digitalData.product[0].attributes.reviews', parseInt(numReview, 10));\n}\n\n}\n// Gigya ratings and reviews loads after document is ready,\n// so direct call needs to called onload instead\n$(document).trigger('analytics-track-pdp');\n}\n},\nparams = {\ncategoryID: \"Products\",\nstreamID: \"1002937563\",\ncallback:updateDOM\n},\ncommentParams = {\nversion:2,\nsort: 'votesDesc',\nthreaded: true,\n\nthreadLimit: 3,\n\ncategoryID: 'Products',\nstreamID: '1002937563',\ncontainerID: 'reviews-list',\nwidth: '100%',\nuseSiteLogin: true,\nonLoad: function() {\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_ends\");\nperformance.measure(\n\"customerReviewsDur\",\n\"Customer_Reviews_Gigya_loading_starts\",\n\"Customer_Reviews_Gigya_loading_ends\"\n);\n}\n//ATG-23455 : remove fixed height for the comments container\n$('.gig-comments-more').on('click', function(){\n$('#reviews-list').css('height','100%');\n});\n//SRL-2731\n$('div.gig-simpleShareUI-button').each(function(){\nvar ariaTitle = $(this).find('.gig-simpleShareUI-buttonText').text();\n$(this).children('.gig-simpleShareUI-button-inner').attr({\nrole:'button',\ntitle : ariaTitle\n});\n});\n$('.gig-simpleShareUI-closeButton').attr('role', 'button');\n$('.gig-simpleShareUI-closeButton').attr('title','Close');\n//SRL-2731 ends\n//ATG-19340 starts\nvar adColumnHeight = $('#adcontainer1').outerHeight(true);\nif(adColumnHeight<19){\n$('.customer-reviews-body').css({'min-height': \"0px\"});\n}\n//ATG-19772 starts : to set min-height for mouse hover in customer-reviews\nelse{\n$('.customer-reviews-body').css({'min-height': \"300px\"});\n}\n//ATG-19772 ends\n//ATG-19340 ends\n//ADA SRL-2382\n$('.gig-comment-shareLink').each(function(){\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar triggerEle = $(this);\nvar focusPlaced = function(){\n$('.gig-simpleShareUI-closeButton').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-closeButton').focus();\n$('.gig-simpleShareUI-closeButton').on('keydown click',function(e){\nif(e.keyCode === 13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-buttonText-more').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$('.gig-simpleShareUI-buttonText-facebook').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-email').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-twitter').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-googleplus').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-messenger').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-linkedin').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-digg').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-delicious').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-hyves').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-baidu').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-more').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-facebook').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-email').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-twitter').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-googleplus').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-messenger').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-linkedin').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-digg').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-delicious').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-hyves').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-baidu').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\nvar socialModalFocus = function(){\n$('img[style=\"cursor:pointer;\"]:first').attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Close'\n});\n$(\"img[id$='arrow_left']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous'\n});\n$(\"img[id$='arrow_right']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next'\n});\n$(\"img[id$='arrow_right_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next Disabled'\n});\n$(\"img[id$='arrow_left_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous Disabled'\n});\n$('img[style=\"cursor:pointer;\"]:first').focus();\n$('img[style=\"cursor:pointer;\"]:first').on('keydown click',function(e){\nvar triggerElement = $(this);\nif(e.keyCode==13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$(\"img[id$='arrow_right']\").on('keydown',function(e){\nif((!e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:first').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_right_disable']\").on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$(\"img[id$='arrow_left']\").on('keydown',function(e){\nif((e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:last').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_left_disable']\").on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$('img[style=\"cursor:pointer;\"]:first').on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\nif($(\"img[id$='arrow_right']\").is(':visible')){\n$(\"img[id$='arrow_right']\").focus();\ne.preventDefault();\n}\nelse\n$('img[id$=\"arrow_right_disable\"]').focus();\ne.preventDefault();\n}\n});\n$(\"[id$='_showShareUI_bookmarksWidget_page']\").find(\"table\").each(function(){\n$(this).find(\"tr\").each(function(){\nif($(this).find(\"table\").length > 0){\n$(this).find(\"table\").each(function(){\n$(this).find(\"td\").each(function(){\nvar title = $(this).find(\"div\").attr(\"title\");\n$(this).find(\"div\").find(\"button\").attr(\"aria-label\",title);\n});\n});\n}\n});\n});\n}\n$('.gig-simpleShareUI-buttonText-more').on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\nelse if(!e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-closeButton').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\n});\n}\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\n});\n});\n$('.gig-comment-flag').each(function(){\nvar target=$(this);\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar focusGiven = function(){\n$('.gig-comments-dialog-close').attr({\n'tabindex' : '0',\n'role' : 'button',\n'title' : 'Close'\n});\n$('.gig-comments-dialog-button-ok').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-button-cancel').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-close').focus();\n$('.gig-comments-dialog-close').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-cancel').focus();\ne.preventDefault();\n}\n});\n$('.gig-comments-dialog-button-cancel').on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-ok').focus();\ne.preventDefault();\n}\nelse if(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\n});\n$('.gig-comments-dialog-button-ok').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\n});\n}\n$(this).attr('tabindex','0');\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nfocusGiven();\n}\nelse if(e.type == 'click'){\nfocusGiven();\n}\n});\n});\n$('.gig-comment-vote-pos').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-vote-neg').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-content').each(function(){\n$(this).attr('tabindex','0');\n});\n//ADA SRL-2382 ends\nvar reviewsContainer = $('#reviews-container');\nvar commentsContainer = $('.gig-comments-comments');\nvar pos = $('.gig-comment-vote-pos');\nvar neg = $('.gig-comment-vote-neg');\nif (commentsContainer.is(':empty')) {\nreturn;\n} else {\nreviewsContainer.removeClass('hidden');\n}\nif (!isLoggedIn) {\npos.addClass('sign-in-link');\nneg.addClass('sign-in-link');\n}\n/* SRL-461 : Providing suitable aria-label for the Like and Diskike button in Customer Reviews */\n$(\".gig-comment-self-data\").each(function(i) {\nvar like = $(this).find('.gig-comment-vote-pos').html() + \" people like this review.\" ;\nvar dislike = $(this).find('.gig-comment-vote-neg').html() + \" people dislike this review.\" ;\n$(this).find('.gig-comment-vote-pos').attr('aria-label',like);\n$(this).find('.gig-comment-vote-neg').attr('aria-label',dislike);\n});\n$(\".gig-comment-title\").each(function(index) {\nvar count = $(this).find(\".gig-comment-rating-star-full\").length;\nvar maxCount = $(this).find(\".gig-comment-rating-star\").length;\nvar reviewRating = \"This review rates \" + count + \" out of \" + maxCount + \" stars.\";\n$(this).prepend('Rating: ' + count + ' out of '+ maxCount + '');\n$(this).find(\".gig-comment-rating\").attr({\"aria-label\":reviewRating , \"role\":\"img\" , \"title\":count , \"alt\":count});\n});\n}\n};\nfunction updateDOM(response) {\nvar overallRating = response.streamInfo.avgRatings._overall;\nif ( response.errorCode == 0 ) {\n$(\".gig-average-review\").html(overallRating);\n}\n}\nfunction gotoReviews(eventObj) {\nvar skutype = 'digitalAudiobook',\n$reviewLink = $('.gig-rating-readReviewsLink'),\nreviewLocation = eventObj && eventObj.instanceID ? eventObj.instanceID : '',\nsetLocation = (reviewLocation === 'ratingsDisplay') ? 'topOfPage' : 'customerReviewsBox';\n$(document).triggerHandler('analytics-reviews-clicked', {location: setLocation});\nif ($reviewLink.html() === \"Be the first to write a review\") {\n$(\"#writeReviewBtn\").click();\n} else {\nif(skutype == 'book' || skutype == 'eBook'){\ndocument.getElementById('reviews').scrollIntoView();\n} else {\nwindow.location = \"/reviews/burning-bright-john-steinbeck/1002937563?ean=2940169467635#reviews-header\";\n}\n}\n}\nif(typeof gigya != 'undefined') {\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_starts\");\n}\n// gigya.comments.getStreamInfo(params);\n// gigya.comments.showRatingUI(ratingsParams);\n//gigya.comments.showRatingUI(ratingsParamsComments);\n//gigya.comments.showCommentsUI(commentParams);\n}\n});\nfunction calculateWidthOfauthor(){\nvar widthAuthor= 0;\nif($(\".header-gigiya-wrapper .sticky-author .contributors\").find(\"a\").length > 0){\n$('.header-gigiya-wrapper .sticky-author .contributors a').each(function(){\nwidthAuthor += parseFloat($(this).width())+ 12;\n});\n}\nelse{\nwidthAuthor += $(\".header-gigiya-wrapper .sticky-author .contributors\").width();\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Director')>-1){\nwidthAuthor +=45;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Cast')>-1){\nwidthAuthor +=25;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('by')>-1){\nwidthAuthor +=15;\n}\nreturn widthAuthor;\n}\n\n\n\n\n<!-- Internal Component Tracking - Begin -->\n<!-- Internal Component Tracking - End -->\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"BloomReach_Widget_loading_starts\");\n\n\n\n\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_starts\");\n}\n\n\n<!-- ATG-26331 remove google analytics-->\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_ends\");\nperformance.measure(\n\"globalFooterDur\",\n\"Global_Footer_loading_starts\",\n\"Global_Footer_loading_ends\"\n);\n}\n\n<!-- ATG-26338 : Add modal for PDP, PLP -->\n<!-- ATG-26338 : Ends -->\nvar isresponsive= true;\n<!-- All Javascripts in js-scripts-ra.jsp has to be minified. ALl JS has to be moved to release dir as per grunt minification -->\n\n$.webshims.setOptions('basePath','//js.js-bn.com/static/redesign/srcs/js/vendor/js-webshim-1.15/minified/shims/');\n$.webshims.polyfill('es5 forms forms-ext');\n\n\nscript defer async type=\"text/javascript\" src=\"https://request.eprotect.vantivcnp.com/eProtect/eProtect-api3.js\">\n\n\nif(!$.isEmptyObject(digitalData)){\nvar digitalData1 = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"20th Century American Fiction - 1945-2000\",\"Adultery & Infidelity - Fiction\",\"American Fiction & Literature Classics\",\"Books by Nobel Prize in Literature Laureates->1961-1970\",\"Literary Fiction\",\"Marriage - Fiction\"],\"productType\":\"digitalAudiobook\"},\"price\":{\"basePrice\":3.99},\"productInfo\":{\"departmentCode\":\"24\",\"sku\":\"2940169467635\",\"productName\":\"Burning Bright: A Play in Story Form\",\"productID\":\"prd2940169467635\",\"productURL\":\"/w/burning-bright-john-steinbeck/1002937563?ean=2940169467635\"},\"attributes\":{\"outOfStock\":false,\"reviews\":5,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":false,\"rating\":2.8,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"16794BF866E0C7192F7A7D8FFB36F546\",\"serverName\":\"prodny_store02\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:26 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:burning-bright-a-play-in-story-form|1002937563\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060681083\"}}]}]};\n$.extend(digitalData,digitalData1);\n}else{\n\nvar digitalData = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"20th Century American Fiction - 1945-2000\",\"Adultery & Infidelity - Fiction\",\"American Fiction & Literature Classics\",\"Books by Nobel Prize in Literature Laureates->1961-1970\",\"Literary Fiction\",\"Marriage - Fiction\"],\"productType\":\"digitalAudiobook\"},\"price\":{\"basePrice\":3.99},\"productInfo\":{\"departmentCode\":\"24\",\"sku\":\"2940169467635\",\"productName\":\"Burning Bright: A Play in Story Form\",\"productID\":\"prd2940169467635\",\"productURL\":\"/w/burning-bright-john-steinbeck/1002937563?ean=2940169467635\"},\"attributes\":{\"outOfStock\":false,\"reviews\":5,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":false,\"rating\":2.8,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"16794BF866E0C7192F7A7D8FFB36F546\",\"serverName\":\"prodny_store02\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:26 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:burning-bright-a-play-in-story-form|1002937563\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060681083\"}}]}]};\n\n}\nif (typeof s_setP !== 'undefined') {\ns_setP('digitalData.component[0].componentInfo.componentName','you may also like');\ns_setP('digitalData.component[0].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[0].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[1].componentInfo.componentName','more in this series');\ns_setP('digitalData.component[1].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[1].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[2].componentInfo.componentName','recently-viewed');\ns_setP('digitalData.component[2].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[2].componentInfo.primaryCategory','internal campaign');\n\n}\n$(document).ready(function(){\nif (typeof s_setP !== 'undefined') {\n\nBN.Analytics.PDP.init();\n\nBN.Analytics.Generic.GoogleAds();\n\n}\n});\n\n\n\n\n\nvar cname = \"internalCampaign\",\ncvalue = null;\nvar curCookie = cname + \"=\" + cvalue +\n\"; expires= Thu, 01 Jan 1970 00:00:01 GMT;\" +\n\"; path=\" + \"/\" +\n\"; domain=\" + SITE_DOMAIN;\ndocument.cookie = curCookie;\n\n\n/*Check id google ad needs to be loaded after page load*/\n\nvar asyncRelatedAdsEnabled = true;\nvar endemicAd = true;\n$(document).on('googleRelatedAdsLoaded', function() {\n\n})\n\n\n\n\n\n\n\n\n_satellite.pageBottom();\n\ndocument.write(\"<\\/script>\");\n/*CommerceHeaderFooter is the name of the library that we defined in webpack.config.js */\nCommerceHeaderFooter.showFooter('footer', {env:'prod', consumer_host:'https://www.barnesandnoble.com', styling:'responsive'});\n\n\n\n\n\n",
        "rating": 3,
        "price": "$20.00",
        "image": "//prodimage.images-bn.com/pimages/2940169467635_p0_v2_s600x595.jpg",
        "author": "John Steinbeck",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Fellowship of the Ring (The Lord of the Rings, Part 1)",
        "description": "Inspired by The Hobbit, and begun in 1937, The Lord of the Rings is a trilogy that Tolkien created to provide “the necessary background of history for Elvish tongues.” From these academic aspirations was born one of the most popular and imaginative works in English literature. The Fellowship of the Ring, the first volume in the trilogy, tells of the fateful power of the One Ring. It begins a magnificent tale of adventure that will plunge the members of the Fellowship of the Ring into a perilous quest and set the stage for the ultimate clash between powers of good and evil. In this splendid, unabridged audio production of Tolkien's great work, all the inhabitants of a magical universe-hobbits, elves, and wizards-step colorfully forth from the pages. Rob Inglis' narration has been praised as a masterpiece of audio.",
        "rating": 3,
        "price": "$29.99",
        "image": "//prodimage.images-bn.com/pimages/2940171137243_p0_v3_s600x595.jpg",
        "author": "J. R. R. Tolkien",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The New Neighbor: A Thriller",
        "description": "\n\"The New Neighbor is a dizzying descent into a Byzantine maze of psychological suspense. Carter Wilson proves once again why he is one of the best most inventive thriller writers working today.\" &#8212; S. A. Cosby, New York Times bestselling author of Razorblade Tears and Blacktop WastelandUSA Today bestselling author Carter Wilson returns with another chilling psychological thriller, for readers of Megan Miranda and Alex MichaelidesAidan holds the winning Powerball numbers.Is today the best day of his life... or the worst?Aidan Marlowe is the superstitious type&#8212;he's been playing the same lottery numbers for fifteen years, never hitting the jackpot. Until now. On the day of his wife's funeral.Aidan struggles to cope with these two sudden extremes: instant wealth beyond his imagination, and the loss of the only woman he's ever loved, the mother of his twin children. But the money gives him and his kids options they didn't have before. They can leave everything behind. They can start a new life in a new town. So they do.But a huge new house and all the money in the world can't replace what they've lost, and it's not long before Aidan realizes he's merely trading old demons for new ones. Because someone is watching him and his family very closely. Someone who knows exactly who they are, where they've come from, and what they're trying to hide. Someone who will stop at nothing to get what they want...\"Carter Wilson's writing is evocative and intense, his characters deeply flawed yet relatable.\"&#8212;Julie Clark, New York Times bestselling author of The Last Flight for The Dead Husband\"A smashing story about families and secrets and all the things you don't want to know about the people closest to you. Read it!\"&#8212;David Bell, USA Today bestselling author for The Dead HusbandMore books by Carter Wilson:The Dead HusbandThe Dead Girl in 2AMister Tender's Girl",
        "rating": 4,
        "price": "$9.99",
        "image": "//prodimage.images-bn.com/pimages/9781728247533_p0_v2_s600x595.jpg",
        "author": "Carter Wilson",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Bitter",
        "description": "From National Book Award finalist Akwaeke Emezi comes a companion novel to the critically acclaimed PET that explores both the importance and cost of social revolution--and how youth lead the way.After a childhood in foster care, Bitter is thrilled to have been chosen to attend Eucalyptus, a special school where she can focus on her painting surrounded by other creative teens. But outside this haven, the streets are filled with protests against the deep injustices that grip the city of Lucille. Bitter's instinct is to stay safe within the walls of Eucalyptus . . . but  her  friends  aren't  willing  to  settle  for  a  world  that's  so  far  away from what they deserve. Pulled between old friendships, her artistic passion, and a new romance, Bitter isn't sure where she  belongs-in  the  studio  or  in  the  streets.  And  if  she  does  find a way to help the revolution while being true to who she is, she must also ask: at what cost?  This  timely  and  riveting  novel-a  companion  to  the  National  Book Award finalist Pet-explores the power of youth, protest, and art.",
        "rating": 4,
        "price": "$20.00",
        "image": "//prodimage.images-bn.com/pimages/2940176262759_p0_v1_s600x595.jpg",
        "author": "Akwaeke Emezi",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Heartstopper, Volume 1",
        "description": "\n<B>Boy meets boy. Boys become friends. Boys fall in love. A sweet and charming coming-of-age story that explores friendship, love, and coming out. This edition features beautiful two-color artwork.<P><B>Now streaming on Netflix!<P><P>Shy and softhearted Charlie Spring sits next to rugby player Nick Nelson in class one morning. A warm and intimate friendship follows, and that soon develops into something more for Charlie, who doesn't think he has a chance.<P>But Nick is struggling with feelings of his own, and as the two grow closer and take on the ups and downs of high school, they come to understand the surprising and delightful ways in which love works.",
        "rating": 4,
        "price": "$14.99",
        "image": "//prodimage.images-bn.com/pimages/9781338617436_p0_v2_s600x595.jpg",
        "author": "Alice Oseman",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781338617436_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617436_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781338617436_p3_v5_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Einstein's Fridge: How the Difference Between Hot and Cold Explains the Universe",
        "description": "This entertaining, eye-opening account of how the laws of thermodynamics are essential to understanding the world today-from refrigeration and jet engines to calorie counting and global warming-is “a lesson in how to do popular science right” (Kirkus Reviews).Einstein's Fridge tells the incredible epic story of the scientists who, over two centuries, harnessed the power of heat and ice and formulated a theory essential to comprehending our universe. “Although thermodynamics has been studied for hundreds of years¿few nonscientists appreciate how its principles have shaped the modern world” (Scientific American). Thermodynamics-the branch of physics that deals with energy and entropy-governs everything from the behavior of living cells to the black hole at the center of our galaxy. Not only that, but thermodynamics explains why we must eat and breathe, how lights turn on, the limits of computing, and how the universe will end. The brilliant people who decoded its laws came from every branch of the sciences; they were engineers, physicists, chemists, biologists, cosmologists, and mathematicians. From French military engineer and physicist Sadi Carnot to Lord Kelvin, James Joule, Albert Einstein, Emmy Noether, Alan Turing, and Stephen Hawking, author Paul Sen introduces us to all of the players who passed the baton of scientific progress through time and across nations. Incredibly driven and idealistic, these brave pioneers performed groundbreaking work often in the face of torment and tragedy. Their discoveries helped create the modern world and transformed every branch of science, from biology to cosmology. “Elegantly written and engaging” (Financial Times), Einstein's Fridge brings to life one of the most important scientific revolutions of all time and captures the thrill of discovery and the power of scientific progress to shape the course of history.",
        "rating": 2,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/2940177331201_p0_v1_s600x595.jpg",
        "author": "Paul Sen",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "description": "From Taylor Jenkins Reid, \"a genius when it comes to stories about life and love\" (Redbook), comes an unforgettable and sweeping novel about one classic film actress's relentless rise to the top—the risks she took, the loves she lost, and the long-held secrets the public could never imagine.Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one in the journalism community is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband, David, has left her, and her career has stagnated. Regardless of why Evelyn has chosen her to write her biography, Monique is determined to use this opportunity to jumpstart her career. Summoned to Evelyn's Upper East Side apartment, Monique listens as Evelyn unfurls her story: from making her way to Los Angeles in the 1950s to her decision to leave show business in the late 80s, and, of course, the seven husbands along the way. As Evelyn's life unfolds—revealing a ruthless ambition, an unexpected friendship, and a great forbidden love—Monique begins to feel a very a real connection to the actress. But as Evelyn's story catches up with the present, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways. Written with Reid's signature talent for \"creating complex, likable characters\" (Real Simple), this is a fascinating journey through the splendor of Old Hollywood into the harsh realities of the present day as two women struggle with what it means—and what it takes—to face the truth.",
        "rating": 3,
        "price": "$23.99",
        "image": "//prodimage.images-bn.com/pimages/2940170625024_p0_v2_s600x595.jpg",
        "author": "Taylor Jenkins Reid",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "A Court of Silver Flames (A Court of Thorns and Roses Series #4)",
        "description": "An unfathomable powerNesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange,deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it. The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites.The fire between them is undeniable, and it only burns hotter as they are forced to work closely together. Meanwhile, the treacherous human queens who returned to the continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might verywell rely on Cassian and Nesta facing their haunting pasts. Against the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms.",
        "rating": 2,
        "price": "$34.99",
        "image": "//prodimage.images-bn.com/pimages/2940176203264_p0_v1_s600x595.jpg",
        "author": "Sarah J. Maas",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "The Ballad of Never After (Signed B&N Exclusive Book)",
        "description": "\nThis Barnes & Noble Exclusive Edition is signed by Stephanie Garber, includes a bonus chapter from Jacks' POV, and has a unique cover and case stamp!The fiercely-anticipated sequel to the #1 New York Times bestseller Once Upon a Broken Heart, starring Evangeline Fox and the Prince of Hearts on a new journey of magic, mystery, and heartbreakNot every love is meant to be. After Jacks, the Prince of Hearts, betrays her, Evangeline Fox swears she'll never trust him again. Now that she&#8217;s discovered her own magic, Evangeline believes she can use it to restore the chance at happily ever after that Jacks stole away. But when a new terrifying curse is revealed, Evangeline finds herself entering into a tenuous partnership with the Prince of Hearts again. Only this time, the rules have changed. Jacks isn&#8217;t the only force Evangeline needs to be wary of. In fact, he might be the only one she can trust, despite her desire to despise him. Instead of a love spell wreaking havoc on Evangeline&#8217;s life, a murderous spell has been cast. To break it, Evangeline and Jacks will have to do battle with old friends, new foes, and a magic that plays with heads and hearts. Evangeline has always trusted her heart, but this time she&#8217;s not sure she can&#8230;",
        "rating": 3,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/9781250874740_p0_v5_s600x595.jpg",
        "author": "Stephanie Garber",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781250874740_p1_v6_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec34d"
    },
    {
        "name": "A Touch of Darkness",
        "description": "\nFrom bestselling author Scarlett St. Clair comes a dark and enthralling reimagining of the Hades and Persephone Greek myth. \"Let me worship you,\" he said.She remembered the words she had whispered to him in the back of the limo after La Rose. \"You will worship me, and I won't even have to order you.\" His request felt sinful and devious, and she reveled in it.She answered, \"Yes.\"Persephone is the Goddess of Spring in title only. Since she was a little girl, flowers have only shriveled at her touch. After moving to New Athens, she hoped to lead an unassuming life disguised as a mortal journalist. All of that changes when she sits down in a forbidden nightclub to play a hand of cards with a hypnotic and mysterious stranger.Hades, God of the Dead, has built a gambling empire in the mortal world and his favorite bets are rumored to be impossible. But nothing has ever intrigued him as much as the goddess offering him a bargain he can't resist.After her encounter with Hades, Persephone finds herself in a contract with the God of the Dead, and his terms are impossible&#58; Persephone must create life in the Underworld or lose her freedom forever. The bet does more than expose Persephone's failure as a goddess, however. As she struggles to sow the seeds of her freedom, love for the God of the Dead grows&#8212;a love that is both captivating and forbidden.",
        "rating": 1,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9781728258454_p0_v2_s600x595.jpg",
        "author": "Scarlett St. Clair",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The PD Book: 7 Habits that Transform Professional Development",
        "description": "<B>Develop transformational professional development programs that build and sustain your school communityIn <I>The PD Book, bestselling author Elena Aguilar and coauthor Lori Cohen offer seven habits-and a wealth of practical tools-that help you transform professional development. In this book, you'll learn how to inspire adult learners, the importance of having clear purpose, and how to navigate power dynamics in a group. You'll also learn a new way to plan PD that allows you to attend to details and be a responsive facilitator. The dozens of tips and tricks, anecdotes and research, and tools and resources will enable you to create the optimal conditions for learning.You'll also: craft effective outcomes for your adult students and design an agenda that aligns with adult learning principles; use storytelling as a tool for effective workshops and trainings; and plan backwards from evaluations and outcomes to create powerful and lasting educational experiences.Ideal for educational leaders and administrators, professional development facilitators, coaches, and positional leaders, <I>The PD Book is an incisive resource offering concrete strategies for educators at all levels.",
        "rating": 3,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/2940175399845_p0_v2_s600x595.jpg",
        "author": "Elena Aguilar",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Fine Print",
        "description": "\nRowanI'm in the business of creating fairy tales.Theme parks. Production companies. Five-star hotels.Everything could be all mine if I renovated Dreamland.My initial idea of hiring Zahra was good in theory, but then I kissed her.Things spiraled out of control once I texted her using an alias.By the time I realized where I went wrong, it was too late.People like me don't get happy endings.Not when we're destined to ruin them.ZahraAfter submitting a drunk proposal criticizing Dreamland's most expensive ride, I should have been fired.Instead, Rowan Kane offered me a dream job.The catch? I had to work for the most difficult boss I'd ever met.Rowan was rude and completely off-limits, but my heart didn't care.At least not until I discovered his secret.It was time to teach the billionaire that money couldn't fix everything.Especially not us.",
        "rating": 1,
        "price": "$17.99",
        "image": "//prodimage.images-bn.com/pimages/9781737507710_p0_v3_s600x595.jpg",
        "author": "Lauren Asher",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Sea of Tranquility",
        "description": "NEW YORK TIMES BEST SELLER ¿ The award-winning, best-selling author of Station Eleven and The Glass Hotel returns with a novel of art, time travel, love, and plague that takes the reader from Vancouver Island in 1912 to a dark colony on the moon five hundred years later, unfurling a story of humanity across centuries and space.“One of [Mandel's] finest novels and one of her most satisfying forays into the arena of speculative fiction yet.” -The New York TimesEdwin St. Andrew is eighteen years old when he crosses the Atlantic by steamship, exiled from polite society following an ill-conceived diatribe at a dinner party. He enters the forest, spellbound by the beauty of the Canadian wilderness, and suddenly hears the notes of a violin echoing in an airship terminal-an experience that shocks him to his core. Two centuries later a famous writer named Olive Llewellyn is on a book tour. She's traveling all over Earth, but her home is the second moon colony, a place of white stone, spired towers, and artificial beauty. Within the text of Olive's best-selling pandemic novel lies a strange passage: a man plays his violin for change in the echoing corridor of an airship terminal as the trees of a forest rise around him. When Gaspery-Jacques Roberts, a detective in the black-skied Night City, is hired to investigate an anomaly in the North American wilderness, he uncovers a series of lives upended: The exiled son of an earl driven to madness, a writer trapped far from home as a pandemic ravages Earth, and a childhood friend from the Night City who, like Gaspery himself, has glimpsed the chance to do something extraordinary that will disrupt the timeline of the universe.A virtuoso performance that is as human and tender as it is intellectually playful, Sea of Tranquility is a novel of time travel and metaphysics that precisely captures the reality of our current moment.",
        "rating": 3,
        "price": "$20.00",
        "image": "//prodimage.images-bn.com/pimages/2940176226348_p0_v2_s600x595.jpg",
        "author": "Emily St. John Mandel",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "One Italian Summer",
        "description": "<B>INSTANT NEW YORK TIMES BESTSELLER “[A] magical trip worth taking.” -Associated Press “Rebecca Serle is a maestro of love in all its forms.” -Gabrielle Zevin, New York Times bestselling author The New York Times bestselling author of In Five Years returns with a powerful novel about the transformational love between mothers and daughters set on the breathtaking Amalfi Coast.When Katy's mother dies, she is left reeling. Carol wasn't just Katy's mom, but her best friend and first phone call. She had all the answers and now, when Katy needs her the most, she is gone. To make matters worse, their planned mother-daughter trip of a lifetime looms: to Positano, the magical town where Carol spent the summer right before she met Katy's father. Katy has been waiting years for Carol to take her, and now she is faced with embarking on the adventure alone. But as soon as she steps foot on the Amalfi Coast, Katy begins to feel her mother's spirit. Buoyed by the stunning waters, beautiful cliffsides, delightful residents, and, of course, delectable food, Katy feels herself coming back to life. And then Carol appears-in the flesh, healthy, sun-tanned, and thirty years old. Katy doesn't understand what is happening, or how-all she can focus on is that she has somehow, impossibly, gotten her mother back. Over the course of one Italian summer, Katy gets to know Carol, not as her mother, but as the young woman before her. She is not exactly who Katy imagined she might be, however, and soon Katy must reconcile the mother who knew everything with the young woman who does not yet have a clue. Rebecca Serle's next great love story is here, and this time it's between a mother and a daughter. With her signature “heartbreaking, redemptive, and authentic” (Jamie Ford, New York Times bestselling author) prose, Serle has crafted a transcendent novel about how we move on after loss, and how the people we love never truly leave us.",
        "rating": 4,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/2940173290359_p0_v2_s600x595.jpg",
        "author": "Rebecca Serle",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Love Hypothesis",
        "description": "\nThe Instant New York Times Bestseller and TikTok Sensation!As seen on THE VIEW!A BuzzFeed Best Summer Read of 2021 When a fake relationship between scientists meets the irresistible force of attraction, it throws one woman's carefully calculated theories on love into chaos.As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships&#151;but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks&#58; Scientists require proof. So, like any self-respecting biologist, Olive panics and kisses the first man she sees.That man is none other than Adam Carlsen, a young hotshot professor&#151;and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend. But when a big science conference goes haywire, putting Olive's career on the Bunsen burner, Adam surprises her again with his unyielding support and even more unyielding...six-pack abs.Suddenly their little experiment feels dangerously close to combustion. And Olive discovers that the only thing more complicated than a hypothesis on love is putting her own heart under the microscope.",
        "rating": 3,
        "price": "$16.00",
        "image": "//prodimage.images-bn.com/pimages/9780593336823_p0_v6_s600x595.jpg",
        "author": "Ali Hazelwood",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34d"
    },
    {
        "name": "The Palace Papers: Inside the House of Windsor--the Truth and the Turmoil",
        "description": "NEW YORK TIMES BESTSELLER ¿ The “addictively readable” (The Washington Post) inside story of the British royal family's battle to overcome the dramas of the Diana years-only to confront new, twenty-first-century crises   “The beach read of the summer . . . juicy, satisfying entertainment.”-Town & Country “Never again” became Queen Elizabeth II's mantra shortly after Princess Diana's tragic death. More specif­ically, there could never be “another Diana”-a mem­ber of the family whose global popularity upstaged, outshone, and posed an existential threat to the Brit­ish monarchy.Picking up where Tina Brown's masterful The Diana Chronicles left off, The Palace Papers reveals how the royal family reinvented itself after the trau­matic years when Diana's blazing celebrity ripped through the House of Windsor like a comet.Brown takes readers on a tour de force journey through the scandals, love affairs, power plays, and betrayals that have buffeted the monarchy over the last twenty-five years. We see the Queen's stoic re­solve after the passing of Princess Margaret, the Queen Mother, and Prince Philip, her partner for seven decades, and how she triumphs in her Jubilee years even as family troubles rage around her. Brown explores Prince Charles's determination to make Camilla Parker Bowles his wife, the tension between William and Harry on “different paths,” the ascend­ance of Kate Middleton, the downfall of Prince An­drew, and Harry and Meghan's stunning decision to step back as senior royals. Despite the fragile monar­chy's best efforts, “never again” seems fast approaching.Tina Brown has been observing and chronicling the British monarchy for three decades, and her sweeping account is full of powerful revelations, newly reported details, and searing insight gleaned from remarkable access to royal insiders. Stylish, witty, and erudite, The Palace Papers will irrevoca­bly change how the world perceives and under­stands the royal family.",
        "rating": 5,
        "price": "$27.50",
        "image": "//prodimage.images-bn.com/pimages/2940176417173_p0_v2_s600x595.jpg",
        "author": "Tina Brown",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Neon Gods (Dark Olympus #1)",
        "description": "\nHe was supposed to be a myth. But from the moment I crossed the River Styx and fell under his dark spell...he was, quite simply, mine.*A scorchingly hot modern retelling of Hades and Persephone that's as sinful as it is sweet.*Society darling Persephone Dimitriou plans to flee the ultra-modern city of Olympus and start over far from the backstabbing politics of the Thirteen Houses. But all that's ripped away when her mother ambushes her with an engagement to Zeus, the dangerous power behind their glittering city's dark facade.With no options left, Persephone flees to the forbidden undercity and makes a devil's bargain with a man she once believed a myth...a man who awakens her to a world she never knew existed.Hades has spent his life in the shadows, and he has no intention of stepping into the light. But when he finds that Persephone can offer a little slice of the revenge he's spent years craving, it's all the excuse he needs to help her&#8212;for a price. Yet every breathless night spent tangled together has given Hades a taste for Persephone, and he'll go to war with Olympus itself to keep her close...\"Deliciously inventive...Red-hot.\"&#8212;Publishers Weekly STARRED\"I get shivers just thinking of their interactions. SHIVERS.\"&#8212;Mimi Koehler for The Nerd DailyThe World of Dark Olympus:Neon Gods (Hades & Persephone)Electric Idol (Eros & Psyche)Wicked Beauty (Achilles & Patroclus & Helen)Radiant Sin (Apollo & Cassandra)",
        "rating": 4,
        "price": "$9.99",
        "image": "//prodimage.images-bn.com/pimages/9781728231747_p0_v2_s600x595.jpg",
        "author": "Katee Robert",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Dream Town (Archer Series #3)",
        "description": "<B>Private investigator and World War II veteran Aloysius Archer heads to Los Angeles, the city where dreams are made and shattered, and is ensnared in a lethal case in this latest thriller in #1 <I>New York Times bestselling author David Baldacci's Nero Award-winning series.  <BR /><BR />It's the eve of 1953, and Aloysius Archer is in Los Angeles to ring in the New Year with an old friend, aspiring actress Liberty Callahan, when their evening is interrupted by an acquaintance of Callahan's: Eleanor Lamb, a screenwriter in dire straits.<BR /> <BR />After a series of increasingly chilling events-mysterious phone calls, the same blue car loitering outside her house, and a bloody knife left in her sink-Eleanor fears that her life is in danger, and she wants to hire Archer to look into the matter. Archer suspects that Eleanor knows more than she's saying, but before he can officially take on her case, a dead body turns up inside of Eleanor's home . . . and Eleanor herself disappears. <BR /> <BR />Missing client or not, Archer is dead set on finding both the murderer and Eleanor. With the help of Callahan and his partner Willie Dash, he launches an investigation that will take him from mob-ridden Las Vegas to the glamorous world of Hollywood to the darkest corners of Los Angeles-a city in which beautiful faces are attached to cutthroat schemers, where the cops can be more corrupt than the criminals . . . and where the powerful people responsible for his client's disappearance will kill without a moment's hesitation if they catch Archer on their trail.",
        "rating": 1,
        "price": "$27.98",
        "image": "//prodimage.images-bn.com/pimages/2940178820667_p0_v2_s600x595.jpg",
        "author": "David Baldacci",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Brass Verdict (Lincoln Lawyer Series #2)",
        "description": "<P>Things are finally looking up for defense attorney Mickey Haller. After two years of wrong turns, Haller is back in the courtroom. When Hollywood lawyer Jerry Vincent is murdered, Haller inherits his biggest case yet: the defense of Walter Elliott, a prominent studio executive accused of murdering his wife and her lover. But as Haller prepares for the case that could launch him into the big time, he learns that Vincent's killer may be coming for him next.<P>Enter Harry Bosch. Determined to find Vincent's killer, he is not opposed to using Haller as bait. But as danger mounts and the stakes rise, these two loners realize their only choice is to work together.<P>Bringing together Michael Connelly's two most popular characters, <I>The Brass Verdict is sure to be his biggest book yet.<P>A Hachette Audio production.",
        "rating": 4,
        "price": "$24.98",
        "image": "//prodimage.images-bn.com/pimages/2940173829894_p0_v4_s600x595.jpg",
        "author": "Michael Connelly",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "56 Days",
        "description": "No one even knew they were together. Now one of them is dead.56 DAYS AGOCiara and Oliver meet in a supermarket queue in Dublin and start dating the same week COVID-19 reaches Irish shores.35 DAYS AGOWhen lockdown threatens to keep them apart, Oliver suggests they move in together. Ciara sees a unique opportunity for a relationship to flourish without the scrutiny of family and friends. Oliver sees a chance to hide who-and what-he really is.TODAYDetectives arrive at Oliver's apartment to discover a decomposing body inside.Can they determine what really happened, or has lockdown created an opportunity for someone to commit the perfect crime?",
        "rating": 2,
        "price": "$19.95",
        "image": "//prodimage.images-bn.com/pimages/2940173332974_p0_v2_s600x595.jpg",
        "author": "Catherine Ryan Howard",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Hidden: An Exciting Novel of Suspense",
        "description": "\n<B><I>A page-turning new story from the bestselling author of No Way Out<I>, perfect for fans of Nora Roberts and Danielle Steel! <I>Meet a brother and sister who are drawn into a treacherous mystery through an antique with a dark past, as they race against time to help a single mother and take down a ruthless couple bent on taking control of their family&rsquo;s legacy&hellip;<BR><BR> At first glance, few would guess that Luna and Cullen Bodman are siblings. Cullen is efficient and serious while his younger sister Luna is a free spirit. When the two launch their furniture restoration shop/caf&eacute;&mdash;an offshoot of the family&rsquo;s longtime antique business&mdash;in an up-and-coming arts center, little do they know their unique talents may be their only defense against a dangerous betrayal.<BR> &#160;<BR> When Luna gets a strange sense about a piece Cullen just acquired, the two find themselves uniting to solve a mystery that has far-reaching consequences&mdash;never knowing there are some who&rsquo;ll stop at nothing to claim what they believe is theirs. No matter what, Luna and Cullen know they can rely on each other&mdash;and this time, their lives may depend on it&hellip;<BR><BR> &#160;",
        "rating": 2,
        "price": "$9.49",
        "image": "//prodimage.images-bn.com/pimages/9781420152333_p0_v2_s600x595.jpg",
        "author": "Fern Michaels",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Nightwork",
        "description": "#1 New York Times bestselling author Nora Roberts introduces an unforgettable thief in an unputdownable new novel¿Greed. Desire. Obsession. Revenge . . . It's all in a night's work.Harry Booth started stealing at nine to keep a roof over his ailing mother's head, slipping into luxurious, empty homes at night to find items he could trade for precious cash. When his mother finally succumbed to cancer, he left Chicago-but kept up his nightwork, developing into a master thief with a code of honor and an expertise in not attracting attention?or getting attached.Until he meets Miranda Emerson, and the powerful bond between them upends all his rules. But along the way, Booth has made some dangerous associations, including the ruthless Carter LaPorte, who sees Booth as a tool he controls for his own profit. Knowing LaPorte will leverage any personal connection, Booth abandons Miranda for her own safety-cruelly, with no explanation-and disappears.But the bond between Miranda and Booth is too strong, pulling them inexorably back together. Now Booth must face LaPorte, to truly free himself and Miranda once and for all. A Macmillan Audio production from St. Martin's Press.",
        "rating": 3,
        "price": "$26.99",
        "image": "//prodimage.images-bn.com/pimages/2940176379990_p0_v2_s600x595.jpg",
        "author": "Nora Roberts",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "People We Meet on Vacation",
        "description": "\nFrom the #1 New York Times bestselling author of Book Lovers and Beach Read comes a sparkling novel that will leave you with the warm, hazy afterglow usually reserved for the best vacations.Two best friends. Ten summer trips. One last chance to fall in love.Poppy and Alex. Alex and Poppy. They have nothing in common. She&rsquo;s a wild child; he wears khakis. She has insatiable wanderlust; he prefers to stay home with a book. And somehow, ever since a fateful car share home from college many years ago, they are the very best of friends. For most of the year they live far apart&mdash;she&rsquo;s in New York City, and he&rsquo;s in their small hometown&mdash;but every summer, for a decade, they have taken one glorious week of vacation together. &#160; Until two years ago, when they ruined everything. They haven't spoken since. &#160; Poppy has everything she should want, but she&rsquo;s stuck in a rut. When someone asks when she was last truly happy, she knows, without a doubt, it was on that ill-fated, final trip with Alex. And so, she decides to convince her best friend to take one more vacation together&mdash;lay everything on the table, make it all right. Miraculously, he agrees. &#160; Now she has a week to fix everything. If only she can get around the one big truth that has always stood quietly in the middle of their seemingly perfect relationship. What could possibly go wrong?Named a Most Anticipated Book of 2021 by Newsweek &#8729; Oprah Magazine &#8729; The Skimm &#8729; Marie Claire &#8729; Parade &#8729; The Wall Street Journal &#8729; Chicago Tribune &#8729; PopSugar&#160;&#8729;&#160;BookPage &#8729; BookBub &#8729; Betches &#8729; SheReads &#8729; Good Housekeeping &#8729; BuzzFeed &#8729; Business Insider &#8729; Real Simple &#8729; Frolic &#8729; and more!",
        "rating": 2,
        "price": "$16.00",
        "image": "//prodimage.images-bn.com/pimages/9781984806758_p0_v6_s600x595.jpg",
        "author": "Emily Henry",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Caraval (Caraval Series #1)",
        "description": "\nThe acclaimed New York Times bestseller! Welcome, welcome to Caraval&#8212;Stephanie Garber&#8217;s sweeping tale of the unbreakable bond between two sisters. It&#8217;s the closest you'll ever find to magic in this world...Scarlett has never left the tiny island where she and her beloved sister, Tella, live with their powerful, and cruel, father. Now Scarlett&#8217;s father has arranged a marriage for her, and Scarlett thinks her dreams of seeing Caraval, the far-away, once-a-year performance where the audience participates in the show, are over.But this year, Scarlett&#8217;s long-dreamt of invitation finally arrives. With the help of a mysterious sailor, Tella whisks Scarlett away to the show. Only, as soon as they arrive, Tella is kidnapped by Caraval&#8217;s mastermind organizer, Legend. It turns out that this season&#8217;s Caraval revolves around Tella, and whoever finds her first is the winner.Scarlett has been told that everything that happens during Caraval is only an elaborate performance. But she nevertheless becomes enmeshed in a game of love, heartbreak, and magic with the other players in the game. And whether Caraval is real or not, she must find Tella before the five nights of the game are over, a dangerous domino effect of consequences is set off, and her sister disappears forever.Welcome, welcome to Caraval . . . beware of getting swept too far away.New York Times bestseller#1 IndieNext PickPublishers Weekly Flying StartEntertainment Weekly Best 10 YA Books of 2017Teen Vogue Best YA Book of the YearAmazon Best Book of the YearBarnes & Noble Best Book of the YearBuzzFeed Best Book of the Year&#8220;The Hunger Games meets The Night Circus. Grade&#58; A-.&#8221; &#8212;Entertainment Weekly&#8220;Impressive, original, wondrous.&#8221; &#8212;USA Today&#8220;Spellbinding.&#8221; &#8212;US Weekly&#8220;Magnificent.&#8221; &#8212;Publishers Weekly, starred review&#8220;I lost myself in this world.&#8221; &#8212;Sabaa Tahir, author of An Ember in the Ashes&#8220;Beautifully written.&#8221; &#8212;Ren&#233;e Ahdieh, author of The Wrath and the Dawn&#8220;Shimmers with magic.&#8221; &#8212;Marie Rutkoski, author of The Winner&#8217;s Curse&#8220;Darkly enchanting.&#8221; &#8212;Kiersten White, author of And I Darken&#8220;Decadent.&#8221; &#8212;Roshani Chokshi, author of The Star-Touched Queen&#8220;Like stepping into a living dream.&#8221; &#8212;Stacey Lee, author of Outrun the Moon&#8220;Destined to capture imaginations.&#8221; &#8212;Kirkus Reviews&#8220;Ideal for fans of The Night Circus, Stardust, and The Hunger Games.&#8221; &#8212;School Library Journal",
        "rating": 1,
        "price": "$11.99",
        "image": "//prodimage.images-bn.com/pimages/9781250095268_p0_v5_s600x595.jpg",
        "author": "Stephanie Garber",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Investigator",
        "description": "Letty Davenport, the brilliant and tenacious adopted daughter of Lucas Davenport, takes the investigative reins in the newest thriller from #1 bestselling author John Sandford. “Sandford fans rejoice! Davenport next generation has arrived and Letty is exactly the kind of cool-eyed, smart-mouthed, lethally dangerous heroine we've been waiting for.” --Lisa Gardner, author of One Step Too FarBy age twenty-four, Letty Davenport has seen more action and uncovered more secrets than many law enforcement professionals. Now a recent Stanford grad with a master's in economics, she's restless and bored in a desk job for U.S. Senator Colles. Letty's ready to quit, but her skills have impressed Colles, and he offers her a carrot: feet-on-the-ground investigative work, in conjunction with the Department of Homeland Security.  Several oil companies in Texas have reported thefts of crude, Colles tells her.  He isn't so much concerned with the oil as he is with the money: who is selling the oil, and what are they doing with the profits? Rumor has it that a fairly ugly militia group might be involved. Colles wants to know if the money is going to them, and if so, what they're planning.  Letty is partnered with a DHS investigator, John Kaiser, and they head to Texas.  When the case quicky turns deadly, they know they're on the track of something bigger.  The militia group has set in motion an explosive plan . . . and the clock is ticking down.",
        "rating": 1,
        "price": "$22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176132465_p0_v3_s600x595.jpg",
        "author": "John Sandford",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Great Hunt (The Wheel of Time Seires #2)",
        "description": "Now in development for TV!Since its debut in 1990, The Wheel of Time® by Robert Jordan has captivated millions of readers around the globe with its scope, originality, and compelling characters.The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow.For centuries, gleemen have told the tales of The Great Hunt of the Horn. So many tales about each of the Hunters, and so many Hunters to tell of...Now the Horn itself is found: the Horn of Valere long thought only legend, the Horn which will raise the dead heroes of the ages. And it is stolen.TV series update: \"Sony will produce along with Red Eagle Entertainment and Radar Pictures. Rafe Judkins is attached to write and executive produce. Judkins previously worked on shows such as ABC's \"Agents of SHIELD,\" the Netflix series \"Hemlock Grove,\" and the NBC series \"Chuck.\" Red Eagle partners Rick Selvage and Larry Mondragon will executive produce along with Radar's Ted Field and Mike Weber. Darren Lemke will also executive produce, with Jordan's widow Harriet McDougal serving as consulting producer.\" -VarietyThe Wheel of Time®New Spring: The Novel#1 The Eye of the World#2 The Great Hunt#3 The Dragon Reborn#4 The Shadow Rising#5 The Fires of Heaven#6 Lord of Chaos#7 A Crown of Swords#8 The Path of Daggers#9 Winter's Heart#10 Crossroads of Twilight#11 Knife of DreamsBy Robert Jordan and Brandon Sanderson#12 The Gathering Storm#13 Towers of Midnight#14 A Memory of LightBy Robert Jordan and Teresa PattersonThe World of Robert Jordan's The Wheel of TimeBy Robert Jordan, Harriet McDougal, Alan Romanczuk, and Maria SimonsThe Wheel of Time CompanionBy Robert Jordan and Amy RomanczukPatterns of the Wheel: Coloring Art Based on Robert Jordan's The Wheel of Time",
        "rating": 1,
        "price": "$44.99",
        "image": "//prodimage.images-bn.com/pimages/2940172067624_p0_v1_s600x595.jpg",
        "author": "Robert Jordan",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Deal",
        "description": "\nNew York Times bestseller Elle Kennedy brings you the first in the sexy Off-Campus series that everyone is talking about.She's about to make a deal with the college bad boy...Hannah Wells has finally found someone who turns her on. But while she might be confident in every other area of her life, she's carting around a full set of baggage when it comes to sex and seduction. If she wants to get her crush's attention, she'll have to step out of her comfort zone and make him take notice...even if it means tutoring the annoying, childish, cocky captain of the hockey team in exchange for a pretend date....and it's going to be oh so goodAll Garrett Graham has ever wanted is to play professional hockey after graduation, but his plummeting GPA is threatening everything he's worked so hard for. If helping a sarcastic brunette make another guy jealous will help him secure his position on the team, he's all for it. But when one unexpected kiss leads to the wildest sex of both their lives, it doesn't take long for Garrett to realize that pretend isn't going to cut it. Now he just has to convince Hannah that the man she wants looks a lot like him.",
        "rating": 1,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9781775293934_p0_v8_s600x595.jpg",
        "author": "Elle Kennedy",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Fevered Star",
        "description": "Return to The Meridian with New York Times bestselling author Rebecca Roanhorse's sequel to the most critically hailed epic fantasy of 2020 Black Sun-finalist for the Hugo, Nebula, Lambda, and Locus awards.There are no tides more treacherous than those of the heart. -Teek saying The great city of Tova is shattered. The sun is held within the smothering grip of the Crow God's eclipse, but a comet that marks the death of a ruler and heralds the rise of a new order is imminent. The Meridian: a land where magic has been codified and the worship of gods suppressed. How do you live when legends come to life, and the faith you had is rewarded? As sea captain Xiala is swept up in the chaos and currents of change, she finds an unexpected ally in the former Priest of Knives. For the Clan Matriarchs of Tova, tense alliances form as far-flung enemies gather and the war in the heavens is reflected upon the earth. And for Serapio and Naranpa, both now living avatars, the struggle for free will and personhood in the face of destiny rages. How will Serapio stay human when he is steeped in prophecy and surrounded by those who desire only his power? Is there a future for Naranpa in a transformed Tova without her total destruction? Welcome back to the fantasy series of the decade in Fevered Star-book two of Between Earth and Sky.",
        "rating": 1,
        "price": "$24.99",
        "image": "//prodimage.images-bn.com/pimages/2940173289476_p0_v2_s600x595.jpg",
        "author": "Rebecca Roanhorse",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Seven Husbands of Evelyn Hugo: A Novel",
        "description": "From Taylor Jenkins Reid, \"a genius when it comes to stories about life and love\" (Redbook), comes an unforgettable and sweeping novel about one classic film actress's relentless rise to the top—the risks she took, the loves she lost, and the long-held secrets the public could never imagine.Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one in the journalism community is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband, David, has left her, and her career has stagnated. Regardless of why Evelyn has chosen her to write her biography, Monique is determined to use this opportunity to jumpstart her career. Summoned to Evelyn's Upper East Side apartment, Monique listens as Evelyn unfurls her story: from making her way to Los Angeles in the 1950s to her decision to leave show business in the late 80s, and, of course, the seven husbands along the way. As Evelyn's life unfolds—revealing a ruthless ambition, an unexpected friendship, and a great forbidden love—Monique begins to feel a very a real connection to the actress. But as Evelyn's story catches up with the present, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways. Written with Reid's signature talent for \"creating complex, likable characters\" (Real Simple), this is a fascinating journey through the splendor of Old Hollywood into the harsh realities of the present day as two women struggle with what it means—and what it takes—to face the truth.",
        "rating": 2,
        "price": "$23.99",
        "image": "//prodimage.images-bn.com/pimages/2940170625024_p0_v2_s600x595.jpg",
        "author": "Taylor Jenkins Reid",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Paris Apartment",
        "description": "THE #1 NEW YORK TIMES BESTSELLER\"As you patiently await season two of Only Murders in the Building, cozy up with Lucy Foley's latest whodunnit.\" -- Parade\"Exceedingly clever.\" -- BooklistFrom the New York Times bestselling author of The Guest List comes a new locked room mystery, set in a Paris apartment building in which every resident has something to hide¿ Jess needs a fresh start. She's broke and alone, and she's just left her job under less than ideal circumstances. Her half-brother Ben didn't sound thrilled when she asked if she could crash with him for a bit, but he didn't say no, and surely everything will look better from Paris. Only when she shows up - to find a very nice apartment, could Ben really have afforded this? - he's not there.The longer Ben stays missing, the more Jess starts to dig into her brother's situation, and the more questions she has. Ben's neighbors are an eclectic bunch, and not particularly friendly. Jess may have come to Paris to escape her past, but it's starting to look like it's Ben's future that's in question.The socialite - The nice guy - The alcoholic - The girl on the verge - The conciergeEveryone's a neighbor. Everyone's a suspect. And everyone knows something they're not telling.",
        "rating": 4,
        "price": "$27.99",
        "image": "//prodimage.images-bn.com/pimages/2940173246851_p0_v3_s600x595.jpg",
        "author": "Lucy Foley",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Pawn and The Puppet",
        "description": "\nThe Emerald Lake Asylum is not a place most desire to go. Nineteen year old, Skylenna, however, made a promise that she must keep. Once hired, she only has one purpose&#x2014;prove to the council that barbaric treatments, such as waterboarding, scalding baths, and beatings, are no longer the answer. But that all takes pause when she meets the source of terror in the asylum. A patient with a split personality&#x2014;on one side, he's the bloodthirsty genius, Dessin. On the other, a hidden persona that is buried deep in his subconscious.When Dessin is caught in an attempted cell break, he faces execution if Skylenna can't bring out his core personality and reveal his humanity. She has ninety days to save his life, and the only way to do that is to let him consume her into his world of moves, counter-moves, and master puppeteering. With each passing day, their bond deepens, a forbidden attraction forming against her best judgments. Little by little, Skylenna uncovers the sinister secrets of his past that turned him into the monster everyone else fears. And Dessin proves to have one weakness despite the terrifying, indestructible persona he presents to the world: her.Please Note: This book contains explicit content and darker elements. Check trigger warnings before reading&#x00a0;It is not intended for anyone under 18 years of age. Trigger Warnings (revised version has been updated that corrects misrepresentation and triggering content) :&#x00a0;gratuitous violence, depression, suicide, torture, domestic violence, eating disorders, hallucinations, misogyny, poisoning, sexual assault, rape, child sexual assault, pedophilia, misrepresentation and dangerous portrayal of the transgender community (removed in revised edition), romanticized mental illness, gore, death of a loved one, child abuse, decapitation, female oppression, hostage situation, body shaming, panic attacks, incest, emotional trauma, child sex trafficking",
        "rating": 2,
        "price": "$25.99",
        "image": "//prodimage.images-bn.com/pimages/9798985593419_p0_v1_s600x595.jpg",
        "author": "Brandi Elise Szeker",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Book Lovers",
        "description": "“One of my favorite authors.”-Colleen HooverAn insightful, delightful, instant #1 New York Times bestseller from the author of Beach Read and People We Meet on Vacation. Named a Most Anticipated Book of 2022 by Oprah Daily ¿ Today ¿ Parade ¿ Marie Claire ¿ Bustle ¿ PopSugar ¿ Katie Couric Media ¿ Book Bub ¿ SheReads ¿ Medium ¿ The Washington Post ¿ and more!One summer. Two rivals. A plot twist they didn't see coming... Nora Stephens' life is books-she's read them all-and she is not that type of heroine. Not the plucky one, not the laidback dream girl, and especially not the sweetheart. In fact, the only people Nora is a heroine for are her clients, for whom she lands enormous deals as a cutthroat literary agent, and her beloved little sister Libby. Which is why she agrees to go to Sunshine Falls, North Carolina for the month of August when Libby begs her for a sisters' trip away-with visions of a small town transformation for Nora, who she's convinced needs to become the heroine in her own story. But instead of picnics in meadows, or run-ins with a handsome country doctor or bulging-forearmed bartender, Nora keeps bumping into Charlie Lastra, a bookish brooding editor from back in the city. It would be a meet-cute if not for the fact that they've met many times and it's never been cute. If Nora knows she's not an ideal heroine, Charlie knows he's nobody's hero, but as they are thrown together again and again-in a series of coincidences no editor worth their salt would allow-what they discover might just unravel the carefully crafted stories they've written about themselves.",
        "rating": 2,
        "price": "$22.50",
        "image": "//prodimage.images-bn.com/pimages/2940176169102_p0_v3_s600x595.jpg",
        "author": "Emily Henry",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Becoming (Dragon Heart Legacy Series #2)",
        "description": "A new epic of love and war among gods and humans, from Nora Roberts-the #1 New York Times bestselling author of The Awakening.The world of magick and the world of man have long been estranged from one another. But some can walk between the two-including Breen Siobhan Kelly. She has just returned to Talamh, with her friend, Marco, who's dazzled and disoriented by this realm-a place filled with dragons and faeries and mermaids (but no WiFi, to his chagrin). In Talamh, Breen is not the ordinary young schoolteacher he knew her as. Here she is learning to embrace the powers of her true identity. Marco is welcomed kindly by her people-and by Keegan, leader of the Fey. Keegan has trained Breen as a warrior, and his yearning for her has grown along with his admiration of her strength and skills.But one member of Breen's bloodline is not there to embrace her. Her grandfather, the outcast god Odran, plots to destroy Talamh-and now all must unite to defeat his dark forces. There will be losses and sorrows, betrayal and bloodshed. But through it, Breen Siobhan Kelly will take the next step on the journey to becoming all that she was born to be.A Macmillan Audio production from St. Martin's Press",
        "rating": 3,
        "price": "$32.99",
        "image": "//prodimage.images-bn.com/pimages/2940177236346_p0_v1_s600x595.jpg",
        "author": "Nora Roberts",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Bully (Fall Away Series #1)",
        "description": "\nNew York Times&#160;and&#160;USA Today&#160;bestselling author Penelope Douglas delivers an unforgettable romance that toes the fine line between love and hate&hellip;.&#160; &#160; My name is Tate. He doesn&rsquo;t call me that, though. He would never refer to me by a friendly nickname. No, he&rsquo;ll barely even speak to me. But he still won&rsquo;t leave me alone. We were best friends once. Then he turned on me and made it his mission to ruin my life. I was humiliated, shut out, and gossiped about all through high school. His pranks and rumors got worse as time wore on, and I made myself sick trying to stay out of his way. I even went away for a year just to avoid him. But I&rsquo;m done hiding from him now, and there&rsquo;s no way I&rsquo;ll allow him to ruin another year. He might not have changed, but I have. It&rsquo;s time to fight back.",
        "rating": 4,
        "price": "$17.00",
        "image": "//prodimage.images-bn.com/pimages/9780451477101_p0_v3_s600x595.jpg",
        "author": "Penelope Douglas",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The House in the Cerulean Sea",
        "description": "Lambda Literary Award-winning author TJ Klune's breakout contemporary fantasyLinus Baker is a by-the-book case worker in the Department in Charge of Magical Youth. He's tasked with determining whether six dangerous magical children are likely to bring about the end of the world.Arthur Parnassus is the master of the orphanage. He would do anything to keep the children safe, even if it means the world will burn. And his secrets will come to light.The House in the Cerulean Sea is an enchanting love story, masterfully told, about the profound experience of discovering an unlikely family in an unexpected place—and realizing that family is yours.A Macmillan Audio production from Tor Books",
        "rating": 4,
        "price": "$26.99",
        "image": "//prodimage.images-bn.com/pimages/2940171925529_p0_v1_s600x595.jpg",
        "author": "TJ Klune",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Malice",
        "description": "\nA princess isn&rsquo;t supposed to fall for an evil sorceress. But in this &ldquo;bewitching and fascinating&rdquo; (Tamora Pierce) retelling of &ldquo;Sleeping Beauty,&rdquo; true love is more than a simple fairy tale.&#160;&ldquo;Walter&rsquo;s spellbinding debut is for all the queer girls and women who&rsquo;ve been told to keep their gifts hidden and for those yearning to defy gravity.&rdquo;&mdash;O&#58; The Oprah MagazineOnce upon a time, there was a wicked fairy who, in an act of vengeance, cursed a line of princesses to die. A curse that could only be broken by true love&rsquo;s kiss. You&rsquo;ve heard this before, haven&rsquo;t you? The handsome prince. The happily ever after. Utter nonsense. Let me tell you, no one in Briar actually cares about what happens to its princesses. Not the way they care about their jewels and elaborate parties and charm-granting elixirs. I thought I didn&rsquo;t care, either.Until I met her.Princess Aurora. The last heir to Briar&rsquo;s throne. Kind. Gracious. The future queen her realm needs. One who isn&rsquo;t bothered that I am Alyce, the Dark Grace, abhorred and feared for the mysterious dark magic that runs in my veins. Humiliated and shamed by the same nobles who pay me to bottle hexes and then brand me a monster. Aurora says I should be proud of my gifts. That she . . . cares for me. Even though a power like mine was responsible for her curse.But with less than a year until that curse will kill her, any future I might see with Aurora is swiftly disintegrating&mdash;and she can&rsquo;t stand to kiss yet another insipid prince. I want to help her. If my power began her curse, perhaps it&rsquo;s what can lift it. Perhaps together we could forge a new world.Nonsense again. Because we all know how this story ends, don&rsquo;t we? Aurora is the beautiful princess. And I&mdash;I am the villain.Book One of the Malice Duology",
        "rating": 3,
        "price": "$17.00",
        "image": "//prodimage.images-bn.com/pimages/9781984818676_p0_v2_s600x595.jpg",
        "author": "Heather Walter",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781984818676_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p3_v5_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p4_v6_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Becoming (Dragon Heart Legacy Series #2)",
        "description": "A new epic of love and war among gods and humans, from Nora Roberts-the #1 New York Times bestselling author of The Awakening.The world of magick and the world of man have long been estranged from one another. But some can walk between the two-including Breen Siobhan Kelly. She has just returned to Talamh, with her friend, Marco, who's dazzled and disoriented by this realm-a place filled with dragons and faeries and mermaids (but no WiFi, to his chagrin). In Talamh, Breen is not the ordinary young schoolteacher he knew her as. Here she is learning to embrace the powers of her true identity. Marco is welcomed kindly by her people-and by Keegan, leader of the Fey. Keegan has trained Breen as a warrior, and his yearning for her has grown along with his admiration of her strength and skills.But one member of Breen's bloodline is not there to embrace her. Her grandfather, the outcast god Odran, plots to destroy Talamh-and now all must unite to defeat his dark forces. There will be losses and sorrows, betrayal and bloodshed. But through it, Breen Siobhan Kelly will take the next step on the journey to becoming all that she was born to be.A Macmillan Audio production from St. Martin's Press",
        "rating": 2,
        "price": "$32.99",
        "image": "//prodimage.images-bn.com/pimages/2940177236346_p0_v1_s600x595.jpg",
        "author": "Nora Roberts",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Red Queen (Red Queen Series #1)",
        "description": "\nThe #1 New York Times bestselling series!Red Queen, by #1 New York Times bestselling author Victoria Aveyard, is a sweeping tale of power, intrigue, and betrayal, perfect for fans of George R.R. Martin&#8217;s Game of Thrones series.Mare Barrow's world is divided by blood&#8212;those with common, Red blood serve the Silver-blooded elite, who are gifted with superhuman abilities. Mare is a Red, scraping by as a thief in a poor, rural village, until a twist of fate throws her in front of the Silver court. Before the king, princes, and all the nobles, she discovers she has an ability of her own.To cover up this impossibility, the king forces her to play the role of a lost Silver princess and betroths her to one of his own sons. As Mare is drawn further into the Silver world, she risks everything and uses her new position to help the Scarlet Guard&#8212;a growing Red rebellion&#8212;even as her heart tugs her in an impossible direction.One wrong move can lead to her death, but in the dangerous game she plays, the only certainty is betrayal.Plus don't miss Realm Breaker! Irresistibly action-packed and full of lethal surprises, this stunning fantasy series from Victoria Aveyard, #1 New York Times&#160;bestselling author of the Red Queen series, begins where hope is lost and asks&#58; When the heroes have fallen, who will take up the sword?",
        "rating": 5,
        "price": "$12.99",
        "image": "//prodimage.images-bn.com/pimages/9780062310644_p0_v2_s600x595.jpg",
        "author": "Victoria Aveyard",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Once Upon Another Time",
        "description": "Storybook characters collide in this first book in a new trilogy of twisted fairy tales from New York Times bestselling author James Riley, set in the world of his popular Half Upon a Time series-perfect for fans of Fablehaven and Chris Colfer's A Tale of Magic series!Five and a half feet might seem pretty tall for a twelve-year-old, but it's not when your parents are giants. Lena has kept the fact that she's a tiny giant secret, using magic to grow when out in the giant village. But hiding who she is has always felt wrong, even though she knows the other giants might not accept her. Fortunately, Lena has friends down in the Cursed City who understand that looking different doesn't make her less of a giant. Someone who knows not to judge by appearances is Jin, a young genie currently serving one thousand and thirty-eight years of genie training that requires him to fulfill the wish of whoever holds his magical ring. In Jin's case, it's the power-hungry Golden King. At least the king only has two wishes left, one of which is for Jin to go to the Cursed City and capture its protector, the Last Knight-one of Lena's closest friends. What Lena and Jin don't know is how close the Golden King's plans are to coming together, between his dark magic and his horrible Faceless knights. If Jin does find the Last Knight and bring him to the Golden King, why, that could doom the entire fairy-tale world. ¿This sounds like it'll end badly, doesn't it?",
        "rating": 2,
        "price": "$17.99",
        "image": "//prodimage.images-bn.com/pimages/2940173219411_p0_v4_s600x595.jpg",
        "author": "James Riley",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Practice of Adaptive Leadership: Tools and Tactics for Changing Your Organization and the World",
        "description": "When change requires you to challenge people's familiar reality, it can be difficult, dangerous work. Whatever the context-whether in the private or the public sector-many will feel threatened as you push though major changes. But as a leader, you need to find a way to make it work.Ron Heifetz first defined this problem with his distinctive theory of adaptive leadership in <I>Leadership Without Easy Answers. In a second book, <I>Leadership on the Line, Heifetz and coauthor Marty Linsky highlighted the individual and organizational dangers of leading through deep change in business, politics, and community life. Now, Heifetz, Linsky, and coauthor Alexander Grashow are taking the next step: <I>The Practice of Adaptive Leadership is a hands-on, practical guide containing stories, tools, and cases to help you develop your skills as an adaptive leader, able to take people outside their comfort zones and assess and address the toughest challenges.The authors have decades of experience helping people and organizations create cultures of adaptive leadership. In today's rapidly changing world, <I>The Practice of Adaptive Leadership can be your handbook to meeting the demands of leadership in the midst of complexity.",
        "rating": 3,
        "price": "$24.99",
        "image": "//prodimage.images-bn.com/pimages/2940176236880_p0_v1_s600x595.jpg",
        "author": "Ronald A. Heifetz",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Iron Widow",
        "description": "\nAn instant #1 New York Times bestseller!Pacific Rim meets The Handmaid's Tale in this blend of Chinese history and mecha science fiction for YA readers.The boys of Huaxia dream of pairing up with girls to pilot Chrysalises, giant transforming robots that can battle the mecha aliens that lurk beyond the Great Wall. It doesn't matter that the girls often die from the mental strain.&#160;When 18-year-old Zetian offers herself up as a concubine-pilot, it's to assassinate the ace male pilot responsible for her sister's death. But she gets her vengeance in a way nobody expected&mdash;she kills him through the psychic link between pilots and emerges from the cockpit unscathed. She is labeled an Iron Widow, a much-feared and much-silenced kind of female pilot who can sacrifice boys to power up Chrysalises instead.&#8203;&#160;To tame her unnerving yet invaluable mental strength, she is paired up with Li Shimin, the strongest&#160;and most controversial male pilot in Huaxia&#8203;. But now that Zetian has had a taste of power, she will not cower so easily. She will miss no opportunity to leverage their combined might and infamy to survive attempt after attempt on her life, until she can figure out exactly why the pilot system works in its misogynist way&mdash;and stop more girls from being sacrificed.",
        "rating": 4,
        "price": "$17.99",
        "image": "//prodimage.images-bn.com/pimages/9780735269934_p0_v3_s600x595.jpg",
        "author": "Xiran Jay Zhao",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "James Patterson by James Patterson: The Stories of My Life",
        "description": "<B>“It's quite a life, Patterson's, and this fizzing, funny, often deeply moving memoir is a perfect way to understand the dizzying world of a best-selling writer.\" -<I>Daily Mail <BR /><BR /> “Damn near addictive. I loved it . . . that Patterson guy can write!” -Ron Howard<BR /><BR /><B>THE INSTANT #1 <I>NEW YORK TIMES BESTSELLER-How did a kid whose dad lived in the poorhouse become the most successful storyteller in the world? On the morning he was born, he nearly died. Growing up, he didn't love to read.  That changed. He worked at a mental hospital in Massachusetts, where he met the singer James Taylor and the poet Robert Lowell.   While he toiled in advertising hell, James wrote the ad jingle line “I'm a Toys `R' Us Kid.” He once watched James Baldwin and Norman Mailer square off to trade punches at a party. He's only been in love twice.  Both times are amazing. Dolly Parton once sang “Happy Birthday” to James over the phone.  She calls him J.J., for Jimmy James.  Three American presidents have invited him to golf with them.  How did a boy from small-town New York become the world's most successful writer? How does he do it? He has always wanted to write the kind of novel that would be read and reread so many times that the binding breaks and the book literally falls apart. As he says, “I'm still working on that one.” <BR /><BR /><B><I>James Patterson by James Patterson<B> is the most anticipated memoir of 2022.",
        "rating": 2,
        "price": "$26.98",
        "image": "//prodimage.images-bn.com/pimages/2940176323207_p0_v4_s600x595.jpg",
        "author": "James Patterson",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Left on Tenth: A Second Chance at Life",
        "description": "<P><B>The bestselling, beloved writer of romantic comedies like <I>You've Got Mail tells her own late-in-life love story, complete with a tragic second act and joyous resolution. Delia Ephron had struggled through several years of heartbreak. She'd lost her sister, Nora, and then her husband, Jerry, both to cancer. Several months after Jerry's death, she decided to make one small change in her life-she shut down his landline, which crashed her internet. She ended up in Verizon hell.<BR /> <BR />She channeled her grief the best way she knew: by writing a <I>New York Times op-ed. The piece caught the attention of Peter, a Bay Area psychiatrist, who emailed her to commiserate. Recently widowed himself, he reminded her that they had shared a few dates fifty-four years before, set up by Nora. Delia did not remember him, but after several weeks of exchanging emails and sixties folk songs, he flew east to see her. They were crazy, utterly, in love.<BR /> <BR />But this was not a rom-com: four months later she was diagnosed with AML, a fierce leukemia.<BR /> <BR />In <I>Left on Tenth, Delia Ephron enchants as she seesaws us between tears and laughter, navigating the suicidal lows of enduring cutting-edge treatment and the giddy highs of a second chance at love. With Peter and her close girlfriends by her side, with startling clarity, warmth, and honesty about facing death, Ephron invites us to join her team of warriors and become believers ourselves.",
        "rating": 4,
        "price": "$27.98",
        "image": "//prodimage.images-bn.com/pimages/2940176260274_p0_v1_s600x595.jpg",
        "author": "Delia Ephron",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Legendborn",
        "description": "\nAn Instant New York Times Bestseller!<BR> Winner of the Coretta Scott King - John Steptoe for New Talent Author Award<BR> <BR>Filled with mystery and an intriguingly rich magic system, Tracy Deonn&rsquo;s YA contemporary fantasy reinvents the King Arthur legend and &ldquo;braids together Southern folk traditions and Black Girl Magic into a searing modern tale of grief, power, and self-discovery&rdquo; (Dhonielle Clayton, New York Times bestselling author of The Belles).<BR><BR>After her mother dies in an accident, sixteen-year-old Bree Matthews wants nothing to do with her family memories or childhood home. A residential program for bright high schoolers at UNC&#8211;Chapel Hill seems like the perfect escape&#8212;until Bree witnesses a magical attack her very first night on campus.<BR> <BR>A flying demon feeding on human energies.<BR> <BR>A secret society of so called &ldquo;Legendborn&rdquo; students that hunt the creatures down.<BR> <BR>And a mysterious teenage mage who calls himself a &ldquo;Merlin&rdquo; and who attempts&#8212;and fails&#8212;to wipe Bree&rsquo;s memory of everything she saw.<BR> <BR>The mage&rsquo;s failure unlocks Bree&rsquo;s own unique magic and a buried memory with a hidden connection&#58; the night her mother died, another Merlin was at the hospital. Now that Bree knows there&rsquo;s more to her mother&rsquo;s death than what&rsquo;s on the police report, she&rsquo;ll do whatever it takes to find out the truth, even if that means infiltrating the Legendborn as one of their initiates.<BR> <BR>She recruits Nick, a self-exiled Legendborn with his own grudge against the group, and their reluctant partnership pulls them deeper into the society&rsquo;s secrets&#8212;and closer to each other. But when the Legendborn reveal themselves as the descendants of King Arthur&rsquo;s knights and explain that a magical war is coming, Bree has to decide how far she&rsquo;ll go for the truth and whether she should use her magic to take the society down&#8212;or join the fight.<BR> <BR>This paperback edition of Legendborn contains a teaser to the thrilling sequel, Bloodmarked, as well as an exclusive short story from Selwyn Kane's perspective!",
        "rating": 4,
        "price": "$13.99",
        "image": "//prodimage.images-bn.com/pimages/9781534441613_p0_v5_s600x595.jpg",
        "author": "Tracy Deonn",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Old Man",
        "description": "\n<B>Now an original series from FX starring Jeff Bridges, John Lithgow, and Amy Brenneman<B>: a retired intelligence officer living off the grid is caught in &ldquo;[a] harrowing hunt-and-hide adventure&rdquo; (<I>The New York Times).<BR><BR> To all appearances, Dan Chase is a harmless retiree in Vermont with two big mutts and a grown daughter he keeps in touch with by phone. But most sixty-year-old widowers don&rsquo;t have multiple driver&rsquo;s licenses, savings stockpiled in banks across the country, or two Beretta Nanos stashed in the spare bedroom closet. Most have not spent decades on the run.<BR><BR> Thirty-five years ago, as a young army intelligence hotshot, Chase was sent to Libya to covertly assist a rebel army. When the plan turned sour, Chase acted according to his conscience&mdash;and triggered consequences he never could have anticipated. To this day, someone still wants him dead. And just when he thought he was finally safe, Chase is confronted with the history he spent much of his life trying to escape.<BR><BR> Edgar Award&ndash;winning author Thomas Perry writes thrillers that move &ldquo;almost faster than a speeding bullet&rdquo; (<I>Wall Street Journal). <I>The Old Man is his latest whip-smart standalone novel, and has been adapted into a critically acclaimed television series starring Jeff Bridges as retired CIA Agent Dan Chase.<BR><BR> &ldquo;Perry drives deep into Jack Reacher territory in this stand-alone [novel]&#160;.&#160;.&#160;. Swift, unsentimental, and deeply satisfying.&rdquo; &mdash;<I>Kirkus Reviews",
        "rating": 5,
        "price": "$17.99",
        "image": "//prodimage.images-bn.com/pimages/9780802189769_p0_v6_s600x595.jpg",
        "author": "Thomas Perry",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Nightwork",
        "description": "#1 New York Times bestselling author Nora Roberts introduces an unforgettable thief in an unputdownable new novel¿Greed. Desire. Obsession. Revenge . . . It's all in a night's work.Harry Booth started stealing at nine to keep a roof over his ailing mother's head, slipping into luxurious, empty homes at night to find items he could trade for precious cash. When his mother finally succumbed to cancer, he left Chicago-but kept up his nightwork, developing into a master thief with a code of honor and an expertise in not attracting attention?or getting attached.Until he meets Miranda Emerson, and the powerful bond between them upends all his rules. But along the way, Booth has made some dangerous associations, including the ruthless Carter LaPorte, who sees Booth as a tool he controls for his own profit. Knowing LaPorte will leverage any personal connection, Booth abandons Miranda for her own safety-cruelly, with no explanation-and disappears.But the bond between Miranda and Booth is too strong, pulling them inexorably back together. Now Booth must face LaPorte, to truly free himself and Miranda once and for all. A Macmillan Audio production from St. Martin's Press.",
        "rating": 5,
        "price": "$26.99",
        "image": "//prodimage.images-bn.com/pimages/2940176379990_p0_v2_s600x595.jpg",
        "author": "Nora Roberts",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Hotel Nantucket",
        "description": "<B>“The queen of beach reads” (<I>New York Magazine) delivers an immensely satisfying page-turner in this tale about a summer of scandal at a storied Nantucket hotel.<BR /><BR />Fresh off a bad breakup with a longtime boyfriend, Nantucket sweetheart Lizbet Keaton is desperately seeking a second act. When she's named the new general manager of the Hotel Nantucket, a once Gilded Age gem turned abandoned eyesore, she hopes that her local expertise and charismatic staff can win the favor of their new London billionaire owner, Xavier Darling, as well as that of Shelly Carpenter, the wildly popular Instagram tastemaker who can help put them back on the map. And while the Hotel Nantucket appears to be a blissful paradise, complete with a celebrity chef-run restaurant and an idyllic wellness center, there's a lot of drama behind closed doors. The staff (and guests) have complicated pasts, and the hotel can't seem to overcome the bad reputation it earned in 1922 when a tragic fire killed nineteen-year-old chambermaid Grace Hadley. With Grace gleefully haunting the halls, a staff harboring all kinds of secrets, and Lizbet's own romantic uncertainty, is the Hotel Nantucket destined for success or doom?  <BR /><BR />Filled with the emotional depth and multiple points of view that characterize Hilderbrand's novels (<I>The Blue Bistro, Golden Girl) as well as an added dash of Roaring Twenties history, <I>The Hotel Nantucket offers something for everyone in this compelling summer drama.",
        "rating": 5,
        "price": "$26.98",
        "image": "//prodimage.images-bn.com/pimages/2940178756133_p0_v4_s600x595.jpg",
        "author": "Elin Hilderbrand",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Killing the Killers: The Secret War Against Terrorists",
        "description": "In the eleventh audiobook in the multimillion-selling Killing series, Bill O'Reilly and Martin Dugard reveal the startling, dramatic story of the global war against terrorists.In Killing The Killers, #1 bestselling authors Bill O'Reilly and Martin Dugard take listeners deep inside the global war on terror, which began twenty years ago on September 11, 2001.As the World Trade Center buildings collapsed, the Pentagon burned, and a small group of passengers fought desperately to stop a third plane from completing its deadly flight plan, America went on war footing. Killing The Killers narrates America's intense global war against extremists who planned and executed not only the 9/11 attacks, but hundreds of others in America and around the world, and who eventually destroyed entire nations in their relentless quest for power.Killing The Killers moves from Afghanistan to Iraq, Iran to Yemen, Syria, and Libya, and elsewhere, as the United States fought Al Qaeda, ISIS, and the Iranian Revolutionary Guard, as well as individually targeting the most notorious leaders of these groups. With fresh detail and deeply-sourced information, O'Reilly and Dugard create an unstoppable account of the most important war of our era.Killing The Killers is the most thrilling and suspenseful audiobook in the #1 bestselling series of popular history books (over 18 million sold) in the world.A Macmillan Audio production from St. Martin's Press",
        "rating": 2,
        "price": "$26.99",
        "image": "//prodimage.images-bn.com/pimages/2940176378412_p0_v2_s600x595.jpg",
        "author": "Bill O'Reilly",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Mary Astor's Purple Diary: The Great American Sex Scandal of 1936",
        "description": "\nA hilarious send-up of sex, scandal, and the Golden Age of Hollywood by legendary cartoonist Edward Sorel. In 1965, a young, up-and-coming illustrator by the name of Edward Sorel tore away layer after layer of linoleum from the floor of his $97-a-month Manhattan apartment until he discovered a hidden treasure: issues of the New York Daily News and Daily Mirror from 1936, each ablaze with a scandalous child custody trial taking place in Hollywood starring the actress Mary Astor&#8212;and the journal in which she detailed her numerous affairs. Thus began a half-century obsession that reached its peak in Mary Astor&#8217;s Purple Diary, &#8220;a thoroughly charming&#8221; (New York Times Book Review,&#160;front-page review) account of the scandal in which Sorel narrates and illustrates the travails of the Oscar-winning actress alongside his own personal story of discovering an unlikely muse. Now in a stunning paperback, featuring more than sixty ribald and rapturous original illustrations, Mary Astor&#8217;s Purple Diary is the life&#8217;s masterpiece of one of America&#8217;s greatest illustrators. &#160;",
        "rating": 1,
        "price": "$17.95",
        "image": "//prodimage.images-bn.com/pimages/9781631490248_p0_v4_s600x595.jpg",
        "author": "Edward Sorel",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "One Last Stop",
        "description": "\n*INSTANT NEW YORK TIMES BESTSELLER**INSTANT USA TODAY BESTSELLER**INSTANT #1 INDIE BESTSELLER*From the New York Times bestselling author of Red, White & Royal Blue comes a new romantic comedy that will stop readers in their tracks...For cynical twenty-three-year-old August, moving to New York City is supposed to prove her right&#58; that things like magic and cinematic love stories don&#8217;t exist, and the only smart way to go through life is alone. She can&#8217;t imagine how waiting tables at a 24-hour pancake diner and moving in with too many weird roommates could possibly change that. And there&#8217;s certainly no chance of her subway commute being anything more than a daily trudge through boredom and electrical failures.But then, there&#8217;s this gorgeous girl on the train. Jane. Dazzling, charming, mysterious, impossible Jane. Jane with her rough edges and swoopy hair and soft smile, showing up in a leather jacket to save August&#8217;s day when she needed it most. August&#8217;s subway crush becomes the best part of her day, but pretty soon, she discovers there&#8217;s one big problem&#58; Jane doesn&#8217;t just look like an old school punk rocker. She&#8217;s literally displaced in time from the 1970s, and August is going to have to use everything she tried to leave in her own past to help her. Maybe it&#8217;s time to start believing in some things, after all.Casey McQuiston&#8217;s One Last Stop is a magical, sexy, big-hearted romance where the impossible becomes possible as August does everything in her power to save the girl lost in time.\"A dazzling romance, filled with plenty of humor and heart.\" - Time Magazine, \"The 21 Most Anticipated Books of 2021\"\"Dreamy, other worldly, smart, swoony, thoughtful, hilarious - all in all, exactly what you'd expect from Casey McQuiston!\" - Jasmine Guillory, New York Times bestselling author of The Proposal and Party for Two",
        "rating": 3,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9781250244499_p0_v4_s600x595.jpg",
        "author": "Casey McQuiston",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Second Mrs. Astor: A Heartbreaking Historical Novel of the Titanic",
        "description": "\n<B>\"Ab&eacute;&#160;is an exquisite storyteller. Rich in detail and deeply moving.\"<B> &mdash;<B>Fiona Davis, <I>New York Times bestselling author of <I>The Magnolia Palace<BR><BR><B>\"One of the most beautifully written books I&rsquo;ve ever had the pleasure to read. A gorgeous, phenomenal novel I won&rsquo;t soon forget.&rdquo;<B> &mdash;Ellen Marie Wiseman <I>New York Times bestselling Author of <I>The Orphan Collector<BR><BR><B>Perfect for fans of Jennifer Chiaverini and Marie Benedict, this riveting novel takes you inside the scandalous courtship and catastrophic honeymoon aboard the <I>Titanic of the most famous couple of their time&mdash;John Jacob Astor and Madeleine Force. Told in rich detail, this novel of sweeping historical fiction will stay with readers long after turning the last page.<BR><BR> Madeleine Talmage Force is just seventeen when she attracts the attention of John Jacob &ldquo;Jack&rdquo; Astor. Madeleine is beautiful, intelligent, and solidly upper-class, but the Astors are in a league apart. Jack&rsquo;s mother was <I>the Mrs. Astor, American royalty and New York&rsquo;s most formidable socialite. Jack is dashing and industrious&mdash;a hero of the Spanish-American war, an inventor, and a canny businessman. Despite their twenty-nine-year age difference, and the scandal of Jack&rsquo;s recent divorce, Madeleine falls headlong into love&mdash;and becomes the press&rsquo;s favorite target.<BR><BR> On their extended honeymoon in Egypt, the newlyweds finally find a measure of peace from photographers and journalists. Madeleine feels truly alive for the first time&mdash;and is happily pregnant. The couple plans to return home in the spring of 1912, aboard an opulent new ocean liner. When the ship hits an iceberg close to midnight on April 14th, there is no immediate panic. The swift, state-of-the-art <I>RMS Titanic seems unsinkable. As Jack helps Madeleine into a lifeboat, he assures her that he&rsquo;ll see her soon in New York&hellip;<BR><BR> Four months later, at the Astors&rsquo; Fifth Avenue mansion, a widowed Madeleine gives birth to their son. In the wake of the disaster, the press has elevated her to the status of virtuous, tragic heroine. But Madeleine&rsquo;s most important decision still lies ahead: whether to accept the role assigned to her, or carve out her own remarkable path&hellip;<BR> &#160;<BR><B>&ldquo;A&#160;touching, compelling,&#160;and haunting love story that will delight fans of historical fiction&#160;and&#160;enthrall those of us for whom the <I>Titanic will always fascinate.&rdquo;<BR> &mdash;<B>Hazel<B> Gaynor, <I>New York Times bestselling author of <I>When We Were Young and Brave<BR> &#160;<BR><B>&ldquo;An engaging novel told with both heartbreaking care and vivid detail. <I>The Second Mrs. Astor is historical fiction at its gripping and irresistible best.&rdquo;<BR><B>&mdash;Patti Callahan , New York Times bestselling author of Surviving Savannah and Becoming Mrs. Lewis",
        "rating": 4,
        "price": "$14.43",
        "image": "//prodimage.images-bn.com/pimages/9781496732057_p0_v2_s600x595.jpg",
        "author": "Shana Abé",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Husband Material",
        "description": "\n\"Our favourite chaos demon & stern brunch daddy return in this delicious, ridiculous, and often poignant romcom about all the ways love can grow.\" &#8212;Talia Hibbert, New York Times and USA Today bestselling authorWANTED: One (very real) husband, nowhere near perfect but desperately trying his bestIn BOYFRIEND MATERIAL, Luc and Oliver met, pretended to fall in love, fell in love for real, dealt with heartbreak and disappointment and family and friends...and somehow figured out a way to make it work. Now it seems like everyone around them is getting married, and Luc's feeling the social pressure to propose. But it'll take more than four weddings, a funeral, and a hotly contested rainbow balloon arch to get these two from \"I don't know what I'm doing\" to \"I do\".Good thing Oliver is such perfect HUSBAND MATERIAL.\"Brilliance on every single page.\"&#8212;Christina Lauren, New York Times and USA Today bestselling author, for Boyfriend Material\"The apotheosis of the rom-com.\"&#8212;Entertainment Weekly, A+ Review, for Boyfriend Material\"Every once in a while you read a book that you want to SCREAM FROM ROOFTOPS about. I'm screaming, people!\"&#8212;Sonali Dev, award-winning author, for Boyfriend Material\"FAKE DATING, REAL FEELINGS, BEST JOKES.\"&#8212;Olivia Waite, award-winning author, for Boyfriend Material\"Fresh and vibrant.\"&#8212;Annie Carl, The Neverending Bookshop (Edmonds, WA), for Boyfriend Material",
        "rating": 1,
        "price": "$9.99",
        "image": "//prodimage.images-bn.com/pimages/9781728250946_p0_v3_s600x595.jpg",
        "author": "Alexis Hall",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "The Tsar of Love and Techno: Stories",
        "description": "From the New York Times bestselling author of A Constellation of Vital Phenomena-dazzling, poignant, and lyrical interwoven stories about family, sacrifice, the legacy of war, and the redemptive power of art.This stunning, exquisitely written collection introduces a cast of remarkable characters whose lives intersect in ways both life-affirming and heartbreaking. A 1930s Soviet censor painstakingly corrects offending photographs, deep underneath Leningrad, bewitched by the image of a disgraced prima ballerina. A chorus of women recount their stories and those of their grandmothers, former gulag prisoners who settled their Siberian mining town. Two pairs of brothers share a fierce, protective love. Young men across the former USSR face violence at home and in the military. And great sacrifices are made in the name of an oil landscape unremarkable except for the almost incomprehensibly peaceful past it depicts. In stunning prose, with rich character portraits and a sense of history reverberating into the present, The Tsar of Love and Techno is a captivating work from one of our greatest new talents.",
        "rating": 4,
        "price": "$20.00",
        "image": "//prodimage.images-bn.com/pimages/2940169061505_p0_v3_s600x595.jpg",
        "author": "Anthony Marra",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Malice",
        "description": "\nA princess isn&rsquo;t supposed to fall for an evil sorceress. But in this &ldquo;bewitching and fascinating&rdquo; (Tamora Pierce) retelling of &ldquo;Sleeping Beauty,&rdquo; true love is more than a simple fairy tale.&#160;&ldquo;Walter&rsquo;s spellbinding debut is for all the queer girls and women who&rsquo;ve been told to keep their gifts hidden and for those yearning to defy gravity.&rdquo;&mdash;O&#58; The Oprah MagazineOnce upon a time, there was a wicked fairy who, in an act of vengeance, cursed a line of princesses to die. A curse that could only be broken by true love&rsquo;s kiss. You&rsquo;ve heard this before, haven&rsquo;t you? The handsome prince. The happily ever after. Utter nonsense. Let me tell you, no one in Briar actually cares about what happens to its princesses. Not the way they care about their jewels and elaborate parties and charm-granting elixirs. I thought I didn&rsquo;t care, either.Until I met her.Princess Aurora. The last heir to Briar&rsquo;s throne. Kind. Gracious. The future queen her realm needs. One who isn&rsquo;t bothered that I am Alyce, the Dark Grace, abhorred and feared for the mysterious dark magic that runs in my veins. Humiliated and shamed by the same nobles who pay me to bottle hexes and then brand me a monster. Aurora says I should be proud of my gifts. That she . . . cares for me. Even though a power like mine was responsible for her curse.But with less than a year until that curse will kill her, any future I might see with Aurora is swiftly disintegrating&mdash;and she can&rsquo;t stand to kiss yet another insipid prince. I want to help her. If my power began her curse, perhaps it&rsquo;s what can lift it. Perhaps together we could forge a new world.Nonsense again. Because we all know how this story ends, don&rsquo;t we? Aurora is the beautiful princess. And I&mdash;I am the villain.Book One of the Malice Duology",
        "rating": 4,
        "price": "$17.00",
        "image": "//prodimage.images-bn.com/pimages/9781984818676_p0_v2_s600x595.jpg",
        "author": "Heather Walter",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9781984818676_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p3_v5_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9781984818676_p4_v6_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Where the Crawdads Sing: A Novel",
        "description": "How long can you protect your heart?For years, rumors of the \"Marsh Girl\" have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life—until the unthinkable happens.Perfect for fans of Barbara Kingsolver and Karen Russell, Where the Crawdads Sing is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps.",
        "rating": 4,
        "price": "$22.50",
        "image": "//prodimage.images-bn.com/pimages/2940169470185_p0_v3_s600x595.jpg",
        "author": "Delia Owens",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Love Hypothesis",
        "description": "\nThe Instant New York Times Bestseller and TikTok Sensation!As seen on THE VIEW!A BuzzFeed Best Summer Read of 2021 When a fake relationship between scientists meets the irresistible force of attraction, it throws one woman's carefully calculated theories on love into chaos.As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships&#151;but her best friend does, and that's what got her into this situation. Convincing Anh that Olive is dating and well on her way to a happily ever after was always going to take more than hand-wavy Jedi mind tricks&#58; Scientists require proof. So, like any self-respecting biologist, Olive panics and kisses the first man she sees.That man is none other than Adam Carlsen, a young hotshot professor&#151;and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend. But when a big science conference goes haywire, putting Olive's career on the Bunsen burner, Adam surprises her again with his unyielding support and even more unyielding...six-pack abs.Suddenly their little experiment feels dangerously close to combustion. And Olive discovers that the only thing more complicated than a hypothesis on love is putting her own heart under the microscope.",
        "rating": 5,
        "price": "$16.00",
        "image": "//prodimage.images-bn.com/pimages/9780593336823_p0_v6_s600x595.jpg",
        "author": "Ali Hazelwood",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "I Will Die in a Foreign Land",
        "description": "\n* 2022 Young Lions Fiction Award, Winner.* VCU Cabell First Novelist Award, Longlist.* An ABA &#34;Indie Next List&#34; pick for November 2021.* &#34;A Best Book of 2021&#34; &#8212;New York Public Library,&#160;Cosmopolitan,&#160;Independent Book Review* &#34;October 2021 Must-Reads&#34;&#160;&#8212;Debutiful,&#160;The Chicago Review of Books,&#160;The MillionsIn 1913, a Russian ballet incited a riot in Paris at the new Th&#233;&#226;tre de Champs-Elys&#233;es. &#8220;Only a Russian could do that,&#34; says Aleksandr Ivanovich. &#8220;Only a Russian could make the whole world go mad.&#8221;A century later, in November 2013, thousands of Ukrainian citizens gathered at Independence Square in Kyiv to protest then-President Yanukovych&#8217;s failure to sign a referendum with the European Union, opting instead to forge a closer alliance with President Vladimir Putin and Russia. The peaceful protests turned violent when military police shot live ammunition into the crowd, killing over a hundred civilians.I Will Die in a Foreign Land follows four individuals over the course of a volatile Ukrainian winter, as their lives are forever changed by the Euromaidan protests. Katya is an Ukrainian-American doctor stationed at a makeshift medical clinic in St. Michael&#8217;s Monastery; Misha is an engineer originally from Pripyat, who has lived in Kyiv since his wife&#8217;s death; Slava is a fiery young activist whose past hardships steel her determination in the face of persecution; and Aleksandr Ivanovich, a former KGB agent, who climbs atop a burned-out police bus at Independence Square and plays the piano.As Katya, Misha, Slava, and Aleksandr&#8217;s lives become intertwined, they each seek their own solace during an especially tumultuous and violent period. The story is also told by a chorus of voices that incorporates folklore and narrates a turbulent Slavic history.While unfolding an especially moving story of quiet beauty and love in a time of terror, I Will Die in a Foreign Land is an ambitious, intimate, and haunting portrait of human perseverance and empathy.&#34;Kalani Pickhart's timely debut novel, I Will Die In a Foreign Land, is about the 2014 Ukrainian revolution which provided a pretense for Russia to annex Crimea.&#160;The story follows the experiences of several characters whose lives intersect as the country's political situation deteriorates. There's a Ukrainian-American doctor, an old KGB spy, a former mine worker, and others, and these episodes are interspersed with folk songs, news reports and historical notes.&#160;The effect&#8212;kaleidoscopic but never confusing&#8212;provides an intimate sense of a country convulsing, mourning, and somehow surviving.&#34;&#8212;CBS News, &#34;The Book Report: Recommendations from Washington Post critic Ron Charles&#34;(Watch the full video on CBS News, February 6, 2022).",
        "rating": 3,
        "price": "$9.99",
        "image": "//prodimage.images-bn.com/pimages/9781953387097_p0_v2_s600x595.jpg",
        "author": "Kalani Pickhart",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
        "description": "Tiny Changes, Remarkable ResultsNo matter your goals, Atomic Habits offers a proven framework for improving—every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.If you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.Clear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, listeners will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.Learn how to:Make time for new habits (even when life gets crazy);Overcome a lack of motivation and willpower;Design your environment to make success easier;Get back on track when you fall off course;...and much more.Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits—whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"Product_Tabs_loading_start\");\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10391,Starts-->\n<!-- Code Change For ATG-10391,Ends-->\n<!-- Code Change For ATG-10237,Ends-->\n\n\nRelated collections and offers\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nFor Your TBL (To Be Listened) List\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nTop Selling Audiobooks\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nThe Best Books to Listen to Now\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBuy One, Get One 50% Off Audiobooks\n\n\n\n\n\n\n\nli hidden>\nProduct Details\nRelated Subjects\nRead an Excerpt\n\n\n\n\n\n\n\nEditorial Reviews\n\n\nFrom the Publisher\nWall Street Journal bestsellerUSA Today bestsellerPublisher's Weekly bestsellerOne of Fast Company's 7 Best Business Books of 2018One of Business Insider's Best Self-Help Books of 2018\"A supremely practical and useful book. James Clear distills the most fundamental information about habit formation, so you can accomplish more by focusing on less.\" -Mark Manson, #1&#160;New York Times&#160;best-selling author of The Subtle Art of Not Giving a F*ck &#160; &ldquo;James Clear has spent years honing the art and studying the science of habits. This engaging, hands-on book is the guide you need to break bad routines and make good ones.&rdquo; -Adam Grant,&#160;New York Times&#160;best-selling author of Originals, Give and Take, and Option B with Sheryl Sandberg\"A special book that will change how you approach your day and live your life.\" -Ryan Holiday, bestselling author of The Obstacle is the Way and Ego is the Enemy&ldquo;As a physician attempting to help my patients build healthy habits to decrease and reverse chronic disease,&#160;Atomic Habits&#160;is the playbook I have been searching for. Not only does the book offer actionable items I can teach my patients, I can refer them to read and implement the ideas themselves. The format is powerful and simple. This should be taught in all medical schools.&rdquo;-Laurie Marbas, MD, United States Air Force veteran&ldquo;Atomic Habits was a great read. I learned a lot and think it&rsquo;ll be helpful to a lot of people.&rdquo; &mdash;Gayle King, co-anchor of CBS This Morning and editor-at-large for O, The Oprah Magazine &#160; &ldquo;Useful new book&rdquo; &ndash;Wall Street Journal &#160; &ldquo;In Atomic Habits, Clear will show you how to overcome a lack of motivation, change your environment to encourage success, and make time for new (and better) habits. &ndash;Glamour.com &#160; &ldquo;Atomic Habits is a great book for anyone who is frustrated with the way they can&rsquo;t seem to kick that one (or two dozen) bad habit(s) and wants to finally achieve health, fitness, financial freedom, great relationships, and a good life.&rdquo; &ndash;Medium.com &#160; &ldquo;Excellent. Well worth the read.&rdquo;&#160;&ndash;Benjamin Hardy, Inc.com\n\n\n\nShow More\n\n\n\n\n\nProduct Details\n\n\n<!-- changes start for ATG-9471 -->\n\nBN ID:\n<!-- changes End for ATG-9471 -->\n2940169499674\n\n\nPublisher:\n\nPenguin Random House\n\n\n Publication date:\n03/12/2022\n\nEdition description:\nUnabridged\n\n\n\n\n\n\n\nRelated Subjects\n\n\nBehavioral Psychology\n\nEducational Psychology\n\nOrganization & Time Management Skills\n\nOrganizational Behavior - General & Miscellaneous\n\nPsychology of Education\n\nSelf-Improvement\n\nSuccess, Motivation & Self-Esteem\n\n\n\n\n\n\n\nRead an Excerpt\nIt is so easy to overestimate the importance of one defining moment and underestimate the value of making small improvements on a daily basis. Too often, we convince ourselves that massive success requires massive action. Whether it is losing weight, building a business, writ&shy;ing a book, winning a championship, or achieving any other goal, we put pressure on ourselves to make some earth- shattering improvement that everyone will talk about. <BR>(Continues&hellip;)hr noshade size='1'>Excerpted from &quot;Atomic Habits&quot; by . Copyright &copy 2018 James Clear. Excerpted by permission of Penguin Publishing Group. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher. Excerpts are provided by Dial-A-Book Inc. solely for the personal use of visitors to this web site. hr noshade size='1'>\n\n\n\n\n\n<!-- -->\n\n\nVideos\n\n<!-- -->\n<!-- CAP TITLE LENGTH -->\n\n<!-- \n -->\n\n\n\n\n\n\n\n<!-- \n -->\n<!-- -->\n\n\n\n<!-- -->\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Product_Tabs_loading_end\");\nperformance.measure(\n\"productTabsDur\",\n\"Product_Tabs_loading_start\",\n\"Product_Tabs_loading_end\"\n);\n}\n\n\n\n\n\nEditorial Reviews\n\nWall Street Journal bestsellerUSA Today bestsellerPublisher's Weekly bestsellerOne of Fast Company's 7 Best Business Books of 2018One of Business Insider's Best Self-Help Books of 2018\"A supremely practical and useful book. James Clear distills the most fundamental information about habit formation, so you can accomplish more by focusing on less.\" -Mark Manson, #1&#160;New York Times&#160;best-selling author of The Subtle Art of Not Giving a F*ck &#160; &ldquo;James Clear has spent years honing the art and studying the science of habits. This engaging, hands-on book is the guide you need to break bad routines and make good ones.&rdquo; -Adam Grant,&#160;New York Times&#160;best-selling author of Originals, Give and Take, and Option B with Sheryl Sandberg\"A special book that will change how you approach your day and live your life.\" -Ryan Holiday, bestselling author of The Obstacle is the Way and Ego is the Enemy&ldquo;As a physician attempting to help my patients build healthy habits to decrease and reverse chronic disease,&#160;Atomic Habits&#160;is the playbook I have been searching for. Not only does the book offer actionable items I can teach my patients, I can refer them to read and implement the ideas themselves. The format is powerful and simple. This should be taught in all medical schools.&rdquo;-Laurie Marbas, MD, United States Air Force veteran&ldquo;Atomic Habits was a great read. I learned a lot and think it&rsquo;ll be helpful to a lot of people.&rdquo; &mdash;Gayle King, co-anchor of CBS This Morning and editor-at-large for O, The Oprah Magazine &#160; &ldquo;Useful new book&rdquo; &ndash;Wall Street Journal &#160; &ldquo;In Atomic Habits, Clear will show you how to overcome a lack of motivation, change your environment to encourage success, and make time for new (and better) habits. &ndash;Glamour.com &#160; &ldquo;Atomic Habits is a great book for anyone who is frustrated with the way they can&rsquo;t seem to kick that one (or two dozen) bad habit(s) and wants to finally achieve health, fitness, financial freedom, great relationships, and a good life.&rdquo; &ndash;Medium.com &#160; &ldquo;Excellent. Well worth the read.&rdquo;&#160;&ndash;Benjamin Hardy, Inc.com\nFrom the Publisher\n\n\n\n\n\n<!-- Gigya Changes -->\n<!-- Gigya Changes -->\n\nCustomer Reviews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nscript defer>\n$(function() {\nvar isLoggedIn = false;\nvar ratingsParams = {\ncategoryID: 'Products',\nstreamID: '1129201155', /* use Product ID for unique identifier? SkuID? - prd2940169499674 - ProductID? */\ncontainerID: 'ratingsDisplay',\nwidth: '100%',\nshowCommentButton: false,\nratingTemplate: '',\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#ratingsDisplay'),\n// numRating = $(\".gig-average-review\").html();\n//SRL-2749\nnumRating = $('.gig-rating-stars').attr('title') || $(\".gig-average-review\").html() || 0;\nvar skutype = 'digitalAudiobook',\n$headerReviewLink = $('.sticky-left .gig-rating-readReviewsLink'),\nreviewCountTxt = $reviewLink.html();\nif($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n}\nelse if(skutype == 'book' || skutype == 'eBook'){\nif($reviewLink.html() === \"1 Review\"){\nreviewCountTxt = reviewCountTxt.replace(\"Review\", \"Customer Review\");\n}\nelse{\nreviewCountTxt = reviewCountTxt.replace(\"Reviews\", \"Customer Reviews\");\n}\n$headerReviewLink.html(reviewCountTxt);\n}\nvar widthOfAuthor= calculateWidthOfauthor();\nvar widthOfReadReviewsLink= parseInt($('.header-gigiya-wrapper .gig-rating-readReviewsLink').width());\nif($('.read-review-header').length)\t{\n$('.read-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\nif($('#EditorialReviews').length){\n$('.editorial-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\n$(\"#avgRating\").html(\"Average Rating: \" + numRating);\n//SRL-2749 : Star rating information is not clear\nvar ariaText = numRating + \" rating out of 5 Stars\";\n$(\".gig-rating-stars\").attr('aria-label',ariaText);\ninitBuyOptnsPDP();\n}\n},\nratingsParamsComments = {\ncategoryID: 'Products',\nstreamID: '1129201155',\ncontainerID: 'prodReviewInfo',\nratingTemplate:\n'' +\n'',\nwidth: '100%',\nshowCommentButton: false,\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#prodReviewInfo'),\nnumRating = $('#ratingsDisplay .gig-rating-stars').attr('title') || $(\".gig-average-review\").first().text() || 0;\nif ($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n$('.customer-reviews-body h3').hide();\n$('.reviews-view-all').hide();\n$('.customer-reviews-body').append('');\n}\n\n// Analytics set review and ratings\nif(typeof s_setP !== 'undefined' && typeof s_getP !== 'undefined') {\nvar digitalDataRating = s_getP('digitalData.product[0].attributes.rating'),\ndigitalDataReview = s_getP('digitalData.product[0].attributes.reviews'),\nnumReview = 0,\n$review = $('.gig-rating-readReviewsLink').first(),\nreviewStringParse = '';\nif($review.length > 0) {\nreviewStringParse = $review.text();\nnumReview = reviewStringParse.replace(/reviews/gi,'').trim();\n}\nif(typeof digitalDataRating == 'undefined' || digitalDataRating != numRating) {\ns_setP('digitalData.product[0].attributes.rating', parseFloat(numRating));\n}\n\nif((typeof digitalDataReview == 'undefined' || digitalDataReview != numReview) && !isNaN(numReview)) {\ns_setP('digitalData.product[0].attributes.reviews', parseInt(numReview, 10));\n}\n\n}\n// Gigya ratings and reviews loads after document is ready,\n// so direct call needs to called onload instead\n$(document).trigger('analytics-track-pdp');\n}\n},\nparams = {\ncategoryID: \"Products\",\nstreamID: \"1129201155\",\ncallback:updateDOM\n},\ncommentParams = {\nversion:2,\nsort: 'votesDesc',\nthreaded: true,\n\nthreadLimit: 3,\n\ncategoryID: 'Products',\nstreamID: '1129201155',\ncontainerID: 'reviews-list',\nwidth: '100%',\nuseSiteLogin: true,\nonLoad: function() {\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_ends\");\nperformance.measure(\n\"customerReviewsDur\",\n\"Customer_Reviews_Gigya_loading_starts\",\n\"Customer_Reviews_Gigya_loading_ends\"\n);\n}\n//ATG-23455 : remove fixed height for the comments container\n$('.gig-comments-more').on('click', function(){\n$('#reviews-list').css('height','100%');\n});\n//SRL-2731\n$('div.gig-simpleShareUI-button').each(function(){\nvar ariaTitle = $(this).find('.gig-simpleShareUI-buttonText').text();\n$(this).children('.gig-simpleShareUI-button-inner').attr({\nrole:'button',\ntitle : ariaTitle\n});\n});\n$('.gig-simpleShareUI-closeButton').attr('role', 'button');\n$('.gig-simpleShareUI-closeButton').attr('title','Close');\n//SRL-2731 ends\n//ATG-19340 starts\nvar adColumnHeight = $('#adcontainer1').outerHeight(true);\nif(adColumnHeight<19){\n$('.customer-reviews-body').css({'min-height': \"0px\"});\n}\n//ATG-19772 starts : to set min-height for mouse hover in customer-reviews\nelse{\n$('.customer-reviews-body').css({'min-height': \"300px\"});\n}\n//ATG-19772 ends\n//ATG-19340 ends\n//ADA SRL-2382\n$('.gig-comment-shareLink').each(function(){\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar triggerEle = $(this);\nvar focusPlaced = function(){\n$('.gig-simpleShareUI-closeButton').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-closeButton').focus();\n$('.gig-simpleShareUI-closeButton').on('keydown click',function(e){\nif(e.keyCode === 13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-buttonText-more').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$('.gig-simpleShareUI-buttonText-facebook').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-email').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-twitter').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-googleplus').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-messenger').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-linkedin').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-digg').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-delicious').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-hyves').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-baidu').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-more').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-facebook').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-email').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-twitter').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-googleplus').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-messenger').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-linkedin').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-digg').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-delicious').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-hyves').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-baidu').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\nvar socialModalFocus = function(){\n$('img[style=\"cursor:pointer;\"]:first').attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Close'\n});\n$(\"img[id$='arrow_left']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous'\n});\n$(\"img[id$='arrow_right']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next'\n});\n$(\"img[id$='arrow_right_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next Disabled'\n});\n$(\"img[id$='arrow_left_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous Disabled'\n});\n$('img[style=\"cursor:pointer;\"]:first').focus();\n$('img[style=\"cursor:pointer;\"]:first').on('keydown click',function(e){\nvar triggerElement = $(this);\nif(e.keyCode==13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$(\"img[id$='arrow_right']\").on('keydown',function(e){\nif((!e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:first').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_right_disable']\").on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$(\"img[id$='arrow_left']\").on('keydown',function(e){\nif((e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:last').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_left_disable']\").on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$('img[style=\"cursor:pointer;\"]:first').on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\nif($(\"img[id$='arrow_right']\").is(':visible')){\n$(\"img[id$='arrow_right']\").focus();\ne.preventDefault();\n}\nelse\n$('img[id$=\"arrow_right_disable\"]').focus();\ne.preventDefault();\n}\n});\n$(\"[id$='_showShareUI_bookmarksWidget_page']\").find(\"table\").each(function(){\n$(this).find(\"tr\").each(function(){\nif($(this).find(\"table\").length > 0){\n$(this).find(\"table\").each(function(){\n$(this).find(\"td\").each(function(){\nvar title = $(this).find(\"div\").attr(\"title\");\n$(this).find(\"div\").find(\"button\").attr(\"aria-label\",title);\n});\n});\n}\n});\n});\n}\n$('.gig-simpleShareUI-buttonText-more').on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\nelse if(!e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-closeButton').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\n});\n}\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\n});\n});\n$('.gig-comment-flag').each(function(){\nvar target=$(this);\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar focusGiven = function(){\n$('.gig-comments-dialog-close').attr({\n'tabindex' : '0',\n'role' : 'button',\n'title' : 'Close'\n});\n$('.gig-comments-dialog-button-ok').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-button-cancel').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-close').focus();\n$('.gig-comments-dialog-close').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-cancel').focus();\ne.preventDefault();\n}\n});\n$('.gig-comments-dialog-button-cancel').on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-ok').focus();\ne.preventDefault();\n}\nelse if(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\n});\n$('.gig-comments-dialog-button-ok').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\n});\n}\n$(this).attr('tabindex','0');\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nfocusGiven();\n}\nelse if(e.type == 'click'){\nfocusGiven();\n}\n});\n});\n$('.gig-comment-vote-pos').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-vote-neg').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-content').each(function(){\n$(this).attr('tabindex','0');\n});\n//ADA SRL-2382 ends\nvar reviewsContainer = $('#reviews-container');\nvar commentsContainer = $('.gig-comments-comments');\nvar pos = $('.gig-comment-vote-pos');\nvar neg = $('.gig-comment-vote-neg');\nif (commentsContainer.is(':empty')) {\nreturn;\n} else {\nreviewsContainer.removeClass('hidden');\n}\nif (!isLoggedIn) {\npos.addClass('sign-in-link');\nneg.addClass('sign-in-link');\n}\n/* SRL-461 : Providing suitable aria-label for the Like and Diskike button in Customer Reviews */\n$(\".gig-comment-self-data\").each(function(i) {\nvar like = $(this).find('.gig-comment-vote-pos').html() + \" people like this review.\" ;\nvar dislike = $(this).find('.gig-comment-vote-neg').html() + \" people dislike this review.\" ;\n$(this).find('.gig-comment-vote-pos').attr('aria-label',like);\n$(this).find('.gig-comment-vote-neg').attr('aria-label',dislike);\n});\n$(\".gig-comment-title\").each(function(index) {\nvar count = $(this).find(\".gig-comment-rating-star-full\").length;\nvar maxCount = $(this).find(\".gig-comment-rating-star\").length;\nvar reviewRating = \"This review rates \" + count + \" out of \" + maxCount + \" stars.\";\n$(this).prepend('Rating: ' + count + ' out of '+ maxCount + '');\n$(this).find(\".gig-comment-rating\").attr({\"aria-label\":reviewRating , \"role\":\"img\" , \"title\":count , \"alt\":count});\n});\n}\n};\nfunction updateDOM(response) {\nvar overallRating = response.streamInfo.avgRatings._overall;\nif ( response.errorCode == 0 ) {\n$(\".gig-average-review\").html(overallRating);\n}\n}\nfunction gotoReviews(eventObj) {\nvar skutype = 'digitalAudiobook',\n$reviewLink = $('.gig-rating-readReviewsLink'),\nreviewLocation = eventObj && eventObj.instanceID ? eventObj.instanceID : '',\nsetLocation = (reviewLocation === 'ratingsDisplay') ? 'topOfPage' : 'customerReviewsBox';\n$(document).triggerHandler('analytics-reviews-clicked', {location: setLocation});\nif ($reviewLink.html() === \"Be the first to write a review\") {\n$(\"#writeReviewBtn\").click();\n} else {\nif(skutype == 'book' || skutype == 'eBook'){\ndocument.getElementById('reviews').scrollIntoView();\n} else {\nwindow.location = \"/reviews/atomic-habits-james-clear/1129201155?ean=2940169499674#reviews-header\";\n}\n}\n}\nif(typeof gigya != 'undefined') {\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_starts\");\n}\n// gigya.comments.getStreamInfo(params);\n// gigya.comments.showRatingUI(ratingsParams);\n//gigya.comments.showRatingUI(ratingsParamsComments);\n//gigya.comments.showCommentsUI(commentParams);\n}\n});\nfunction calculateWidthOfauthor(){\nvar widthAuthor= 0;\nif($(\".header-gigiya-wrapper .sticky-author .contributors\").find(\"a\").length > 0){\n$('.header-gigiya-wrapper .sticky-author .contributors a').each(function(){\nwidthAuthor += parseFloat($(this).width())+ 12;\n});\n}\nelse{\nwidthAuthor += $(\".header-gigiya-wrapper .sticky-author .contributors\").width();\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Director')>-1){\nwidthAuthor +=45;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Cast')>-1){\nwidthAuthor +=25;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('by')>-1){\nwidthAuthor +=15;\n}\nreturn widthAuthor;\n}\n\n\n\n\n<!-- Internal Component Tracking - Begin -->\n<!-- Internal Component Tracking - End -->\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"BloomReach_Widget_loading_starts\");\n\n\n\n\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_starts\");\n}\n\n\n<!-- ATG-26331 remove google analytics-->\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_ends\");\nperformance.measure(\n\"globalFooterDur\",\n\"Global_Footer_loading_starts\",\n\"Global_Footer_loading_ends\"\n);\n}\n\n<!-- ATG-26338 : Add modal for PDP, PLP -->\n<!-- ATG-26338 : Ends -->\nvar isresponsive= true;\n<!-- All Javascripts in js-scripts-ra.jsp has to be minified. ALl JS has to be moved to release dir as per grunt minification -->\n\n$.webshims.setOptions('basePath','//js.js-bn.com/static/redesign/srcs/js/vendor/js-webshim-1.15/minified/shims/');\n$.webshims.polyfill('es5 forms forms-ext');\n\n\nscript defer async type=\"text/javascript\" src=\"https://request.eprotect.vantivcnp.com/eProtect/eProtect-api3.js\">\n\n\nif(!$.isEmptyObject(digitalData)){\nvar digitalData1 = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Behavioral Psychology\",\"Educational Psychology\",\"Organization & Time Management Skills\",\"Organizational Behavior - General & Miscellaneous\",\"Psychology of Education\",\"Self-Improvement\",\"Success, Motivation & Self-Esteem\"],\"productType\":\"digitalAudiobook\"},\"price\":{\"basePrice\":17.99},\"productInfo\":{\"departmentCode\":\"24\",\"sku\":\"2940169499674\",\"productName\":\"Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones\",\"productID\":\"prd2940169499674\",\"productURL\":\"/w/atomic-habits-james-clear/1129201155?ean=2940169499674\"},\"attributes\":{\"outOfStock\":false,\"reviews\":1,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":false,\"rating\":5,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"26E6244B01916F39CF0536A8654632CF\",\"serverName\":\"prodny_store02\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:25 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:atomic-habits-an-easy-proven-way-to-build-good-habits-break-bad-ones|1129201155\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060710847\"}}]}]};\n$.extend(digitalData,digitalData1);\n}else{\n\nvar digitalData = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Behavioral Psychology\",\"Educational Psychology\",\"Organization & Time Management Skills\",\"Organizational Behavior - General & Miscellaneous\",\"Psychology of Education\",\"Self-Improvement\",\"Success, Motivation & Self-Esteem\"],\"productType\":\"digitalAudiobook\"},\"price\":{\"basePrice\":17.99},\"productInfo\":{\"departmentCode\":\"24\",\"sku\":\"2940169499674\",\"productName\":\"Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones\",\"productID\":\"prd2940169499674\",\"productURL\":\"/w/atomic-habits-james-clear/1129201155?ean=2940169499674\"},\"attributes\":{\"outOfStock\":false,\"reviews\":1,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":false,\"rating\":5,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"26E6244B01916F39CF0536A8654632CF\",\"serverName\":\"prodny_store02\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:25 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:atomic-habits-an-easy-proven-way-to-build-good-habits-break-bad-ones|1129201155\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060710847\"}}]}]};\n\n}\nif (typeof s_setP !== 'undefined') {\ns_setP('digitalData.component[0].componentInfo.componentName','you may also like');\ns_setP('digitalData.component[0].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[0].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[1].componentInfo.componentName','more in this series');\ns_setP('digitalData.component[1].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[1].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[2].componentInfo.componentName','recently-viewed');\ns_setP('digitalData.component[2].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[2].componentInfo.primaryCategory','internal campaign');\n\n}\n$(document).ready(function(){\nif (typeof s_setP !== 'undefined') {\n\nBN.Analytics.PDP.init();\n\nBN.Analytics.Generic.GoogleAds();\n\n}\n});\n\n\n\n\n\nvar cname = \"internalCampaign\",\ncvalue = null;\nvar curCookie = cname + \"=\" + cvalue +\n\"; expires= Thu, 01 Jan 1970 00:00:01 GMT;\" +\n\"; path=\" + \"/\" +\n\"; domain=\" + SITE_DOMAIN;\ndocument.cookie = curCookie;\n\n\n/*Check id google ad needs to be loaded after page load*/\n\nvar asyncRelatedAdsEnabled = true;\nvar endemicAd = true;\n$(document).on('googleRelatedAdsLoaded', function() {\n\n})\n\n\n\n\n\n\n\n\n_satellite.pageBottom();\n\ndocument.write(\"<\\/script>\");\n/*CommerceHeaderFooter is the name of the library that we defined in webpack.config.js */\nCommerceHeaderFooter.showFooter('footer', {env:'prod', consumer_host:'https://www.barnesandnoble.com', styling:'responsive'});\n\n\n\n\n\n",
        "rating": 3,
        "price": "$20.00",
        "image": "//prodimage.images-bn.com/pimages/2940169499674_p0_v2_s600x595.jpg",
        "author": "James Clear",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Pink Lemonade Cake Murder",
        "description": "\n<B>Fans of deliciously charming, page-turning whodunits rejoice! Beloved <I>New York Times bestselling author and Queen of the Culinary Mystery Joanne Fluke delivers the twenty-eighth mouthwatering Hannah Swensen Mystery!<BR> &#160; <B><I>In this irresistible mystery from<B> New York Times<I> and USA Today<I> bestselling author Joanne Fluke, Hannah Swensen is at the center of a lively summer fest with fun for everyone in Lake Eden, Minnesota&mdash;including a cold-blooded murderer . . . <BR> &#160;<BR> The Tri-County Summer Solstice Celebration has come to town, and even among local artisans, athletes, and marching bands, Hannah attracts fans of her own while serving lip-smacking pink lemonade desserts. But the mood sours when a body turns up, leading revelers to wonder if the festivities mark both the <I>longest day of the year and the <I>deadliest . . .<BR> &#160;<BR> A retired professional MLB player has met a terrifying end&mdash;and, considering the rumors swirling about his past, the list of suspects could fill a small stadium. Among them could soon be Delores, Hannah&rsquo;s mother, who publicly held a grunge against the victim after he infamously dunked her in the tank at a previous county fair . . . &#160;<BR> &#160;<BR> Now, with her mother&rsquo;s innocence on the line, a life-changing announcement at The Cookie Jar, and a plethora of desserts to bake, Hannah can&rsquo;t afford to strike out as she begins a dangerous investigation into the ruthless killer who&rsquo;s truly in a league of their own . . . &#160;<BR><B>Features Over a Dozen Cookie and Dessert Recipes from The Cookie Jar!<BR> &#160;",
        "rating": 5,
        "price": "$22.95",
        "image": "//prodimage.images-bn.com/pimages/9781496736130_p0_v1_s600x595.jpg",
        "author": "Joanne Fluke",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec34f"
    },
    {
        "name": "Benedict Cumberbatch Reads Sherlock Holmes' Rediscovered Railway Mysteries: Four original short stories",
        "description": "Benedict Cumberbatch reads these four new Sherlock Holmes stories by John Taylor'An Inscrutable Masquerade'/ 'The Conundrum of Coach 13'/ 'The Trinity Vicarage Larceny'/ 'The 10.59 Assassin'Inspired by Arthur Conan Doyle's original Sherlock Holmes stories, John Taylor has written four more mysteries featuring the world's greatest detective. Read by acclaimed actor Benedict Cumberbatch, these new adventures share all the suspense of the original tales.In a drawer in his bureau, Dr Watson keeps a locked cedarwood chest - a 'box of secrets'. It contains an archive of notes referring to some of Holmes' cases that, for one reason or another, never saw the light of day. Now, for the first time, Watson has decided to reveal the truth to the world... In these four thrilling stories, Holmes experiments with the science of ballistics, locates some missing gold bullion, investigates the theft of a large amount of money and solves the baffling mystery of the Stovey murder.",
        "rating": 3,
        "price": "$12.00",
        "image": "//prodimage.images-bn.com/pimages/2940169215595_p0_v1_s600x595.jpg",
        "author": "John Taylor",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "Neon Gods (Dark Olympus #1)",
        "description": "\nHe was supposed to be a myth. But from the moment I crossed the River Styx and fell under his dark spell...he was, quite simply, mine.*A scorchingly hot modern retelling of Hades and Persephone that's as sinful as it is sweet.*Society darling Persephone Dimitriou plans to flee the ultra-modern city of Olympus and start over far from the backstabbing politics of the Thirteen Houses. But all that's ripped away when her mother ambushes her with an engagement to Zeus, the dangerous power behind their glittering city's dark facade.With no options left, Persephone flees to the forbidden undercity and makes a devil's bargain with a man she once believed a myth...a man who awakens her to a world she never knew existed.Hades has spent his life in the shadows, and he has no intention of stepping into the light. But when he finds that Persephone can offer a little slice of the revenge he's spent years craving, it's all the excuse he needs to help her&#8212;for a price. Yet every breathless night spent tangled together has given Hades a taste for Persephone, and he'll go to war with Olympus itself to keep her close...\"Deliciously inventive...Red-hot.\"&#8212;Publishers Weekly STARRED\"I get shivers just thinking of their interactions. SHIVERS.\"&#8212;Mimi Koehler for The Nerd DailyThe World of Dark Olympus:Neon Gods (Hades & Persephone)Electric Idol (Eros & Psyche)Wicked Beauty (Achilles & Patroclus & Helen)Radiant Sin (Apollo & Cassandra)",
        "rating": 5,
        "price": "$9.99",
        "image": "//prodimage.images-bn.com/pimages/9781728231747_p0_v2_s600x595.jpg",
        "author": "Katee Robert",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The First to Die at the End (B&N Exclusive Edition)",
        "description": "\nThis Barnes & Noble Exclusive Edition includes a bonus short story, author Q&A, printed endpapers, and a unique cover and case stamp!In this prequel to #1 New York Times bestselling phenomenon They Both Die at the End, two new strangers spend a life-changing day together after Death-Cast first makes their fateful calls. It&#8217;s the night before Death-Cast goes live, and there&#8217;s one question on everyone&#8217;s mind: Can Death-Cast actually predict when someone will die, or is it just an elaborate hoax?Orion Pagan has waited years for someone to tell him that he&#8217;s going to die. He has a serious heart condition, and he signed up for Death-Cast so he could know what&#8217;s coming. Valentino Prince is restarting his life in New York. He has a long and promising future ahead and he only registered for Death-Cast after his twin sister nearly died in a car accident. Orion and Valentino cross paths in Times Square and immediately feel a deep connection. But when the first round of End Day calls goes out, their lives are changed forever&#8212;one of them receives a call, and the other doesn&#8217;t. Though neither boy is certain how the day will end, they know they want to spend it together&#8230;even if that means their goodbye will be heartbreaking.Told with acclaimed author Adam Silvera&#8217;s signature bittersweet touch, this story celebrates the lasting impact that people have on each other and proves that life is always worth living to the fullest. \n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"Product_Tabs_loading_start\");\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10391,Starts-->\n<!-- Code Change For ATG-10391,Ends-->\n<!-- Code Change For ATG-10237,Ends-->\n\n\nRelated collections and offers\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\n#BookTok: The Most Popular Books on TikTok\n\n<!-- ATG-23625 Starts For Check Mark -->\n\n\n\n\nBarnes &amp; Noble Exclusives\n\n\n\n\n\n\n\nProduct Details\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\nAbout the Author\n\n\n\n\n\n\n\nProduct Details\n\n\n<!-- changes start for ATG-9471 -->\n\nISBN-13:\n<!-- changes End for ATG-9471 -->\n9780063274105\n\n\nPublisher:\n\nHarperCollins Publishers\n\n\n Publication date:\n10/04/2022\n\nEdition description:\nB&N Exclusive Edition\n\n Pages:\n416\n\nSales rank:\n393\n\nProduct dimensions:\n 5.50(w) x 8.25(h) x (d)\n\nAge Range:\n13 Years\n\n\n\n\n\n\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n<!-- Code Change For ATG-10237,Starts -->\n<!-- Code Change For ATG-10237,Ends -->\n\nAbout the Author\n\n<!-- ATG-10370 : Adding header after empty check for image-->\n\n\n\n\n\n\n<!-- ATG-10370 : Adding header after empty check for content and image-->\n\n\nAdam Silvera&#160;is the number one&#160;New York Times&#160;bestselling author of&#160;More Happy Than Not,&#160;History Is All You Left Me,&#160;They Both Die at the End,&#160;Infinity Son,&#160;Infinity Reaper,&#160;and&#8212;with Becky Albertalli&#8212;What If It&#8217;s Us. He was named a&#160;Publishers Weekly&#160;Flying Start for his debut. Adam was born and raised in the Bronx. He was a bookseller before shifting to children&#8217;s publishing and has worked at a literary development company and a creative writing website for teens and as a book reviewer of children&#8217;s and young adult novels. He is tall for no reason and lives in Los Angeles. Visit him online at&#160;www.adamsilvera.com.\n<!-- ATG-10370 : Adding header after empty check for image, content and authorbiocommentary -->\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Product_Tabs_loading_end\");\nperformance.measure(\n\"productTabsDur\",\n\"Product_Tabs_loading_start\",\n\"Product_Tabs_loading_end\"\n);\n}\n\n<!-- Gigya Changes -->\n<!-- Gigya Changes -->\n\nCustomer Reviews\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nscript defer>\n$(function() {\nvar isLoggedIn = false;\nvar ratingsParams = {\ncategoryID: 'Products',\nstreamID: '1140571310', /* use Product ID for unique identifier? SkuID? - prd9780063274105 - ProductID? */\ncontainerID: 'ratingsDisplay',\nwidth: '100%',\nshowCommentButton: false,\nratingTemplate: '',\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#ratingsDisplay'),\n// numRating = $(\".gig-average-review\").html();\n//SRL-2749\nnumRating = $('.gig-rating-stars').attr('title') || $(\".gig-average-review\").html() || 0;\nvar skutype = 'book',\n$headerReviewLink = $('.sticky-left .gig-rating-readReviewsLink'),\nreviewCountTxt = $reviewLink.html();\nif($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n}\nelse if(skutype == 'book' || skutype == 'eBook'){\nif($reviewLink.html() === \"1 Review\"){\nreviewCountTxt = reviewCountTxt.replace(\"Review\", \"Customer Review\");\n}\nelse{\nreviewCountTxt = reviewCountTxt.replace(\"Reviews\", \"Customer Reviews\");\n}\n$headerReviewLink.html(reviewCountTxt);\n}\nvar widthOfAuthor= calculateWidthOfauthor();\nvar widthOfReadReviewsLink= parseInt($('.header-gigiya-wrapper .gig-rating-readReviewsLink').width());\nif($('.read-review-header').length)\t{\n$('.read-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\nif($('#EditorialReviews').length){\n$('.editorial-review-header').removeClass('hidden');\n$('.header-gigiya-wrapper .header-gigiya-inner').width(250 + widthOfAuthor + widthOfReadReviewsLink );\n}\n$(\"#avgRating\").html(\"Average Rating: \" + numRating);\n//SRL-2749 : Star rating information is not clear\nvar ariaText = numRating + \" rating out of 5 Stars\";\n$(\".gig-rating-stars\").attr('aria-label',ariaText);\ninitBuyOptnsPDP();\n}\n},\nratingsParamsComments = {\ncategoryID: 'Products',\nstreamID: '1140571310',\ncontainerID: 'prodReviewInfo',\nratingTemplate:\n'' +\n'',\nwidth: '100%',\nshowCommentButton: false,\nonReadReviewsClicked: gotoReviews,\nonLoad: function() {\nvar $reviewLink = $('.gig-rating-readReviewsLink','#prodReviewInfo'),\nnumRating = $('#ratingsDisplay .gig-rating-stars').attr('title') || $(\".gig-average-review\").first().text() || 0;\nif ($reviewLink.html() === \"0 Reviews\") {\n$reviewLink.html(\"Be the first to write a review\");\n$('.customer-reviews-body h3').hide();\n$('.reviews-view-all').hide();\n$('.customer-reviews-body').append('');\n}\n\n// Analytics set review and ratings\nif(typeof s_setP !== 'undefined' && typeof s_getP !== 'undefined') {\nvar digitalDataRating = s_getP('digitalData.product[0].attributes.rating'),\ndigitalDataReview = s_getP('digitalData.product[0].attributes.reviews'),\nnumReview = 0,\n$review = $('.gig-rating-readReviewsLink').first(),\nreviewStringParse = '';\nif($review.length > 0) {\nreviewStringParse = $review.text();\nnumReview = reviewStringParse.replace(/reviews/gi,'').trim();\n}\nif(typeof digitalDataRating == 'undefined' || digitalDataRating != numRating) {\ns_setP('digitalData.product[0].attributes.rating', parseFloat(numRating));\n}\n\nif((typeof digitalDataReview == 'undefined' || digitalDataReview != numReview) && !isNaN(numReview)) {\ns_setP('digitalData.product[0].attributes.reviews', parseInt(numReview, 10));\n}\n\n}\n// Gigya ratings and reviews loads after document is ready,\n// so direct call needs to called onload instead\n$(document).trigger('analytics-track-pdp');\n}\n},\nparams = {\ncategoryID: \"Products\",\nstreamID: \"1140571310\",\ncallback:updateDOM\n},\ncommentParams = {\nversion:2,\nsort: 'votesDesc',\nthreaded: true,\n\nthreadLimit: 3,\n\ncategoryID: 'Products',\nstreamID: '1140571310',\ncontainerID: 'reviews-list',\nwidth: '100%',\nuseSiteLogin: true,\nonLoad: function() {\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_ends\");\nperformance.measure(\n\"customerReviewsDur\",\n\"Customer_Reviews_Gigya_loading_starts\",\n\"Customer_Reviews_Gigya_loading_ends\"\n);\n}\n//ATG-23455 : remove fixed height for the comments container\n$('.gig-comments-more').on('click', function(){\n$('#reviews-list').css('height','100%');\n});\n//SRL-2731\n$('div.gig-simpleShareUI-button').each(function(){\nvar ariaTitle = $(this).find('.gig-simpleShareUI-buttonText').text();\n$(this).children('.gig-simpleShareUI-button-inner').attr({\nrole:'button',\ntitle : ariaTitle\n});\n});\n$('.gig-simpleShareUI-closeButton').attr('role', 'button');\n$('.gig-simpleShareUI-closeButton').attr('title','Close');\n//SRL-2731 ends\n//ATG-19340 starts\nvar adColumnHeight = $('#adcontainer1').outerHeight(true);\nif(adColumnHeight<19){\n$('.customer-reviews-body').css({'min-height': \"0px\"});\n}\n//ATG-19772 starts : to set min-height for mouse hover in customer-reviews\nelse{\n$('.customer-reviews-body').css({'min-height': \"300px\"});\n}\n//ATG-19772 ends\n//ATG-19340 ends\n//ADA SRL-2382\n$('.gig-comment-shareLink').each(function(){\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar triggerEle = $(this);\nvar focusPlaced = function(){\n$('.gig-simpleShareUI-closeButton').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-closeButton').focus();\n$('.gig-simpleShareUI-closeButton').on('keydown click',function(e){\nif(e.keyCode === 13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-buttonText-more').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$('.gig-simpleShareUI-buttonText-facebook').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-email').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-twitter').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-googleplus').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-messenger').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-linkedin').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-digg').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-delicious').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-hyves').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-baidu').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-more').attr({\n'tabindex' : '0',\n'role' : 'link'\n});\n$('.gig-simpleShareUI-buttonText-facebook').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-email').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-twitter').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-googleplus').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-messenger').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-linkedin').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-digg').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-delicious').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-stumbleupon').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-hyves').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n$('.gig-simpleShareUI-buttonText-baidu').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\nvar socialModalFocus = function(){\n$('img[style=\"cursor:pointer;\"]:first').attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Close'\n});\n$(\"img[id$='arrow_left']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous'\n});\n$(\"img[id$='arrow_right']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next'\n});\n$(\"img[id$='arrow_right_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Next Disabled'\n});\n$(\"img[id$='arrow_left_disable']\").attr({\n'tabindex' : '0',\n'role' : 'button',\n'aria-label' : 'Previous Disabled'\n});\n$('img[style=\"cursor:pointer;\"]:first').focus();\n$('img[style=\"cursor:pointer;\"]:first').on('keydown click',function(e){\nvar triggerElement = $(this);\nif(e.keyCode==13){\n$(this).trigger('click');\n$(triggerEle).focus();\n}\nelse if(e.type == 'click'){\n$(triggerEle).focus();\n}\n});\n$(\"img[id$='arrow_right']\").on('keydown',function(e){\nif((!e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:first').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_right_disable']\").on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$(\"img[id$='arrow_left']\").on('keydown',function(e){\nif((e.shiftKey && e.keyCode==9) || e.keyCode==13){\n$(this).trigger('click');\nsetTimeout(function(){\n$('.tabbing-button:visible:last').focus();\n},0);\n}\n});\n$(\"img[id$='arrow_left_disable']\").on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\n$('img[style=\"cursor:pointer;\"]:first').focus();\ne.preventDefault();\n}\n});\n$('img[style=\"cursor:pointer;\"]:first').on('keydown',function(e){\nif(e.shiftKey && e.keyCode==9){\nif($(\"img[id$='arrow_right']\").is(':visible')){\n$(\"img[id$='arrow_right']\").focus();\ne.preventDefault();\n}\nelse\n$('img[id$=\"arrow_right_disable\"]').focus();\ne.preventDefault();\n}\n});\n$(\"[id$='_showShareUI_bookmarksWidget_page']\").find(\"table\").each(function(){\n$(this).find(\"tr\").each(function(){\nif($(this).find(\"table\").length > 0){\n$(this).find(\"table\").each(function(){\n$(this).find(\"td\").each(function(){\nvar title = $(this).find(\"div\").attr(\"title\");\n$(this).find(\"div\").find(\"button\").attr(\"aria-label\",title);\n});\n});\n}\n});\n});\n}\n$('.gig-simpleShareUI-buttonText-more').on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\nelse if(!e.shiftKey && e.keyCode==9){\n$('.gig-simpleShareUI-closeButton').focus();\ne.preventDefault();\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($(\"img[id$='arrow_left']\").length > 0){\nsocialModalFocus();\nclearInterval(check);\n}\n},200);\n}\n});\n}\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\nelse if(e.type == 'click'){\nvar check = setInterval(function(){\nif($('.gig-simpleShareUI-closeButton').length > 0){\nfocusPlaced();\nclearInterval(check);\n}\n},200);\n}\n});\n});\n$('.gig-comment-flag').each(function(){\nvar target=$(this);\n$(this).attr({\nrole:'link',\ntabindex:'0',\n});\nvar focusGiven = function(){\n$('.gig-comments-dialog-close').attr({\n'tabindex' : '0',\n'role' : 'button',\n'title' : 'Close'\n});\n$('.gig-comments-dialog-button-ok').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-button-cancel').attr({\n'tabindex' : '0',\n'role' : 'button'\n});\n$('.gig-comments-dialog-close').focus();\n$('.gig-comments-dialog-close').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-cancel').focus();\ne.preventDefault();\n}\n});\n$('.gig-comments-dialog-button-cancel').on('keydown',function(e){\nif(!e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-button-ok').focus();\ne.preventDefault();\n}\nelse if(e.keyCode==13){\n$(this).trigger('click');\n$(target).focus();\n}\n});\n$('.gig-comments-dialog-button-ok').on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\nelse if(e.shiftKey && e.keyCode==9){\n$(this).parents('.gig-comments-dialog').find('.gig-comments-dialog-close').focus();\ne.preventDefault();\n}\n});\n}\n$(this).attr('tabindex','0');\n$(this).on('keydown click',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\nfocusGiven();\n}\nelse if(e.type == 'click'){\nfocusGiven();\n}\n});\n});\n$('.gig-comment-vote-pos').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-vote-neg').each(function(){\n$(this).attr({\nrole:'button',\ntabindex:'0',\n});\n$(this).on('keydown',function(e){\nif(e.keyCode==13){\n$(this).trigger('click');\n}\n});\n});\n$('.gig-comment-content').each(function(){\n$(this).attr('tabindex','0');\n});\n//ADA SRL-2382 ends\nvar reviewsContainer = $('#reviews-container');\nvar commentsContainer = $('.gig-comments-comments');\nvar pos = $('.gig-comment-vote-pos');\nvar neg = $('.gig-comment-vote-neg');\nif (commentsContainer.is(':empty')) {\nreturn;\n} else {\nreviewsContainer.removeClass('hidden');\n}\nif (!isLoggedIn) {\npos.addClass('sign-in-link');\nneg.addClass('sign-in-link');\n}\n/* SRL-461 : Providing suitable aria-label for the Like and Diskike button in Customer Reviews */\n$(\".gig-comment-self-data\").each(function(i) {\nvar like = $(this).find('.gig-comment-vote-pos').html() + \" people like this review.\" ;\nvar dislike = $(this).find('.gig-comment-vote-neg').html() + \" people dislike this review.\" ;\n$(this).find('.gig-comment-vote-pos').attr('aria-label',like);\n$(this).find('.gig-comment-vote-neg').attr('aria-label',dislike);\n});\n$(\".gig-comment-title\").each(function(index) {\nvar count = $(this).find(\".gig-comment-rating-star-full\").length;\nvar maxCount = $(this).find(\".gig-comment-rating-star\").length;\nvar reviewRating = \"This review rates \" + count + \" out of \" + maxCount + \" stars.\";\n$(this).prepend('Rating: ' + count + ' out of '+ maxCount + '');\n$(this).find(\".gig-comment-rating\").attr({\"aria-label\":reviewRating , \"role\":\"img\" , \"title\":count , \"alt\":count});\n});\n}\n};\nfunction updateDOM(response) {\nvar overallRating = response.streamInfo.avgRatings._overall;\nif ( response.errorCode == 0 ) {\n$(\".gig-average-review\").html(overallRating);\n}\n}\nfunction gotoReviews(eventObj) {\nvar skutype = 'book',\n$reviewLink = $('.gig-rating-readReviewsLink'),\nreviewLocation = eventObj && eventObj.instanceID ? eventObj.instanceID : '',\nsetLocation = (reviewLocation === 'ratingsDisplay') ? 'topOfPage' : 'customerReviewsBox';\n$(document).triggerHandler('analytics-reviews-clicked', {location: setLocation});\nif ($reviewLink.html() === \"Be the first to write a review\") {\n$(\"#writeReviewBtn\").click();\n} else {\nif(skutype == 'book' || skutype == 'eBook'){\ndocument.getElementById('reviews').scrollIntoView();\n} else {\nwindow.location = \"/reviews/the-first-to-die-at-the-end-adam-silvera/1140571310?ean=9780063274105#reviews-header\";\n}\n}\n}\nif(typeof gigya != 'undefined') {\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Customer_Reviews_Gigya_loading_starts\");\n}\n// gigya.comments.getStreamInfo(params);\n// gigya.comments.showRatingUI(ratingsParams);\n//gigya.comments.showRatingUI(ratingsParamsComments);\n//gigya.comments.showCommentsUI(commentParams);\n}\n});\nfunction calculateWidthOfauthor(){\nvar widthAuthor= 0;\nif($(\".header-gigiya-wrapper .sticky-author .contributors\").find(\"a\").length > 0){\n$('.header-gigiya-wrapper .sticky-author .contributors a').each(function(){\nwidthAuthor += parseFloat($(this).width())+ 12;\n});\n}\nelse{\nwidthAuthor += $(\".header-gigiya-wrapper .sticky-author .contributors\").width();\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Director')>-1){\nwidthAuthor +=45;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('Cast')>-1){\nwidthAuthor +=25;\n}\nif($('.header-gigiya-wrapper .sticky-author .contributors').text().indexOf('by')>-1){\nwidthAuthor +=15;\n}\nreturn widthAuthor;\n}\n\n\n\n\n<!-- Internal Component Tracking - Begin -->\n<!-- Internal Component Tracking - End -->\n\nif(typeof performance.mark !== 'undefined')\nperformance.mark(\"BloomReach_Widget_loading_starts\");\n\n\n<!-- Related Searches -->\n\n\n\n\nsection data-modifyslick class=\"book bloomReachRelatedSearch\">\n\nRelated Searches\n\n\n\n\n\n\n\nFlash Fire (The Extraordinaries Serie&#8230;\n\n\n\n\n\n\n\nJay's Gay Agenda\n\n\n\n\n\n\n\nThis Is Why They Hate Us\n\n\n\n\n\n\n\nHere the Whole Time\n\n\n\n\n\n\n\nMay the Best Man Win\n\n\n\n\n\n\n\nA Little Bit Country\n\n\n\n\n\n\n\n\n\n<!-- Explore More Items -->\n\n\n\n\nsection data-modifyslick class=\"mb-5 book bloomReachExploreItems\">\n\nExplore More Items\n\n\n\n\n\n\n\n\nThe First to Die at the End (B&N Exclusive Edition)\n\nThis Barnes & Noble Exclusive Edition includes a bonus short story, author Q&A, printed endpapers, and a unique cover and case stamp!In this prequel to #1 New York Times bestselling phenomenon They\n\nSee Details\n\n\n\n\n\n\n\n\n\nKiss & Tell\n\n\"Kiss & Tell is a total rush! Perfectly sweet and swoon worthy. I loved every page!\" &ndash;&#160;Julie Murphy, New York Times bestselling author of Dumplin&rsquo;&#160;A smart, sexy YA novel about a \n\nSee Details\n\n\n\n\n\n\n\n\n\nSo This Is Ever After\n\n<B>An instant <I>New York Times bestseller!<BR> <BR>Carry On meets Arthurian legend in this funny, subversive young adult fantasy about what happens after the chosen one wins the kingdom and has to get married to\n\nSee Details\n\n\n\n\n\n\n\n\n\nHere's to Us (Signed Book)\n\nBecky Albertalli and Adam Silvera reunite to continue the story of Arthur and Ben, the boys readers first fell for in the New York Times bestselling rom-com What If It&#8217;s Us.Ben survived\n\nSee Details\n\n\n\n\n\n\n\n\n\nAristotle and Dante Dive into the Waters of the World\n\nThe highly anticipated sequel to the critically acclaimed, multiple award-winning novel Aristotle and Dante Discover the Secrets of the Universe is an achingly romantic, tender tale sure to captivate \n\nSee Details\n\n\n\n\n\n\n\n\n\nHere's to Us\n\n#1 New York Times bestseller! Becky Albertalli and Adam Silvera reunite to continue the story of Arthur and Ben, the boys readers first fell for in the bestselling rom-com What If It&#8217;s Us.Ben\n\nSee Details\n\n\n\n\n\n\n\n\n\nThey Both Die at the End\n\nAdam Silvera reminds us that there&#8217;s no life without death and no love without loss in this devastating yet uplifting story about two people whose lives change over the course of one\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Aristotle and Dante Collection: Aristotle and Dante Discover the Secrets of the Universe; Aristotle and Dante Dive into the Waters of the World\n\nBoth the critically acclaimed, multiple award-winning Aristotle and Dante Discover the Secrets of the Universe and its highly anticipated sequel Aristotle and Dante Dive into the Waters of the World\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe First to Die at the End\n\nIn this prequel to #1 New York Times bestselling phenomenon They Both Die at the End, two new strangers spend a life-changing day together after Death-Cast first makes their fateful calls. It&#8217;s \n\nSee Details\n\n\n\n\n\n\n\n\n\nWhat If It's Us\n\nA New York Times, USA Today, and Indie bestseller! Critically acclaimed and bestselling authors Becky Albertalli and Adam Silvera combine their talents in this smart, funny, heartfelt collaboration\n\nSee Details\n\n\n\n\n\n\n\n\n\nIn Deeper Waters\n\n&ldquo;A frothy confection of sea-foam, young love, and derring-do.&rdquo; &#8212;NPR <BR> <BR>From the <I>New York Times bestselling author of <I>So This Is Ever After, a young prince must rely on a mysterious\n\nSee Details\n\n\n\n\n\n\n\n\n\nThe Darkness Outside Us\n\nThey Both Die at the End&#160;meets&#160;The Loneliest Girl in the Universe&#160;in this mind-bending sci-fi mystery and tender love story about two boys aboard a spaceship sent on a rescue mission,\n\nSee Details\n\n\n\n\n\n\n\n\n\nAnd They Lived . . .\n\nFrom the author of Can't Take That Away comes a sex-positive, fairytale-inspired YA novel that celebrates first love and self-acceptance, perfect for fans of What If It's Us. \"My heart didn't stand a \n\nSee Details\n\n\n\n\n\n\n\n\n\nIcebreaker\n\nA. L. Graziadei's Icebreaker is an irresistible YA debut about two hockey players fighting to be the best&#8212;and the romance that catches them by surprise along the way.Seventeen-year-old Mickey\n\nSee Details\n\n\n\n\n\n\n\n\n\nHeat Wave (The Extraordinaries Series #3)\n\nHeat Wave is the explosive finale to the thrilling and &#8220;uproariously funny&#8221; (Sophie Gonzales) Extraordinaries trilogy by New York Times and USA Today bestselling author TJ Klune!Nick,\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\nif(typeof performance.mark !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_starts\");\n}\n\n\n<!-- ATG-26331 remove google analytics-->\n\nif(typeof performance.mark !== 'undefined' && typeof performance.measure !== 'undefined')\n{\nperformance.mark(\"Global_Footer_loading_ends\");\nperformance.measure(\n\"globalFooterDur\",\n\"Global_Footer_loading_starts\",\n\"Global_Footer_loading_ends\"\n);\n}\n\n<!-- ATG-26338 : Add modal for PDP, PLP -->\n<!-- ATG-26338 : Ends -->\nvar isresponsive= true;\n<!-- All Javascripts in js-scripts-ra.jsp has to be minified. ALl JS has to be moved to release dir as per grunt minification -->\n\n$.webshims.setOptions('basePath','//js.js-bn.com/static/redesign/srcs/js/vendor/js-webshim-1.15/minified/shims/');\n$.webshims.polyfill('es5 forms forms-ext');\n\n\nscript defer async type=\"text/javascript\" src=\"https://request.eprotect.vantivcnp.com/eProtect/eProtect-api3.js\">\n\n\nif(!$.isEmptyObject(digitalData)){\nvar digitalData1 = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Boys in life->Teen fiction\",\"Friendship->Teen fiction\",\"Gay friendship and romance->Teen fiction\",\"Suicide and death->Teen fiction\"],\"productType\":\"book\"},\"price\":{\"basePrice\":15.99},\"productInfo\":{\"departmentCode\":\"6\",\"sku\":\"9780063274105\",\"productName\":\"The First to Die at the End (B&N Exclusive Edition)\",\"productID\":\"prd9780063274105\",\"productURL\":\"/w/the-first-to-die-at-the-end-adam-silvera/1140571310?ean=9780063274105\"},\"attributes\":{\"outOfStock\":false,\"reviews\":0,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":0,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"C81749409ED6C158A598E6E7757D6B13\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:24 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:the-first-to-die-at-the-end-bn-exclusive-edition|1140571310\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060474507\"}}]}]};\n$.extend(digitalData,digitalData1);\n}else{\n\nvar digitalData = {\"product\":[{\"category\":{\"primaryCategory\":\"Books\",\"subCategory\":[\"Boys in life->Teen fiction\",\"Friendship->Teen fiction\",\"Gay friendship and romance->Teen fiction\",\"Suicide and death->Teen fiction\"],\"productType\":\"book\"},\"price\":{\"basePrice\":15.99},\"productInfo\":{\"departmentCode\":\"6\",\"sku\":\"9780063274105\",\"productName\":\"The First to Die at the End (B&N Exclusive Edition)\",\"productID\":\"prd9780063274105\",\"productURL\":\"/w/the-first-to-die-at-the-end-adam-silvera/1140571310?ean=9780063274105\"},\"attributes\":{\"outOfStock\":false,\"reviews\":0,\"isDeviceProduct\":false,\"isDigitalProduct\":false,\"pickupInStoreStatus\":\"instore pickup available:geo or store unselected\",\"isEbookProduct\":false,\"isPhysicalProduct\":true,\"rating\":0,\"isIosAvailable\":true,\"isNOOKProduct\":false,\"notifyWhenStocked\":false}}],\"session\":{\"sessionID\":\"C81749409ED6C158A598E6E7757D6B13\",\"serverName\":\"prodny_store01\"},\"page\":{\"timestamp\":\"Wed Aug 03 19:56:24 EDT 2022\",\"category\":{\"hierarchy\":\"\"},\"pageInfo\":{\"pageType\":\"pdp\",\"pageName\":\"pdp:the-first-to-die-at-the-end-bn-exclusive-edition|1140571310\",\"language\":\"en\",\"geoRegion\":\"US\",\"breadCrumbs\":[\"home\"],\"ipAddress\":\"197.63.68.179\"}},\"cart\":{\"price\":{\"shipping\":0,\"priceWithTax\":0,\"transationalTotal\":0,\"basePrice\":0,\"currency\":\"USD\"}},\"user\":[{\"cohort\":\"Non-Members\",\"profile\":[{\"profileInfo\":{\"profileID\":\"59060474507\"}}]}]};\n\n}\nif (typeof s_setP !== 'undefined') {\ns_setP('digitalData.component[0].componentInfo.componentName','you may also like');\ns_setP('digitalData.component[0].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[0].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[1].componentInfo.componentName','more in this series');\ns_setP('digitalData.component[1].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[1].componentInfo.primaryCategory','internal campaign');\ns_setP('digitalData.component[2].componentInfo.componentName','recently-viewed');\ns_setP('digitalData.component[2].componentInfo.componentLocation','pdp-productmaincontent');\ns_setP('digitalData.component[2].componentInfo.primaryCategory','internal campaign');\n\n}\n$(document).ready(function(){\nif (typeof s_setP !== 'undefined') {\n\nBN.Analytics.PDP.init();\n\nBN.Analytics.Generic.GoogleAds();\n\n}\n});\n\n\n\n\n\nvar cname = \"internalCampaign\",\ncvalue = null;\nvar curCookie = cname + \"=\" + cvalue +\n\"; expires= Thu, 01 Jan 1970 00:00:01 GMT;\" +\n\"; path=\" + \"/\" +\n\"; domain=\" + SITE_DOMAIN;\ndocument.cookie = curCookie;\n\n\n\n\n\n\n\n\n\nvar bopisEligibiltyMessage = $('#bopisEligibleMessage').val();\nvar storeName = $('#storeName').val();\nvar storeID = $('#storeID').val();\nif(typeof s_setP !== 'undefined') {\nif(s_getP('digitalData.user[0].profile[0].profileInfo.storeName') == undefined){\ns_setP('digitalData.user[0].profile[0].profileInfo.storeName', storeName);\ns_setP('digitalData.user[0].profile[0].profileInfo.storeID', storeID);\n}\nif(bopisEligibiltyMessage == 'productAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available:geo or store selected');\n}\nelse if((bopisEligibiltyMessage == 'productNotAvailable') || (bopisEligibiltyMessage == 'notEligibleForBopis')){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup unavailable:geo or store selected');\n}\nelse if(bopisEligibiltyMessage == 'storeNotAvailable'){\ns_setP('digitalData.product[0].attributes.pickupInStoreStatus', 'instore pickup available: geo or store unselected');\n}\n}\n\n\n/*Check id google ad needs to be loaded after page load*/\n\nvar asyncRelatedAdsEnabled = true;\nvar endemicAd = true;\n$(document).on('googleRelatedAdsLoaded', function() {\n\n})\n\n\n\n\n\n\n\n\n_satellite.pageBottom();\n\ndocument.write(\"<\\/script>\");\n/*CommerceHeaderFooter is the name of the library that we defined in webpack.config.js */\nCommerceHeaderFooter.showFooter('footer', {env:'prod', consumer_host:'https://www.barnesandnoble.com', styling:'responsive'});\n\n\n\n\n\n",
        "rating": 4,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/9780063274105_p0_v3_s600x595.jpg",
        "author": "Adam Silvera",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9780063274105_p1_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780063274105_p2_v5_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Kingdom of the Feared (B&N Exclusive Edition) (Kingdom of the Wicked Series #3)",
        "description": "\n<B>This Barnes & Noble Exclusive Edition contains a spicy bonus chapter from Envy’s POV and features a unique cover!From the #1 <I>New York Times bestselling author of the Stalking Jack the Ripper series comes the steamy conclusion to Kingdom of the Wicked trilogy.<B><I>Two curses.<BR><B><I>One prophecy.<BR><B><I>A reckoning all have feared.<B><I>And a love more powerful than fate. All hail the king and queen of Hell.Emilia is reeling from a shocking discovery about her sister, Vittoria. But before she faces the demons of her past, Emilia yearns to claim her king, the seductive Prince of Wrath, in the flesh. She doesn’t just desire his body; she wants his heart and soul—but that’s something the enigmatic demon can’t promise her.When a high-ranking member of House Greed is assassinated, damning evidence somehow points to Vittoria as the murderer. Now, Emilia will do anything to get to the bottom of these accusations against the sister she thought she knew. Together, Emilia and Wrath play a sin-fueled game of deception to solve the murder and stop the unrest that’s brewing between witches, demons, shape-shifters, and the most treacherous foes of all: the Feared. Emilia was warned that when it came to the Wicked, nothing was as it seemed. But have the true villains been much closer all along?#1 New York Times bestselling author Kerri Maniscalco delivers sizzling romance, sexy secrets, and unexpected twists in this unforgettable conclusion to the Kingdom of the Wicked series.Suggested for ages 16 and up. \n",
        "rating": 4,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/9780316479882_p0_v2_s600x595.jpg",
        "author": "Kerri Maniscalco",
        "thumbnails": [
            "//prodimage.images-bn.com/pimages/9780316479882_p1_v3_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780316479882_p2_v4_s600x595.jpg",
            "//prodimage.images-bn.com/pimages/9780316479882_p3_v5_s600x595.jpg"
        ],
        "categoryId": "62eb0b249bb05c59378ec34d"
    },
    {
        "name": "The Wedding Date",
        "description": "\nA groomsman and his last-minute guest are about to discover if a fake date can go the distance in this fun and flirty multicultural romance debut by&#160;New York Times bestselling author Jasmine Guillory&mdash;author of the Resse Witherspoon x Hello Sunshine Book Club Pick The Proposal.THE USA TODAY BESTSELLER#5 LibraryReads Pick&ldquo;A swoony rom-com brimming with humor and charm.&rdquo;&mdash;Entertainment Weekly&#160;(The Must List)&ldquo;What a charming, warm, sexy gem of a novel....One of the best books I've read in a while.&rdquo;&mdash;Roxane Gay, New York Times bestselling author of HungerAgreeing to go to a wedding with a guy she gets stuck with in an elevator is something Alexa Monroe wouldn't normally do. But there's something about Drew Nichols that's too hard to resist.On the eve of his ex's wedding festivities, Drew is minus a plus one. Until a power outage strands him with the perfect candidate for a fake girlfriend....After Alexa and Drew have more fun than they ever thought possible, Drew has to fly back to Los Angeles and his job as a pediatric surgeon, and Alexa heads home to Berkeley, where she's the mayor's chief of staff. Too bad they can't stop thinking about the other....They're just two high-powered professionals on a collision course toward the long distance dating disaster of the century&#151;or closing the gap between what they think they need and what they truly want....One of...Entertainment Weekly&rsquo;s&#160;&ldquo;12 Romances for V-Day&rdquo;&#160;&bull;&#160;Cosmopolitan&rsquo;s&#160;&ldquo;2018 Anticipated Reads&rdquo;&#160;&bull;&#160;Elle&rsquo;s&#160;&ldquo;2018 Must Reads&rdquo;&#160;&bull;&#160;Harpers Bazaar&rsquo;s&#160;&ldquo;New January Must Reads&rdquo;&#160;&bull;&#160;The Fug Girls&rsquo;&#160;&ldquo;Best Books of the Year&rdquo;&#160;&bull;&#160;Elle UK&rsquo;s&#160;&ldquo;Books to Get You Through 2018&rdquo;&#160;&bull;&#160;Nylon&rsquo;s&#160;&ldquo;January Must Reads&rdquo;&#160;&bull;&#160;Hello Giggles&rsquo;&#160;&ldquo;New Release Recs&rdquo;&#160;&bull;&#160;Electric Lit&rsquo;s&#160;&ldquo;Books by WoC to Read in 2018&rdquo;&#160;&bull;&#160;Bitch Media&rsquo;s&#160;&ldquo;2018 Must Reads&rdquo;&#160;&bull;&#160;BookBub&rsquo;s&#160;&ldquo;2018 Romance Must Reads&rdquo;&#160;&bull;&#160;Bookriot&rsquo;s&#160;&ldquo;Must Read 2018 January Releases&rdquo;&#160;&bull;&#160;RetailMeNot&rsquo;s&#160;&ldquo;2018 Must Reads&rdquo;",
        "rating": 4,
        "price": "$15.00",
        "image": "//prodimage.images-bn.com/pimages/9780399587665_p0_v8_s600x595.jpg",
        "author": "Jasmine Guillory",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Grave Reservations: A Novel",
        "description": "A psychic travel agent and a Seattle PD detective try to solve a murder in this “ebullient tap dance of a mystery” (Christopher Moore, New York Times bestselling author)-perfect for fans of Lisa Lutz's The Spellman Files and Elle Cosimano's Finlay Donovan series.Meet Leda Foley: devoted friend, struggling travel agent, and inconsistent psychic. Impulsively re-booking Seattle PD detective Grady Merritt's flight, she has no idea that her life is about to change in ways she could have never foretold. When his original plane blows up on the runway, Grady begins to suspect that Leda's special abilities could help him with a cold case he just can't crack. Despite her scattershot premonitions, she agrees to join the investigation for a secret reason: her fiancé's murder remains unsolved. Leda's psychic abilities couldn't help that sad case, but she's been honing her skills and drawing a crowd at her favorite bar's open-mic nights, where she performs her klairvoyant karaoke-singing whatever song comes to mind when she holds people's personal effects. Now joined by a ragtag group of bar patrons and pals, Leda and Grady set out to catch a killer-and learn how the two cases that haunt them have more in common than they ever suspected.",
        "rating": 5,
        "price": "$19.99",
        "image": "//prodimage.images-bn.com/pimages/2940176986723_p0_v2_s600x595.jpg",
        "author": "Cherie Priest",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Duke and I (Bridgerton Series #1) (TV Tie-in)",
        "description": "\nA #1 New York Times&#160;Bestseller&#160;From #1&#160;New York Times&#160;bestselling author Julia Quinn comes the story of Daphne Bridgerton, in the first of her beloved Regency-set novels featuring the charming, powerful Bridgerton family, now a series created by Shondaland for Netflix. In the ballrooms and drawing rooms of Regency London, rules abound. From their earliest days, children of aristocrats learn how to address an earl and curtsey before a prince&#8212;while other dictates of the ton are unspoken yet universally understood. A proper duke should be imperious and aloof. A young, marriageable lady should be amiable&#8230;but not too amiable.Daphne Bridgerton has always failed at the latter. The fourth of eight siblings in her close-knit family, she has formed friendships with the most eligible young men in London. Everyone likes Daphne for her kindness and wit. But no one truly desires her. She is simply too deuced honest for that, too unwilling to play the romantic games that captivate gentlemen.Amiability is not a characteristic shared by Simon Basset, Duke of Hastings. Recently returned to England from abroad, he intends to shun both marriage and society&#8212;just as his callous father shunned Simon throughout his painful childhood. Yet an encounter with his best friend&#8217;s sister offers another option. If Daphne agrees to a fake courtship, Simon can deter the mamas who parade their daughters before him. Daphne, meanwhile, will see her prospects and her reputation soar.The plan works like a charm&#8212;at first. But amid the glittering, gossipy, cut-throat world of London&#8217;s elite, there is only one certainty&#58; love ignores every rule...This novel includes the 2nd epilogue, a peek at the story after the story. ",
        "rating": 3,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9780063078901_p0_v3_s600x595.jpg",
        "author": "Julia Quinn",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "The Unhoneymooners",
        "description": "\nTHE INSTANT NEW YORK TIMES BESTSELLER! <BR> <BR>Starred reviews from Kirkus Reviews * Publishers Weekly * Library Journal <BR> <BR>Named a &ldquo;Must-Read&rdquo; by TODAY, Us Weekly, Bustle, BuzzFeed, Goodreads, Entertainment Weekly, Publishers Weekly, Southern Living, Book Riot, Woman&rsquo;s Day, The Toronto Star, and more!<BR> <BR>For two sworn enemies, anything can happen during the Hawaiian trip of a lifetime&#8212;maybe even love&#8212;in this romantic comedy from the New York Times bestselling authors of Roomies.<BR><BR>Olive Torres is used to being the unlucky twin&#58; from inexplicable mishaps to a recent layoff, her life seems to be almost comically jinxed. By contrast, her sister Ami is an eternal champion...she even managed to finance her entire wedding by winning a slew of contests. Unfortunately for Olive, the only thing worse than constant bad luck is having to spend the wedding day with the best man (and her nemesis), Ethan Thomas.<BR> <BR> Olive braces herself for wedding hell, determined to put on a brave face, but when the entire wedding party gets food poisoning, the only people who aren&rsquo;t affected are Olive and Ethan. Suddenly there&rsquo;s a free honeymoon up for grabs, and Olive will be damned if Ethan gets to enjoy paradise solo.<BR> <BR> Agreeing to a temporary truce, the pair head for Maui. After all, ten days of bliss is worth having to assume the role of loving newlyweds, right? But the weird thing is...Olive doesn&rsquo;t mind playing pretend. In fact, the more she pretends to be the luckiest woman alive, the more it feels like she might be.<BR> <BR> With Christina Lauren&rsquo;s &ldquo;uniquely hilarious and touching voice&rdquo; (Entertainment Weekly), The Unhoneymooners is a romance for anyone who has ever felt unlucky in love.",
        "rating": 5,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9781501128035_p0_v8_s600x595.jpg",
        "author": "Christina Lauren",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Ugly Love",
        "description": "\nFrom Colleen Hoover, the #1 New York Times bestselling author of It Ends with Us, a heart-wrenching love story that proves attraction at first sight can be messy. <BR><BR>When Tate Collins meets airline pilot Miles Archer, she doesn't think it's love at first sight. They wouldn&rsquo;t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn&rsquo;t want love, she doesn&rsquo;t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her.<BR> <BR>Never ask about the past. <BR> Don&rsquo;t expect a future.<BR> <BR>They think they can handle it, but realize almost immediately they can&rsquo;t handle it at all.<BR> <BR>Hearts get infiltrated. <BR> Promises get broken. <BR> Rules get shattered.<BR> Love gets ugly.",
        "rating": 3,
        "price": "$16.99",
        "image": "//prodimage.images-bn.com/pimages/9781476753188_p0_v9_s600x595.jpg",
        "author": "Colleen Hoover",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    },
    {
        "name": "Benedict Cumberbatch Reads Sherlock Holmes' Rediscovered Railway Mysteries: Four original short stories",
        "description": "Benedict Cumberbatch reads these four new Sherlock Holmes stories by John Taylor'An Inscrutable Masquerade'/ 'The Conundrum of Coach 13'/ 'The Trinity Vicarage Larceny'/ 'The 10.59 Assassin'Inspired by Arthur Conan Doyle's original Sherlock Holmes stories, John Taylor has written four more mysteries featuring the world's greatest detective. Read by acclaimed actor Benedict Cumberbatch, these new adventures share all the suspense of the original tales.In a drawer in his bureau, Dr Watson keeps a locked cedarwood chest - a 'box of secrets'. It contains an archive of notes referring to some of Holmes' cases that, for one reason or another, never saw the light of day. Now, for the first time, Watson has decided to reveal the truth to the world... In these four thrilling stories, Holmes experiments with the science of ballistics, locates some missing gold bullion, investigates the theft of a large amount of money and solves the baffling mystery of the Stovey murder.",
        "rating": 1,
        "price": "$12.00",
        "image": "//prodimage.images-bn.com/pimages/2940169215595_p0_v1_s600x595.jpg",
        "author": "John Taylor",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec353"
    },
    {
        "name": "The Kiss Quotient",
        "description": "\nFrom the author of The Bride Test comes a romance novel hailed as one of The Washington Post&rsquo;s 50 Notable Works of Fiction in 2018&#160;and one of Amazon&rsquo;s Top 100 Books of 2018!&ldquo;This is such a fun read and it's also quite original and sexy and sensitive.&rdquo;&mdash;Roxane Gay, New York Times bestselling author &ldquo;Hoang's writing bursts from the page.&rdquo;&mdash;BuzzfeedA heartwarming and refreshing debut novel that proves one thing&#58; there's not enough data in the world to predict what will make your heart tick.Stella Lane thinks math is the only thing that unites the universe. She comes up with algorithms to predict customer purchases&mdash;a job that has given her more money than she knows what to do with, and way less experience in the dating department than the average thirty-year-old.It doesn't help that Stella has Asperger's and French kissing reminds her of a shark getting its teeth cleaned by pilot fish. Her conclusion&#58; she needs lots of practice&mdash;with a professional. Which is why she hires escort Michael Phan. The Vietnamese and Swedish stunner can't afford to turn down Stella's offer, and agrees to help her check off all the boxes on her lesson plan&mdash;from foreplay to more-than-missionary position...Before long, Stella not only learns to appreciate his kisses, but crave all of the other things he's making her feel. Their no-nonsense partnership starts making a strange kind of sense. And the pattern that emerges will convince Stella that love is the best kind of logic...",
        "rating": 3,
        "price": "$16.00",
        "image": "//prodimage.images-bn.com/pimages/9780451490803_p0_v2_s600x595.jpg",
        "author": "Helen Hoang",
        "thumbnails": [],
        "categoryId": "62eb0b249bb05c59378ec351"
    }
]